let locateData = [{
  'area_id': '1',
  'code': '110000',
  'p_code': '0',
  'name': '北京',
  'children': [{
    'area_id': '2',
    'code': '110100',
    'p_code': '110000',
    'name': '北京市',
    'children': [{
      'area_id': '3',
      'code': '110101',
      'p_code': '110100',
      'name': '东城区'
    },
    {
      'area_id': '21',
      'code': '110102',
      'p_code': '110100',
      'name': '西城区'
    },
    {
      'area_id': '37',
      'code': '110105',
      'p_code': '110100',
      'name': '朝阳区'
    },
    {
      'area_id': '81',
      'code': '110106',
      'p_code': '110100',
      'name': '丰台区'
    },
    {
      'area_id': '103',
      'code': '110107',
      'p_code': '110100',
      'name': '石景山区'
    },
    {
      'area_id': '113',
      'code': '110108',
      'p_code': '110100',
      'name': '海淀区'
    },
    {
      'area_id': '143',
      'code': '110109',
      'p_code': '110100',
      'name': '门头沟区'
    },
    {
      'area_id': '157',
      'code': '110111',
      'p_code': '110100',
      'name': '房山区'
    },
    {
      'area_id': '186',
      'code': '110112',
      'p_code': '110100',
      'name': '通州区'
    },
    {
      'area_id': '202',
      'code': '110113',
      'p_code': '110100',
      'name': '顺义区'
    },
    {
      'area_id': '228',
      'code': '110114',
      'p_code': '110100',
      'name': '昌平区'
    },
    {
      'area_id': '251',
      'code': '110115',
      'p_code': '110100',
      'name': '大兴区'
    },
    {
      'area_id': '274',
      'code': '110116',
      'p_code': '110100',
      'name': '怀柔区'
    },
    {
      'area_id': '292',
      'code': '110117',
      'p_code': '110100',
      'name': '平谷区'
    },
    {
      'area_id': '311',
      'code': '110228',
      'p_code': '110100',
      'name': '密云区'
    },
    {
      'area_id': '333',
      'code': '110229',
      'p_code': '110100',
      'name': '延庆区'
    }
    ]
  }]
},
{
  'area_id': '352',
  'code': '120000',
  'p_code': '0',
  'name': '天津',
  'children': [{
    'area_id': '353',
    'code': '120100',
    'p_code': '120000',
    'name': '天津市',
    'children': [{
      'area_id': '354',
      'code': '120101',
      'p_code': '120100',
      'name': '和平区'
    },
    {
      'area_id': '361',
      'code': '120102',
      'p_code': '120100',
      'name': '河东区'
    },
    {
      'area_id': '375',
      'code': '120103',
      'p_code': '120100',
      'name': '河西区'
    },
    {
      'area_id': '389',
      'code': '120104',
      'p_code': '120100',
      'name': '南开区'
    },
    {
      'area_id': '402',
      'code': '120105',
      'p_code': '120100',
      'name': '河北区'
    },
    {
      'area_id': '413',
      'code': '120106',
      'p_code': '120100',
      'name': '红桥区'
    },
    {
      'area_id': '424',
      'code': '120110',
      'p_code': '120100',
      'name': '东丽区'
    },
    {
      'area_id': '442',
      'code': '120111',
      'p_code': '120100',
      'name': '西青区'
    },
    {
      'area_id': '456',
      'code': '120112',
      'p_code': '120100',
      'name': '津南区'
    },
    {
      'area_id': '472',
      'code': '120113',
      'p_code': '120100',
      'name': '北辰区'
    },
    {
      'area_id': '494',
      'code': '120114',
      'p_code': '120100',
      'name': '武清区'
    },
    {
      'area_id': '533',
      'code': '120115',
      'p_code': '120100',
      'name': '宝坻区'
    },
    {
      'area_id': '564',
      'code': '120116',
      'p_code': '120100',
      'name': '滨海新区'
    },
    {
      'area_id': '606',
      'code': '120221',
      'p_code': '120100',
      'name': '宁河区'
    },
    {
      'area_id': '628',
      'code': '120223',
      'p_code': '120100',
      'name': '静海区'
    },
    {
      'area_id': '650',
      'code': '120225',
      'p_code': '120100',
      'name': '蓟州区'
    }
    ]
  }]
},
{
  'area_id': '678',
  'code': '130000',
  'p_code': '0',
  'name': '河北省',
  'children': [{
    'area_id': '679',
    'code': '130100',
    'p_code': '130000',
    'name': '石家庄市',
    'children': [{
      'area_id': '680',
      'code': '130102',
      'p_code': '130100',
      'name': '长安区'
    },
    {
      'area_id': '697',
      'code': '130104',
      'p_code': '130100',
      'name': '桥西区'
    },
    {
      'area_id': '715',
      'code': '130105',
      'p_code': '130100',
      'name': '新华区'
    },
    {
      'area_id': '731',
      'code': '130107',
      'p_code': '130100',
      'name': '井陉矿区'
    },
    {
      'area_id': '737',
      'code': '130108',
      'p_code': '130100',
      'name': '裕华区'
    },
    {
      'area_id': '751',
      'code': '130121',
      'p_code': '130100',
      'name': '井陉县'
    },
    {
      'area_id': '769',
      'code': '130123',
      'p_code': '130100',
      'name': '正定县'
    },
    {
      'area_id': '780',
      'code': '130124',
      'p_code': '130100',
      'name': '栾城区'
    },
    {
      'area_id': '789',
      'code': '130125',
      'p_code': '130100',
      'name': '行唐县'
    },
    {
      'area_id': '805',
      'code': '130126',
      'p_code': '130100',
      'name': '灵寿县'
    },
    {
      'area_id': '821',
      'code': '130127',
      'p_code': '130100',
      'name': '高邑县'
    },
    {
      'area_id': '827',
      'code': '130128',
      'p_code': '130100',
      'name': '深泽县'
    },
    {
      'area_id': '834',
      'code': '130129',
      'p_code': '130100',
      'name': '赞皇县'
    },
    {
      'area_id': '846',
      'code': '130130',
      'p_code': '130100',
      'name': '无极县'
    },
    {
      'area_id': '858',
      'code': '130131',
      'p_code': '130100',
      'name': '平山县'
    },
    {
      'area_id': '882',
      'code': '130132',
      'p_code': '130100',
      'name': '元氏县'
    },
    {
      'area_id': '899',
      'code': '130133',
      'p_code': '130100',
      'name': '赵县'
    },
    {
      'area_id': '911',
      'code': '130181',
      'p_code': '130100',
      'name': '辛集市'
    },
    {
      'area_id': '928',
      'code': '130182',
      'p_code': '130100',
      'name': '藁城区'
    },
    {
      'area_id': '944',
      'code': '130183',
      'p_code': '130100',
      'name': '晋州市'
    },
    {
      'area_id': '955',
      'code': '130184',
      'p_code': '130100',
      'name': '新乐市'
    },
    {
      'area_id': '968',
      'code': '130185',
      'p_code': '130100',
      'name': '鹿泉区'
    }
    ]
  },
  {
    'area_id': '982',
    'code': '130200',
    'p_code': '130000',
    'name': '唐山市',
    'children': [{
      'area_id': '983',
      'code': '130202',
      'p_code': '130200',
      'name': '路南区'
    },
    {
      'area_id': '1000',
      'code': '130203',
      'p_code': '130200',
      'name': '路北区'
    },
    {
      'area_id': '1014',
      'code': '130204',
      'p_code': '130200',
      'name': '古冶区'
    },
    {
      'area_id': '1025',
      'code': '130205',
      'p_code': '130200',
      'name': '开平区'
    },
    {
      'area_id': '1037',
      'code': '130207',
      'p_code': '130200',
      'name': '丰南区'
    },
    {
      'area_id': '1055',
      'code': '130208',
      'p_code': '130200',
      'name': '丰润区'
    },
    {
      'area_id': '1083',
      'code': '130223',
      'p_code': '130200',
      'name': '滦县'
    },
    {
      'area_id': '1098',
      'code': '130224',
      'p_code': '130200',
      'name': '滦南县'
    },
    {
      'area_id': '1116',
      'code': '130225',
      'p_code': '130200',
      'name': '乐亭县'
    },
    {
      'area_id': '1136',
      'code': '130227',
      'p_code': '130200',
      'name': '迁西县'
    },
    {
      'area_id': '1156',
      'code': '130229',
      'p_code': '130200',
      'name': '玉田县'
    },
    {
      'area_id': '1177',
      'code': '130230',
      'p_code': '130200',
      'name': '曹妃甸区'
    },
    {
      'area_id': '1196',
      'code': '130281',
      'p_code': '130200',
      'name': '遵化市'
    },
    {
      'area_id': '1224',
      'code': '130283',
      'p_code': '130200',
      'name': '迁安市'
    }
    ]
  },
  {
    'area_id': '1244',
    'code': '130300',
    'p_code': '130000',
    'name': '秦皇岛市',
    'children': [{
      'area_id': '1245',
      'code': '130302',
      'p_code': '130300',
      'name': '海港区'
    },
    {
      'area_id': '1269',
      'code': '130303',
      'p_code': '130300',
      'name': '山海关区'
    },
    {
      'area_id': '1279',
      'code': '130304',
      'p_code': '130300',
      'name': '北戴河区'
    },
    {
      'area_id': '1286',
      'code': '130321',
      'p_code': '130300',
      'name': '青龙满族自治县'
    },
    {
      'area_id': '1312',
      'code': '130322',
      'p_code': '130300',
      'name': '昌黎县'
    },
    {
      'area_id': '1331',
      'code': '130323',
      'p_code': '130300',
      'name': '抚宁区'
    },
    {
      'area_id': '1343',
      'code': '130324',
      'p_code': '130300',
      'name': '卢龙县'
    }
    ]
  },
  {
    'area_id': '1357',
    'code': '130400',
    'p_code': '130000',
    'name': '邯郸市',
    'children': [{
      'area_id': '1358',
      'code': '130402',
      'p_code': '130400',
      'name': '邯山区'
    },
    {
      'area_id': '1380',
      'code': '130403',
      'p_code': '130400',
      'name': '丛台区'
    },
    {
      'area_id': '1400',
      'code': '130404',
      'p_code': '130400',
      'name': '复兴区'
    },
    {
      'area_id': '1413',
      'code': '130406',
      'p_code': '130400',
      'name': '峰峰矿区'
    },
    {
      'area_id': '1423',
      'code': '130423',
      'p_code': '130400',
      'name': '临漳县'
    },
    {
      'area_id': '1438',
      'code': '130424',
      'p_code': '130400',
      'name': '成安县'
    },
    {
      'area_id': '1448',
      'code': '130425',
      'p_code': '130400',
      'name': '大名县'
    },
    {
      'area_id': '1469',
      'code': '130426',
      'p_code': '130400',
      'name': '涉县'
    },
    {
      'area_id': '1488',
      'code': '130427',
      'p_code': '130400',
      'name': '磁县'
    },
    {
      'area_id': '1501',
      'code': '130428',
      'p_code': '130400',
      'name': '肥乡区'
    },
    {
      'area_id': '1511',
      'code': '130429',
      'p_code': '130400',
      'name': '永年区'
    },
    {
      'area_id': '1529',
      'code': '130430',
      'p_code': '130400',
      'name': '邱县'
    },
    {
      'area_id': '1537',
      'code': '130431',
      'p_code': '130400',
      'name': '鸡泽县'
    },
    {
      'area_id': '1545',
      'code': '130432',
      'p_code': '130400',
      'name': '广平县'
    },
    {
      'area_id': '1553',
      'code': '130433',
      'p_code': '130400',
      'name': '馆陶县'
    },
    {
      'area_id': '1562',
      'code': '130434',
      'p_code': '130400',
      'name': '魏县'
    },
    {
      'area_id': '1584',
      'code': '130435',
      'p_code': '130400',
      'name': '曲周县'
    },
    {
      'area_id': '1595',
      'code': '130481',
      'p_code': '130400',
      'name': '武安市'
    }
    ]
  },
  {
    'area_id': '1618',
    'code': '130500',
    'p_code': '130000',
    'name': '邢台市',
    'children': [{
      'area_id': '1619',
      'code': '130502',
      'p_code': '130500',
      'name': '桥东区'
    },
    {
      'area_id': '1627',
      'code': '130503',
      'p_code': '130500',
      'name': '桥西区'
    },
    {
      'area_id': '1638',
      'code': '130521',
      'p_code': '130500',
      'name': '邢台县'
    },
    {
      'area_id': '1659',
      'code': '130522',
      'p_code': '130500',
      'name': '临城县'
    },
    {
      'area_id': '1668',
      'code': '130523',
      'p_code': '130500',
      'name': '内丘县'
    },
    {
      'area_id': '1678',
      'code': '130524',
      'p_code': '130500',
      'name': '柏乡县'
    },
    {
      'area_id': '1685',
      'code': '130525',
      'p_code': '130500',
      'name': '隆尧县'
    },
    {
      'area_id': '1699',
      'code': '130526',
      'p_code': '130500',
      'name': '任县'
    },
    {
      'area_id': '1708',
      'code': '130527',
      'p_code': '130500',
      'name': '南和县'
    },
    {
      'area_id': '1717',
      'code': '130528',
      'p_code': '130500',
      'name': '宁晋县'
    },
    {
      'area_id': '1735',
      'code': '130529',
      'p_code': '130500',
      'name': '巨鹿县'
    },
    {
      'area_id': '1746',
      'code': '130530',
      'p_code': '130500',
      'name': '新河县'
    },
    {
      'area_id': '1753',
      'code': '130531',
      'p_code': '130500',
      'name': '广宗县'
    },
    {
      'area_id': '1762',
      'code': '130532',
      'p_code': '130500',
      'name': '平乡县'
    },
    {
      'area_id': '1770',
      'code': '130533',
      'p_code': '130500',
      'name': '威县'
    },
    {
      'area_id': '1787',
      'code': '130534',
      'p_code': '130500',
      'name': '清河县'
    },
    {
      'area_id': '1794',
      'code': '130535',
      'p_code': '130500',
      'name': '临西县'
    },
    {
      'area_id': '1804',
      'code': '130581',
      'p_code': '130500',
      'name': '南宫市'
    },
    {
      'area_id': '1820',
      'code': '130582',
      'p_code': '130500',
      'name': '沙河市'
    }
    ]
  },
  {
    'area_id': '1836',
    'code': '130600',
    'p_code': '130000',
    'name': '保定市',
    'children': [{
      'area_id': '1837',
      'code': '130602',
      'p_code': '130600',
      'name': '竞秀区'
    },
    {
      'area_id': '1851',
      'code': '130603',
      'p_code': '130600',
      'name': '莲池区'
    },
    {
      'area_id': '1869',
      'code': '130621',
      'p_code': '130600',
      'name': '满城区'
    },
    {
      'area_id': '1882',
      'code': '130622',
      'p_code': '130600',
      'name': '清苑区'
    },
    {
      'area_id': '1901',
      'code': '130623',
      'p_code': '130600',
      'name': '涞水县'
    },
    {
      'area_id': '1918',
      'code': '130624',
      'p_code': '130600',
      'name': '阜平县'
    },
    {
      'area_id': '1932',
      'code': '130625',
      'p_code': '130600',
      'name': '徐水区'
    },
    {
      'area_id': '1947',
      'code': '130626',
      'p_code': '130600',
      'name': '定兴县'
    },
    {
      'area_id': '1964',
      'code': '130627',
      'p_code': '130600',
      'name': '唐县'
    },
    {
      'area_id': '1985',
      'code': '130628',
      'p_code': '130600',
      'name': '高阳县'
    },
    {
      'area_id': '1995',
      'code': '130629',
      'p_code': '130600',
      'name': '容城县'
    },
    {
      'area_id': '2004',
      'code': '130630',
      'p_code': '130600',
      'name': '涞源县'
    },
    {
      'area_id': '2022',
      'code': '130631',
      'p_code': '130600',
      'name': '望都县'
    },
    {
      'area_id': '2031',
      'code': '130632',
      'p_code': '130600',
      'name': '安新县'
    },
    {
      'area_id': '2044',
      'code': '130633',
      'p_code': '130600',
      'name': '易县'
    },
    {
      'area_id': '2072',
      'code': '130634',
      'p_code': '130600',
      'name': '曲阳县'
    },
    {
      'area_id': '2091',
      'code': '130635',
      'p_code': '130600',
      'name': '蠡县'
    },
    {
      'area_id': '2105',
      'code': '130636',
      'p_code': '130600',
      'name': '顺平县'
    },
    {
      'area_id': '2116',
      'code': '130637',
      'p_code': '130600',
      'name': '博野县'
    },
    {
      'area_id': '2124',
      'code': '130638',
      'p_code': '130600',
      'name': '雄县'
    },
    {
      'area_id': '2134',
      'code': '130681',
      'p_code': '130600',
      'name': '涿州市'
    },
    {
      'area_id': '2150',
      'code': '130682',
      'p_code': '130600',
      'name': '定州市'
    },
    {
      'area_id': '2176',
      'code': '130683',
      'p_code': '130600',
      'name': '安国市'
    },
    {
      'area_id': '2188',
      'code': '130684',
      'p_code': '130600',
      'name': '高碑店市'
    }
    ]
  },
  {
    'area_id': '2204',
    'code': '130700',
    'p_code': '130000',
    'name': '张家口市',
    'children': [{
      'area_id': '2205',
      'code': '130702',
      'p_code': '130700',
      'name': '桥东区'
    },
    {
      'area_id': '2217',
      'code': '130703',
      'p_code': '130700',
      'name': '桥西区'
    },
    {
      'area_id': '2229',
      'code': '130705',
      'p_code': '130700',
      'name': '宣化区'
    },
    {
      'area_id': '2251',
      'code': '130706',
      'p_code': '130700',
      'name': '下花园区'
    },
    {
      'area_id': '2258',
      'code': '130722',
      'p_code': '130700',
      'name': '张北县'
    },
    {
      'area_id': '2280',
      'code': '130723',
      'p_code': '130700',
      'name': '康保县'
    },
    {
      'area_id': '2298',
      'code': '130724',
      'p_code': '130700',
      'name': '沽源县'
    },
    {
      'area_id': '2317',
      'code': '130725',
      'p_code': '130700',
      'name': '尚义县'
    },
    {
      'area_id': '2332',
      'code': '130726',
      'p_code': '130700',
      'name': '蔚县'
    },
    {
      'area_id': '2355',
      'code': '130727',
      'p_code': '130700',
      'name': '阳原县'
    },
    {
      'area_id': '2370',
      'code': '130728',
      'p_code': '130700',
      'name': '怀安县'
    },
    {
      'area_id': '2382',
      'code': '130729',
      'p_code': '130700',
      'name': '万全区'
    },
    {
      'area_id': '2394',
      'code': '130730',
      'p_code': '130700',
      'name': '怀来县'
    },
    {
      'area_id': '2412',
      'code': '130731',
      'p_code': '130700',
      'name': '涿鹿县'
    },
    {
      'area_id': '2430',
      'code': '130732',
      'p_code': '130700',
      'name': '赤城县'
    },
    {
      'area_id': '2449',
      'code': '130733',
      'p_code': '130700',
      'name': '崇礼区'
    }
    ]
  },
  {
    'area_id': '2461',
    'code': '130800',
    'p_code': '130000',
    'name': '承德市',
    'children': [{
      'area_id': '2462',
      'code': '130802',
      'p_code': '130800',
      'name': '双桥区'
    },
    {
      'area_id': '2478',
      'code': '130803',
      'p_code': '130800',
      'name': '双滦区'
    },
    {
      'area_id': '2487',
      'code': '130804',
      'p_code': '130800',
      'name': '鹰手营子矿区'
    },
    {
      'area_id': '2493',
      'code': '130821',
      'p_code': '130800',
      'name': '承德县'
    },
    {
      'area_id': '2517',
      'code': '130822',
      'p_code': '130800',
      'name': '兴隆县'
    },
    {
      'area_id': '2538',
      'code': '130823',
      'p_code': '130800',
      'name': '平泉县'
    },
    {
      'area_id': '2558',
      'code': '130824',
      'p_code': '130800',
      'name': '滦平县'
    },
    {
      'area_id': '2580',
      'code': '130825',
      'p_code': '130800',
      'name': '隆化县'
    },
    {
      'area_id': '2606',
      'code': '130826',
      'p_code': '130800',
      'name': '丰宁满族自治县'
    },
    {
      'area_id': '2633',
      'code': '130827',
      'p_code': '130800',
      'name': '宽城满族自治县'
    },
    {
      'area_id': '2652',
      'code': '130828',
      'p_code': '130800',
      'name': '围场满族蒙古族自治县'
    }
    ]
  },
  {
    'area_id': '2692',
    'code': '130900',
    'p_code': '130000',
    'name': '沧州市',
    'children': [{
      'area_id': '2693',
      'code': '130902',
      'p_code': '130900',
      'name': '新华区'
    },
    {
      'area_id': '2701',
      'code': '130903',
      'p_code': '130900',
      'name': '运河区'
    },
    {
      'area_id': '2711',
      'code': '130921',
      'p_code': '130900',
      'name': '沧县'
    },
    {
      'area_id': '2731',
      'code': '130922',
      'p_code': '130900',
      'name': '青县'
    },
    {
      'area_id': '2743',
      'code': '130923',
      'p_code': '130900',
      'name': '东光县'
    },
    {
      'area_id': '2753',
      'code': '130924',
      'p_code': '130900',
      'name': '海兴县'
    },
    {
      'area_id': '2764',
      'code': '130925',
      'p_code': '130900',
      'name': '盐山县'
    },
    {
      'area_id': '2777',
      'code': '130926',
      'p_code': '130900',
      'name': '肃宁县'
    },
    {
      'area_id': '2787',
      'code': '130927',
      'p_code': '130900',
      'name': '南皮县'
    },
    {
      'area_id': '2797',
      'code': '130928',
      'p_code': '130900',
      'name': '吴桥县'
    },
    {
      'area_id': '2809',
      'code': '130929',
      'p_code': '130900',
      'name': '献县'
    },
    {
      'area_id': '2829',
      'code': '130930',
      'p_code': '130900',
      'name': '孟村回族自治县'
    },
    {
      'area_id': '2836',
      'code': '130981',
      'p_code': '130900',
      'name': '泊头市'
    },
    {
      'area_id': '2853',
      'code': '130982',
      'p_code': '130900',
      'name': '任丘市'
    },
    {
      'area_id': '2876',
      'code': '130983',
      'p_code': '130900',
      'name': '黄骅市'
    },
    {
      'area_id': '2895',
      'code': '130984',
      'p_code': '130900',
      'name': '河间市'
    }
    ]
  },
  {
    'area_id': '2918',
    'code': '131000',
    'p_code': '130000',
    'name': '廊坊市',
    'children': [{
      'area_id': '2919',
      'code': '131002',
      'p_code': '131000',
      'name': '安次区'
    },
    {
      'area_id': '2931',
      'code': '131003',
      'p_code': '131000',
      'name': '广阳区'
    },
    {
      'area_id': '2943',
      'code': '131022',
      'p_code': '131000',
      'name': '固安县'
    },
    {
      'area_id': '2954',
      'code': '131023',
      'p_code': '131000',
      'name': '永清县'
    },
    {
      'area_id': '2967',
      'code': '131024',
      'p_code': '131000',
      'name': '香河县'
    },
    {
      'area_id': '2979',
      'code': '131025',
      'p_code': '131000',
      'name': '大城县'
    },
    {
      'area_id': '2991',
      'code': '131026',
      'p_code': '131000',
      'name': '文安县'
    },
    {
      'area_id': '3005',
      'code': '131028',
      'p_code': '131000',
      'name': '大厂回族自治县'
    },
    {
      'area_id': '3012',
      'code': '131081',
      'p_code': '131000',
      'name': '霸州市'
    },
    {
      'area_id': '3026',
      'code': '131082',
      'p_code': '131000',
      'name': '三河市'
    }
    ]
  },
  {
    'area_id': '3041',
    'code': '131100',
    'p_code': '130000',
    'name': '衡水市',
    'children': [{
      'area_id': '3042',
      'code': '131102',
      'p_code': '131100',
      'name': '桃城区'
    },
    {
      'area_id': '3055',
      'code': '131121',
      'p_code': '131100',
      'name': '枣强县'
    },
    {
      'area_id': '3067',
      'code': '131122',
      'p_code': '131100',
      'name': '武邑县'
    },
    {
      'area_id': '3077',
      'code': '131123',
      'p_code': '131100',
      'name': '武强县'
    },
    {
      'area_id': '3084',
      'code': '131124',
      'p_code': '131100',
      'name': '饶阳县'
    },
    {
      'area_id': '3092',
      'code': '131125',
      'p_code': '131100',
      'name': '安平县'
    },
    {
      'area_id': '3101',
      'code': '131126',
      'p_code': '131100',
      'name': '故城县'
    },
    {
      'area_id': '3115',
      'code': '131127',
      'p_code': '131100',
      'name': '景县'
    },
    {
      'area_id': '3132',
      'code': '131128',
      'p_code': '131100',
      'name': '阜城县'
    },
    {
      'area_id': '3143',
      'code': '131181',
      'p_code': '131100',
      'name': '冀州区'
    },
    {
      'area_id': '3155',
      'code': '131182',
      'p_code': '131100',
      'name': '深州市'
    }
    ]
  }
  ]
},
{
  'area_id': '3176',
  'code': '140000',
  'p_code': '0',
  'name': '山西省',
  'children': [{
    'area_id': '3177',
    'code': '140100',
    'p_code': '140000',
    'name': '太原市',
    'children': [{
      'area_id': '3178',
      'code': '140105',
      'p_code': '140100',
      'name': '小店区'
    },
    {
      'area_id': '3190',
      'code': '140106',
      'p_code': '140100',
      'name': '迎泽区'
    },
    {
      'area_id': '3199',
      'code': '140107',
      'p_code': '140100',
      'name': '杏花岭区'
    },
    {
      'area_id': '3213',
      'code': '140108',
      'p_code': '140100',
      'name': '尖草坪区'
    },
    {
      'area_id': '3228',
      'code': '140109',
      'p_code': '140100',
      'name': '万柏林区'
    },
    {
      'area_id': '3244',
      'code': '140110',
      'p_code': '140100',
      'name': '晋源区'
    },
    {
      'area_id': '3251',
      'code': '140121',
      'p_code': '140100',
      'name': '清徐县'
    },
    {
      'area_id': '3261',
      'code': '140122',
      'p_code': '140100',
      'name': '阳曲县'
    },
    {
      'area_id': '3276',
      'code': '140123',
      'p_code': '140100',
      'name': '娄烦县'
    },
    {
      'area_id': '3285',
      'code': '140181',
      'p_code': '140100',
      'name': '古交市'
    }
    ]
  },
  {
    'area_id': '3300',
    'code': '140200',
    'p_code': '140000',
    'name': '大同市',
    'children': [{
      'area_id': '3301',
      'code': '140202',
      'p_code': '140200',
      'name': '城区'
    },
    {
      'area_id': '3317',
      'code': '140203',
      'p_code': '140200',
      'name': '矿区'
    },
    {
      'area_id': '3346',
      'code': '140211',
      'p_code': '140200',
      'name': '南郊区'
    },
    {
      'area_id': '3357',
      'code': '140212',
      'p_code': '140200',
      'name': '新荣区'
    },
    {
      'area_id': '3366',
      'code': '140221',
      'p_code': '140200',
      'name': '阳高县'
    },
    {
      'area_id': '3380',
      'code': '140222',
      'p_code': '140200',
      'name': '天镇县'
    },
    {
      'area_id': '3392',
      'code': '140223',
      'p_code': '140200',
      'name': '广灵县'
    },
    {
      'area_id': '3402',
      'code': '140224',
      'p_code': '140200',
      'name': '灵丘县'
    },
    {
      'area_id': '3415',
      'code': '140225',
      'p_code': '140200',
      'name': '浑源县'
    },
    {
      'area_id': '3434',
      'code': '140226',
      'p_code': '140200',
      'name': '左云县'
    },
    {
      'area_id': '3444',
      'code': '140227',
      'p_code': '140200',
      'name': '大同县'
    }
    ]
  },
  {
    'area_id': '3459',
    'code': '140300',
    'p_code': '140000',
    'name': '阳泉市',
    'children': [{
      'area_id': '3460',
      'code': '140302',
      'p_code': '140300',
      'name': '城区'
    },
    {
      'area_id': '3467',
      'code': '140303',
      'p_code': '140300',
      'name': '矿区'
    },
    {
      'area_id': '3474',
      'code': '140311',
      'p_code': '140300',
      'name': '郊区'
    },
    {
      'area_id': '3484',
      'code': '140321',
      'p_code': '140300',
      'name': '平定县'
    },
    {
      'area_id': '3495',
      'code': '140322',
      'p_code': '140300',
      'name': '盂县'
    }
    ]
  },
  {
    'area_id': '3510',
    'code': '140400',
    'p_code': '140000',
    'name': '长治市',
    'children': [{
      'area_id': '3511',
      'code': '140421',
      'p_code': '140400',
      'name': '长治县'
    },
    {
      'area_id': '3525',
      'code': '140423',
      'p_code': '140400',
      'name': '襄垣县'
    },
    {
      'area_id': '3539',
      'code': '140424',
      'p_code': '140400',
      'name': '屯留县'
    },
    {
      'area_id': '3554',
      'code': '140425',
      'p_code': '140400',
      'name': '平顺县'
    },
    {
      'area_id': '3567',
      'code': '140426',
      'p_code': '140400',
      'name': '黎城县'
    },
    {
      'area_id': '3577',
      'code': '140427',
      'p_code': '140400',
      'name': '壶关县'
    },
    {
      'area_id': '3591',
      'code': '140428',
      'p_code': '140400',
      'name': '长子县'
    },
    {
      'area_id': '3604',
      'code': '140429',
      'p_code': '140400',
      'name': '武乡县'
    },
    {
      'area_id': '3619',
      'code': '140430',
      'p_code': '140400',
      'name': '沁县'
    },
    {
      'area_id': '3633',
      'code': '140431',
      'p_code': '140400',
      'name': '沁源县'
    },
    {
      'area_id': '3648',
      'code': '140481',
      'p_code': '140400',
      'name': '潞城市'
    },
    {
      'area_id': '3658',
      'code': '140482',
      'p_code': '140400',
      'name': '城区'
    },
    {
      'area_id': '3670',
      'code': '140483',
      'p_code': '140400',
      'name': '郊区'
    }
    ]
  },
  {
    'area_id': '3679',
    'code': '140500',
    'p_code': '140000',
    'name': '晋城市',
    'children': [{
      'area_id': '3680',
      'code': '140502',
      'p_code': '140500',
      'name': '城区'
    },
    {
      'area_id': '3690',
      'code': '140521',
      'p_code': '140500',
      'name': '沁水县'
    },
    {
      'area_id': '3705',
      'code': '140522',
      'p_code': '140500',
      'name': '阳城县'
    },
    {
      'area_id': '3725',
      'code': '140524',
      'p_code': '140500',
      'name': '陵川县'
    },
    {
      'area_id': '3738',
      'code': '140525',
      'p_code': '140500',
      'name': '泽州县'
    },
    {
      'area_id': '3756',
      'code': '140581',
      'p_code': '140500',
      'name': '高平市'
    }
    ]
  },
  {
    'area_id': '3773',
    'code': '140600',
    'p_code': '140000',
    'name': '朔州市',
    'children': [{
      'area_id': '3774',
      'code': '140602',
      'p_code': '140600',
      'name': '朔城区'
    },
    {
      'area_id': '3791',
      'code': '140603',
      'p_code': '140600',
      'name': '平鲁区'
    },
    {
      'area_id': '3805',
      'code': '140621',
      'p_code': '140600',
      'name': '山阴县'
    },
    {
      'area_id': '3822',
      'code': '140622',
      'p_code': '140600',
      'name': '应县'
    },
    {
      'area_id': '3835',
      'code': '140623',
      'p_code': '140600',
      'name': '右玉县'
    },
    {
      'area_id': '3846',
      'code': '140624',
      'p_code': '140600',
      'name': '怀仁县'
    }
    ]
  },
  {
    'area_id': '3859',
    'code': '140700',
    'p_code': '140000',
    'name': '晋中市',
    'children': [{
      'area_id': '3860',
      'code': '140702',
      'p_code': '140700',
      'name': '榆次区'
    },
    {
      'area_id': '3881',
      'code': '140721',
      'p_code': '140700',
      'name': '榆社县'
    },
    {
      'area_id': '3892',
      'code': '140722',
      'p_code': '140700',
      'name': '左权县'
    },
    {
      'area_id': '3904',
      'code': '140723',
      'p_code': '140700',
      'name': '和顺县'
    },
    {
      'area_id': '3915',
      'code': '140724',
      'p_code': '140700',
      'name': '昔阳县'
    },
    {
      'area_id': '3928',
      'code': '140725',
      'p_code': '140700',
      'name': '寿阳县'
    },
    {
      'area_id': '3943',
      'code': '140726',
      'p_code': '140700',
      'name': '太谷县'
    },
    {
      'area_id': '3956',
      'code': '140727',
      'p_code': '140700',
      'name': '祁县'
    },
    {
      'area_id': '3969',
      'code': '140728',
      'p_code': '140700',
      'name': '平遥县'
    },
    {
      'area_id': '3987',
      'code': '140729',
      'p_code': '140700',
      'name': '灵石县'
    },
    {
      'area_id': '4003',
      'code': '140781',
      'p_code': '140700',
      'name': '介休市'
    }
    ]
  },
  {
    'area_id': '4019',
    'code': '140800',
    'p_code': '140000',
    'name': '运城市',
    'children': [{
      'area_id': '4020',
      'code': '140802',
      'p_code': '140800',
      'name': '盐湖区'
    },
    {
      'area_id': '4044',
      'code': '140821',
      'p_code': '140800',
      'name': '临猗县'
    },
    {
      'area_id': '4061',
      'code': '140822',
      'p_code': '140800',
      'name': '万荣县'
    },
    {
      'area_id': '4076',
      'code': '140823',
      'p_code': '140800',
      'name': '闻喜县'
    },
    {
      'area_id': '4090',
      'code': '140824',
      'p_code': '140800',
      'name': '稷山县'
    },
    {
      'area_id': '4098',
      'code': '140825',
      'p_code': '140800',
      'name': '新绛县'
    },
    {
      'area_id': '4110',
      'code': '140826',
      'p_code': '140800',
      'name': '绛县'
    },
    {
      'area_id': '4122',
      'code': '140827',
      'p_code': '140800',
      'name': '垣曲县'
    },
    {
      'area_id': '4134',
      'code': '140828',
      'p_code': '140800',
      'name': '夏县'
    },
    {
      'area_id': '4146',
      'code': '140829',
      'p_code': '140800',
      'name': '平陆县'
    },
    {
      'area_id': '4157',
      'code': '140830',
      'p_code': '140800',
      'name': '芮城县'
    },
    {
      'area_id': '4169',
      'code': '140881',
      'p_code': '140800',
      'name': '永济市'
    },
    {
      'area_id': '4183',
      'code': '140882',
      'p_code': '140800',
      'name': '河津市'
    }
    ]
  },
  {
    'area_id': '4194',
    'code': '140900',
    'p_code': '140000',
    'name': '忻州市',
    'children': [{
      'area_id': '4195',
      'code': '140902',
      'p_code': '140900',
      'name': '忻府区'
    },
    {
      'area_id': '4216',
      'code': '140921',
      'p_code': '140900',
      'name': '定襄县'
    },
    {
      'area_id': '4226',
      'code': '140922',
      'p_code': '140900',
      'name': '五台县'
    },
    {
      'area_id': '4246',
      'code': '140923',
      'p_code': '140900',
      'name': '代县'
    },
    {
      'area_id': '4258',
      'code': '140924',
      'p_code': '140900',
      'name': '繁峙县'
    },
    {
      'area_id': '4273',
      'code': '140925',
      'p_code': '140900',
      'name': '宁武县'
    },
    {
      'area_id': '4290',
      'code': '140926',
      'p_code': '140900',
      'name': '静乐县'
    },
    {
      'area_id': '4305',
      'code': '140927',
      'p_code': '140900',
      'name': '神池县'
    },
    {
      'area_id': '4316',
      'code': '140928',
      'p_code': '140900',
      'name': '五寨县'
    },
    {
      'area_id': '4329',
      'code': '140929',
      'p_code': '140900',
      'name': '岢岚县'
    },
    {
      'area_id': '4342',
      'code': '140930',
      'p_code': '140900',
      'name': '河曲县'
    },
    {
      'area_id': '4356',
      'code': '140931',
      'p_code': '140900',
      'name': '保德县'
    },
    {
      'area_id': '4370',
      'code': '140932',
      'p_code': '140900',
      'name': '偏关县'
    },
    {
      'area_id': '4381',
      'code': '140981',
      'p_code': '140900',
      'name': '原平市'
    }
    ]
  },
  {
    'area_id': '4406',
    'code': '141000',
    'p_code': '140000',
    'name': '临汾市',
    'children': [{
      'area_id': '4407',
      'code': '141002',
      'p_code': '141000',
      'name': '尧都区'
    },
    {
      'area_id': '4434',
      'code': '141021',
      'p_code': '141000',
      'name': '曲沃县'
    },
    {
      'area_id': '4442',
      'code': '141022',
      'p_code': '141000',
      'name': '翼城县'
    },
    {
      'area_id': '4453',
      'code': '141023',
      'p_code': '141000',
      'name': '襄汾县'
    },
    {
      'area_id': '4467',
      'code': '141024',
      'p_code': '141000',
      'name': '洪洞县'
    },
    {
      'area_id': '4484',
      'code': '141025',
      'p_code': '141000',
      'name': '古县'
    },
    {
      'area_id': '4492',
      'code': '141026',
      'p_code': '141000',
      'name': '安泽县'
    },
    {
      'area_id': '4500',
      'code': '141027',
      'p_code': '141000',
      'name': '浮山县'
    },
    {
      'area_id': '4510',
      'code': '141028',
      'p_code': '141000',
      'name': '吉县'
    },
    {
      'area_id': '4519',
      'code': '141029',
      'p_code': '141000',
      'name': '乡宁县'
    },
    {
      'area_id': '4530',
      'code': '141030',
      'p_code': '141000',
      'name': '大宁县'
    },
    {
      'area_id': '4537',
      'code': '141031',
      'p_code': '141000',
      'name': '隰县'
    },
    {
      'area_id': '4546',
      'code': '141032',
      'p_code': '141000',
      'name': '永和县'
    },
    {
      'area_id': '4554',
      'code': '141033',
      'p_code': '141000',
      'name': '蒲县'
    },
    {
      'area_id': '4564',
      'code': '141034',
      'p_code': '141000',
      'name': '汾西县'
    },
    {
      'area_id': '4574',
      'code': '141081',
      'p_code': '141000',
      'name': '侯马市'
    },
    {
      'area_id': '4583',
      'code': '141082',
      'p_code': '141000',
      'name': '霍州市'
    }
    ]
  },
  {
    'area_id': '4596',
    'code': '141100',
    'p_code': '140000',
    'name': '吕梁市',
    'children': [{
      'area_id': '4597',
      'code': '141102',
      'p_code': '141100',
      'name': '离石区'
    },
    {
      'area_id': '4610',
      'code': '141121',
      'p_code': '141100',
      'name': '文水县'
    },
    {
      'area_id': '4623',
      'code': '141122',
      'p_code': '141100',
      'name': '交城县'
    },
    {
      'area_id': '4635',
      'code': '141123',
      'p_code': '141100',
      'name': '兴县'
    },
    {
      'area_id': '4654',
      'code': '141124',
      'p_code': '141100',
      'name': '临县'
    },
    {
      'area_id': '4678',
      'code': '141125',
      'p_code': '141100',
      'name': '柳林县'
    },
    {
      'area_id': '4694',
      'code': '141126',
      'p_code': '141100',
      'name': '石楼县'
    },
    {
      'area_id': '4704',
      'code': '141127',
      'p_code': '141100',
      'name': '岚县'
    },
    {
      'area_id': '4718',
      'code': '141128',
      'p_code': '141100',
      'name': '方山县'
    },
    {
      'area_id': '4726',
      'code': '141129',
      'p_code': '141100',
      'name': '中阳县'
    },
    {
      'area_id': '4734',
      'code': '141130',
      'p_code': '141100',
      'name': '交口县'
    },
    {
      'area_id': '4742',
      'code': '141181',
      'p_code': '141100',
      'name': '孝义市'
    },
    {
      'area_id': '4760',
      'code': '141182',
      'p_code': '141100',
      'name': '汾阳市'
    }
    ]
  }
  ]
},
{
  'area_id': '4777',
  'code': '150000',
  'p_code': '0',
  'name': '内蒙古自治区',
  'children': [{
    'area_id': '4778',
    'code': '150100',
    'p_code': '150000',
    'name': '呼和浩特市',
    'children': [{
      'area_id': '4779',
      'code': '150102',
      'p_code': '150100',
      'name': '新城区'
    },
    {
      'area_id': '4790',
      'code': '150103',
      'p_code': '150100',
      'name': '回民区'
    },
    {
      'area_id': '4799',
      'code': '150104',
      'p_code': '150100',
      'name': '玉泉区'
    },
    {
      'area_id': '4810',
      'code': '150105',
      'p_code': '150100',
      'name': '赛罕区'
    },
    {
      'area_id': '4825',
      'code': '150121',
      'p_code': '150100',
      'name': '土默特左旗'
    },
    {
      'area_id': '4839',
      'code': '150122',
      'p_code': '150100',
      'name': '托克托县'
    },
    {
      'area_id': '4846',
      'code': '150123',
      'p_code': '150100',
      'name': '和林格尔县'
    },
    {
      'area_id': '4856',
      'code': '150124',
      'p_code': '150100',
      'name': '清水河县'
    },
    {
      'area_id': '4865',
      'code': '150125',
      'p_code': '150100',
      'name': '武川县'
    }
    ]
  },
  {
    'area_id': '4877',
    'code': '150200',
    'p_code': '150000',
    'name': '包头市',
    'children': [{
      'area_id': '4878',
      'code': '150202',
      'p_code': '150200',
      'name': '东河区'
    },
    {
      'area_id': '4894',
      'code': '150203',
      'p_code': '150200',
      'name': '昆都仑区'
    },
    {
      'area_id': '4911',
      'code': '150204',
      'p_code': '150200',
      'name': '青山区'
    },
    {
      'area_id': '4926',
      'code': '150205',
      'p_code': '150200',
      'name': '石拐区'
    },
    {
      'area_id': '4936',
      'code': '150206',
      'p_code': '150200',
      'name': '白云鄂博矿区'
    },
    {
      'area_id': '4939',
      'code': '150207',
      'p_code': '150200',
      'name': '九原区'
    },
    {
      'area_id': '4948',
      'code': '150221',
      'p_code': '150200',
      'name': '土默特右旗'
    },
    {
      'area_id': '4958',
      'code': '150222',
      'p_code': '150200',
      'name': '固阳县'
    },
    {
      'area_id': '4965',
      'code': '150223',
      'p_code': '150200',
      'name': '达尔罕茂明安联合旗'
    }
    ]
  },
  {
    'area_id': '4978',
    'code': '150300',
    'p_code': '150000',
    'name': '乌海市',
    'children': [{
      'area_id': '4979',
      'code': '150302',
      'p_code': '150300',
      'name': '海勃湾区'
    },
    {
      'area_id': '4988',
      'code': '150303',
      'p_code': '150300',
      'name': '海南区'
    },
    {
      'area_id': '4994',
      'code': '150304',
      'p_code': '150300',
      'name': '乌达区'
    }
    ]
  },
  {
    'area_id': '5004',
    'code': '150400',
    'p_code': '150000',
    'name': '赤峰市',
    'children': [{
      'area_id': '5005',
      'code': '150402',
      'p_code': '150400',
      'name': '红山区'
    },
    {
      'area_id': '5022',
      'code': '150403',
      'p_code': '150400',
      'name': '元宝山区'
    },
    {
      'area_id': '5036',
      'code': '150404',
      'p_code': '150400',
      'name': '松山区'
    },
    {
      'area_id': '5058',
      'code': '150421',
      'p_code': '150400',
      'name': '阿鲁科尔沁旗'
    },
    {
      'area_id': '5077',
      'code': '150422',
      'p_code': '150400',
      'name': '巴林左旗'
    },
    {
      'area_id': '5094',
      'code': '150423',
      'p_code': '150400',
      'name': '巴林右旗'
    },
    {
      'area_id': '5105',
      'code': '150424',
      'p_code': '150400',
      'name': '林西县'
    },
    {
      'area_id': '5118',
      'code': '150425',
      'p_code': '150400',
      'name': '克什克腾旗'
    },
    {
      'area_id': '5136',
      'code': '150426',
      'p_code': '150400',
      'name': '翁牛特旗'
    },
    {
      'area_id': '5154',
      'code': '150428',
      'p_code': '150400',
      'name': '喀喇沁旗'
    },
    {
      'area_id': '5168',
      'code': '150429',
      'p_code': '150400',
      'name': '宁城县'
    },
    {
      'area_id': '5191',
      'code': '150430',
      'p_code': '150400',
      'name': '敖汉旗'
    }
    ]
  },
  {
    'area_id': '5212',
    'code': '150500',
    'p_code': '150000',
    'name': '通辽市',
    'children': [{
      'area_id': '5213',
      'code': '150502',
      'p_code': '150500',
      'name': '科尔沁区'
    },
    {
      'area_id': '5246',
      'code': '150521',
      'p_code': '150500',
      'name': '科尔沁左翼中旗'
    },
    {
      'area_id': '5268',
      'code': '150522',
      'p_code': '150500',
      'name': '科尔沁左翼后旗'
    },
    {
      'area_id': '5296',
      'code': '150523',
      'p_code': '150500',
      'name': '开鲁县'
    },
    {
      'area_id': '5310',
      'code': '150524',
      'p_code': '150500',
      'name': '库伦旗'
    },
    {
      'area_id': '5320',
      'code': '150525',
      'p_code': '150500',
      'name': '奈曼旗'
    },
    {
      'area_id': '5336',
      'code': '150526',
      'p_code': '150500',
      'name': '扎鲁特旗'
    },
    {
      'area_id': '5356',
      'code': '150581',
      'p_code': '150500',
      'name': '霍林郭勒市'
    }
    ]
  },
  {
    'area_id': '5363',
    'code': '150600',
    'p_code': '150000',
    'name': '鄂尔多斯市',
    'children': [{
      'area_id': '5364',
      'code': '150602',
      'p_code': '150600',
      'name': '东胜区'
    },
    {
      'area_id': '5384',
      'code': '150603',
      'p_code': '150600',
      'name': '康巴什区'
    },
    {
      'area_id': '5389',
      'code': '150621',
      'p_code': '150600',
      'name': '达拉特旗'
    },
    {
      'area_id': '5406',
      'code': '150622',
      'p_code': '150600',
      'name': '准格尔旗'
    },
    {
      'area_id': '5422',
      'code': '150623',
      'p_code': '150600',
      'name': '鄂托克前旗'
    },
    {
      'area_id': '5428',
      'code': '150624',
      'p_code': '150600',
      'name': '鄂托克旗'
    },
    {
      'area_id': '5437',
      'code': '150625',
      'p_code': '150600',
      'name': '杭锦旗'
    },
    {
      'area_id': '5446',
      'code': '150626',
      'p_code': '150600',
      'name': '乌审旗'
    },
    {
      'area_id': '5457',
      'code': '150627',
      'p_code': '150600',
      'name': '伊金霍洛旗'
    }
    ]
  },
  {
    'area_id': '5472',
    'code': '150700',
    'p_code': '150000',
    'name': '呼伦贝尔市',
    'children': [{
      'area_id': '5473',
      'code': '150702',
      'p_code': '150700',
      'name': '海拉尔区'
    },
    {
      'area_id': '5482',
      'code': '150703',
      'p_code': '150700',
      'name': '扎赉诺尔区'
    },
    {
      'area_id': '5489',
      'code': '150721',
      'p_code': '150700',
      'name': '阿荣旗'
    },
    {
      'area_id': '5504',
      'code': '150722',
      'p_code': '150700',
      'name': '莫力达瓦达斡尔族自治旗'
    },
    {
      'area_id': '5522',
      'code': '150723',
      'p_code': '150700',
      'name': '鄂伦春自治旗'
    },
    {
      'area_id': '5554',
      'code': '150724',
      'p_code': '150700',
      'name': '鄂温克族自治旗'
    },
    {
      'area_id': '5569',
      'code': '150725',
      'p_code': '150700',
      'name': '陈巴尔虎旗'
    },
    {
      'area_id': '5580',
      'code': '150726',
      'p_code': '150700',
      'name': '新巴尔虎左旗'
    },
    {
      'area_id': '5589',
      'code': '150727',
      'p_code': '150700',
      'name': '新巴尔虎右旗'
    },
    {
      'area_id': '5598',
      'code': '150781',
      'p_code': '150700',
      'name': '满洲里市'
    },
    {
      'area_id': '5610',
      'code': '150782',
      'p_code': '150700',
      'name': '牙克石市'
    },
    {
      'area_id': '5630',
      'code': '150783',
      'p_code': '150700',
      'name': '扎兰屯市'
    },
    {
      'area_id': '5659',
      'code': '150784',
      'p_code': '150700',
      'name': '额尔古纳市'
    },
    {
      'area_id': '5673',
      'code': '150785',
      'p_code': '150700',
      'name': '根河市'
    }
    ]
  },
  {
    'area_id': '5682',
    'code': '150800',
    'p_code': '150000',
    'name': '巴彦淖尔市',
    'children': [{
      'area_id': '5683',
      'code': '150802',
      'p_code': '150800',
      'name': '临河区'
    },
    {
      'area_id': '5706',
      'code': '150821',
      'p_code': '150800',
      'name': '五原县'
    },
    {
      'area_id': '5718',
      'code': '150822',
      'p_code': '150800',
      'name': '磴口县'
    },
    {
      'area_id': '5730',
      'code': '150823',
      'p_code': '150800',
      'name': '乌拉特前旗'
    },
    {
      'area_id': '5748',
      'code': '150824',
      'p_code': '150800',
      'name': '乌拉特中旗'
    },
    {
      'area_id': '5761',
      'code': '150825',
      'p_code': '150800',
      'name': '乌拉特后旗'
    },
    {
      'area_id': '5768',
      'code': '150826',
      'p_code': '150800',
      'name': '杭锦后旗'
    }
    ]
  },
  {
    'area_id': '5779',
    'code': '150900',
    'p_code': '150000',
    'name': '乌兰察布市',
    'children': [{
      'area_id': '5780',
      'code': '150902',
      'p_code': '150900',
      'name': '集宁区'
    },
    {
      'area_id': '5791',
      'code': '150921',
      'p_code': '150900',
      'name': '卓资县'
    },
    {
      'area_id': '5800',
      'code': '150922',
      'p_code': '150900',
      'name': '化德县'
    },
    {
      'area_id': '5807',
      'code': '150923',
      'p_code': '150900',
      'name': '商都县'
    },
    {
      'area_id': '5818',
      'code': '150924',
      'p_code': '150900',
      'name': '兴和县'
    },
    {
      'area_id': '5829',
      'code': '150925',
      'p_code': '150900',
      'name': '凉城县'
    },
    {
      'area_id': '5842',
      'code': '150926',
      'p_code': '150900',
      'name': '察哈尔右翼前旗'
    },
    {
      'area_id': '5854',
      'code': '150927',
      'p_code': '150900',
      'name': '察哈尔右翼中旗'
    },
    {
      'area_id': '5867',
      'code': '150928',
      'p_code': '150900',
      'name': '察哈尔右翼后旗'
    },
    {
      'area_id': '5876',
      'code': '150929',
      'p_code': '150900',
      'name': '四子王旗'
    },
    {
      'area_id': '5891',
      'code': '150981',
      'p_code': '150900',
      'name': '丰镇市'
    }
    ]
  },
  {
    'area_id': '5905',
    'code': '152200',
    'p_code': '150000',
    'name': '兴安盟',
    'children': [{
      'area_id': '5906',
      'code': '152201',
      'p_code': '152200',
      'name': '乌兰浩特市'
    },
    {
      'area_id': '5923',
      'code': '152202',
      'p_code': '152200',
      'name': '阿尔山市'
    },
    {
      'area_id': '5932',
      'code': '152221',
      'p_code': '152200',
      'name': '科尔沁右翼前旗'
    },
    {
      'area_id': '5953',
      'code': '152222',
      'p_code': '152200',
      'name': '科尔沁右翼中旗'
    },
    {
      'area_id': '5970',
      'code': '152223',
      'p_code': '152200',
      'name': '扎赉特旗'
    },
    {
      'area_id': '5991',
      'code': '152224',
      'p_code': '152200',
      'name': '突泉县'
    }
    ]
  },
  {
    'area_id': '6002',
    'code': '152500',
    'p_code': '150000',
    'name': '锡林郭勒盟',
    'children': [{
      'area_id': '6003',
      'code': '152501',
      'p_code': '152500',
      'name': '二连浩特市'
    },
    {
      'area_id': '6007',
      'code': '152502',
      'p_code': '152500',
      'name': '锡林浩特市'
    },
    {
      'area_id': '6024',
      'code': '152522',
      'p_code': '152500',
      'name': '阿巴嘎旗'
    },
    {
      'area_id': '6034',
      'code': '152523',
      'p_code': '152500',
      'name': '苏尼特左旗'
    },
    {
      'area_id': '6044',
      'code': '152524',
      'p_code': '152500',
      'name': '苏尼特右旗'
    },
    {
      'area_id': '6053',
      'code': '152525',
      'p_code': '152500',
      'name': '东乌珠穆沁旗'
    },
    {
      'area_id': '6069',
      'code': '152526',
      'p_code': '152500',
      'name': '西乌珠穆沁旗'
    },
    {
      'area_id': '6079',
      'code': '152527',
      'p_code': '152500',
      'name': '太仆寺旗'
    },
    {
      'area_id': '6088',
      'code': '152528',
      'p_code': '152500',
      'name': '镶黄旗'
    },
    {
      'area_id': '6093',
      'code': '152529',
      'p_code': '152500',
      'name': '正镶白旗'
    },
    {
      'area_id': '6101',
      'code': '152530',
      'p_code': '152500',
      'name': '正蓝旗'
    },
    {
      'area_id': '6111',
      'code': '152531',
      'p_code': '152500',
      'name': '多伦县'
    }
    ]
  },
  {
    'area_id': '6118',
    'code': '152900',
    'p_code': '150000',
    'name': '阿拉善盟',
    'children': [{
      'area_id': '6119',
      'code': '152921',
      'p_code': '152900',
      'name': '阿拉善左旗'
    },
    {
      'area_id': '6141',
      'code': '152922',
      'p_code': '152900',
      'name': '阿拉善右旗'
    },
    {
      'area_id': '6149',
      'code': '152923',
      'p_code': '152900',
      'name': '额济纳旗'
    }
    ]
  }
  ]
},
{
  'area_id': '6158',
  'code': '210000',
  'p_code': '0',
  'name': '辽宁省',
  'children': [{
    'area_id': '6159',
    'code': '210100',
    'p_code': '210000',
    'name': '沈阳市',
    'children': [{
      'area_id': '6160',
      'code': '210102',
      'p_code': '210100',
      'name': '和平区'
    },
    {
      'area_id': '6174',
      'code': '210103',
      'p_code': '210100',
      'name': '沈河区'
    },
    {
      'area_id': '6190',
      'code': '210104',
      'p_code': '210100',
      'name': '大东区'
    },
    {
      'area_id': '6205',
      'code': '210105',
      'p_code': '210100',
      'name': '皇姑区'
    },
    {
      'area_id': '6218',
      'code': '210106',
      'p_code': '210100',
      'name': '铁西区'
    },
    {
      'area_id': '6240',
      'code': '210111',
      'p_code': '210100',
      'name': '苏家屯区'
    },
    {
      'area_id': '6258',
      'code': '210112',
      'p_code': '210100',
      'name': '浑南区'
    },
    {
      'area_id': '6281',
      'code': '210114',
      'p_code': '210100',
      'name': '于洪区'
    },
    {
      'area_id': '6297',
      'code': '210122',
      'p_code': '210100',
      'name': '辽中区'
    },
    {
      'area_id': '6319',
      'code': '210123',
      'p_code': '210100',
      'name': '康平县'
    },
    {
      'area_id': '6336',
      'code': '210124',
      'p_code': '210100',
      'name': '法库县'
    },
    {
      'area_id': '6356',
      'code': '210181',
      'p_code': '210100',
      'name': '新民市'
    },
    {
      'area_id': '6386',
      'code': '210184',
      'p_code': '210100',
      'name': '沈北新区'
    }
    ]
  },
  {
    'area_id': '6400',
    'code': '210200',
    'p_code': '210000',
    'name': '大连市',
    'children': [{
      'area_id': '6401',
      'code': '210202',
      'p_code': '210200',
      'name': '中山区'
    },
    {
      'area_id': '6410',
      'code': '210203',
      'p_code': '210200',
      'name': '西岗区'
    },
    {
      'area_id': '6418',
      'code': '210204',
      'p_code': '210200',
      'name': '沙河口区'
    },
    {
      'area_id': '6428',
      'code': '210211',
      'p_code': '210200',
      'name': '甘井子区'
    },
    {
      'area_id': '6445',
      'code': '210212',
      'p_code': '210200',
      'name': '旅顺口区'
    },
    {
      'area_id': '6461',
      'code': '210213',
      'p_code': '210200',
      'name': '金州区'
    },
    {
      'area_id': '6489',
      'code': '210224',
      'p_code': '210200',
      'name': '长海县'
    },
    {
      'area_id': '6495',
      'code': '210281',
      'p_code': '210200',
      'name': '瓦房店市'
    },
    {
      'area_id': '6528',
      'code': '210282',
      'p_code': '210200',
      'name': '普兰店区'
    },
    {
      'area_id': '6548',
      'code': '210283',
      'p_code': '210200',
      'name': '庄河市'
    }
    ]
  },
  {
    'area_id': '6575',
    'code': '210300',
    'p_code': '210000',
    'name': '鞍山市',
    'children': [{
      'area_id': '6576',
      'code': '210302',
      'p_code': '210300',
      'name': '铁东区'
    },
    {
      'area_id': '6594',
      'code': '210303',
      'p_code': '210300',
      'name': '铁西区'
    },
    {
      'area_id': '6609',
      'code': '210304',
      'p_code': '210300',
      'name': '立山区'
    },
    {
      'area_id': '6623',
      'code': '210311',
      'p_code': '210300',
      'name': '千山区'
    },
    {
      'area_id': '6631',
      'code': '210321',
      'p_code': '210300',
      'name': '台安县'
    },
    {
      'area_id': '6649',
      'code': '210323',
      'p_code': '210300',
      'name': '岫岩满族自治县'
    },
    {
      'area_id': '6676',
      'code': '210381',
      'p_code': '210300',
      'name': '海城市'
    }
    ]
  },
  {
    'area_id': '6704',
    'code': '210400',
    'p_code': '210000',
    'name': '抚顺市',
    'children': [{
      'area_id': '6705',
      'code': '210402',
      'p_code': '210400',
      'name': '新抚区'
    },
    {
      'area_id': '6717',
      'code': '210403',
      'p_code': '210400',
      'name': '东洲区'
    },
    {
      'area_id': '6732',
      'code': '210404',
      'p_code': '210400',
      'name': '望花区'
    },
    {
      'area_id': '6746',
      'code': '210411',
      'p_code': '210400',
      'name': '顺城区'
    },
    {
      'area_id': '6756',
      'code': '210421',
      'p_code': '210400',
      'name': '抚顺县'
    },
    {
      'area_id': '6765',
      'code': '210422',
      'p_code': '210400',
      'name': '新宾满族自治县'
    },
    {
      'area_id': '6781',
      'code': '210423',
      'p_code': '210400',
      'name': '清原满族自治县'
    }
    ]
  },
  {
    'area_id': '6796',
    'code': '210500',
    'p_code': '210000',
    'name': '本溪市',
    'children': [{
      'area_id': '6797',
      'code': '210502',
      'p_code': '210500',
      'name': '平山区'
    },
    {
      'area_id': '6807',
      'code': '210503',
      'p_code': '210500',
      'name': '溪湖区'
    },
    {
      'area_id': '6818',
      'code': '210504',
      'p_code': '210500',
      'name': '明山区'
    },
    {
      'area_id': '6828',
      'code': '210505',
      'p_code': '210500',
      'name': '南芬区'
    },
    {
      'area_id': '6834',
      'code': '210521',
      'p_code': '210500',
      'name': '本溪满族自治县'
    },
    {
      'area_id': '6847',
      'code': '210522',
      'p_code': '210500',
      'name': '桓仁满族自治县'
    }
    ]
  },
  {
    'area_id': '6861',
    'code': '210600',
    'p_code': '210000',
    'name': '丹东市',
    'children': [{
      'area_id': '6862',
      'code': '210602',
      'p_code': '210600',
      'name': '元宝区'
    },
    {
      'area_id': '6870',
      'code': '210603',
      'p_code': '210600',
      'name': '振兴区'
    },
    {
      'area_id': '6884',
      'code': '210604',
      'p_code': '210600',
      'name': '振安区'
    },
    {
      'area_id': '6894',
      'code': '210624',
      'p_code': '210600',
      'name': '宽甸满族自治县'
    },
    {
      'area_id': '6917',
      'code': '210681',
      'p_code': '210600',
      'name': '东港市'
    },
    {
      'area_id': '6941',
      'code': '210682',
      'p_code': '210600',
      'name': '凤城市'
    }
    ]
  },
  {
    'area_id': '6963',
    'code': '210700',
    'p_code': '210000',
    'name': '锦州市',
    'children': [{
      'area_id': '6964',
      'code': '210702',
      'p_code': '210700',
      'name': '古塔区'
    },
    {
      'area_id': '6975',
      'code': '210703',
      'p_code': '210700',
      'name': '凌河区'
    },
    {
      'area_id': '6988',
      'code': '210711',
      'p_code': '210700',
      'name': '太和区'
    },
    {
      'area_id': '7004',
      'code': '210726',
      'p_code': '210700',
      'name': '黑山县'
    },
    {
      'area_id': '7027',
      'code': '210727',
      'p_code': '210700',
      'name': '义县'
    },
    {
      'area_id': '7046',
      'code': '210781',
      'p_code': '210700',
      'name': '凌海市'
    },
    {
      'area_id': '7069',
      'code': '210782',
      'p_code': '210700',
      'name': '北镇市'
    }
    ]
  },
  {
    'area_id': '7091',
    'code': '210800',
    'p_code': '210000',
    'name': '营口市',
    'children': [{
      'area_id': '7092',
      'code': '210802',
      'p_code': '210800',
      'name': '站前区'
    },
    {
      'area_id': '7101',
      'code': '210803',
      'p_code': '210800',
      'name': '西市区'
    },
    {
      'area_id': '7112',
      'code': '210804',
      'p_code': '210800',
      'name': '鲅鱼圈区'
    },
    {
      'area_id': '7120',
      'code': '210811',
      'p_code': '210800',
      'name': '老边区'
    },
    {
      'area_id': '7127',
      'code': '210881',
      'p_code': '210800',
      'name': '盖州市'
    },
    {
      'area_id': '7155',
      'code': '210882',
      'p_code': '210800',
      'name': '大石桥市'
    }
    ]
  },
  {
    'area_id': '7174',
    'code': '210900',
    'p_code': '210000',
    'name': '阜新市',
    'children': [{
      'area_id': '7175',
      'code': '210902',
      'p_code': '210900',
      'name': '海州区'
    },
    {
      'area_id': '7187',
      'code': '210903',
      'p_code': '210900',
      'name': '新邱区'
    },
    {
      'area_id': '7193',
      'code': '210904',
      'p_code': '210900',
      'name': '太平区'
    },
    {
      'area_id': '7200',
      'code': '210905',
      'p_code': '210900',
      'name': '清河门区'
    },
    {
      'area_id': '7207',
      'code': '210911',
      'p_code': '210900',
      'name': '细河区'
    },
    {
      'area_id': '7216',
      'code': '210921',
      'p_code': '210900',
      'name': '阜新蒙古族自治县'
    },
    {
      'area_id': '7254',
      'code': '210922',
      'p_code': '210900',
      'name': '彰武县'
    }
    ]
  },
  {
    'area_id': '7279',
    'code': '211000',
    'p_code': '210000',
    'name': '辽阳市',
    'children': [{
      'area_id': '7280',
      'code': '211002',
      'p_code': '211000',
      'name': '白塔区'
    },
    {
      'area_id': '7292',
      'code': '211003',
      'p_code': '211000',
      'name': '文圣区'
    },
    {
      'area_id': '7297',
      'code': '211004',
      'p_code': '211000',
      'name': '宏伟区'
    },
    {
      'area_id': '7304',
      'code': '211005',
      'p_code': '211000',
      'name': '弓长岭区'
    },
    {
      'area_id': '7310',
      'code': '211011',
      'p_code': '211000',
      'name': '太子河区'
    },
    {
      'area_id': '7317',
      'code': '211021',
      'p_code': '211000',
      'name': '辽阳县'
    },
    {
      'area_id': '7333',
      'code': '211081',
      'p_code': '211000',
      'name': '灯塔市'
    }
    ]
  },
  {
    'area_id': '7348',
    'code': '211100',
    'p_code': '210000',
    'name': '盘锦市',
    'children': [{
      'area_id': '7349',
      'code': '211102',
      'p_code': '211100',
      'name': '双台子区'
    },
    {
      'area_id': '7361',
      'code': '211103',
      'p_code': '211100',
      'name': '兴隆台区'
    },
    {
      'area_id': '7380',
      'code': '211121',
      'p_code': '211100',
      'name': '大洼区'
    },
    {
      'area_id': '7398',
      'code': '211122',
      'p_code': '211100',
      'name': '盘山县'
    }
    ]
  },
  {
    'area_id': '7413',
    'code': '211200',
    'p_code': '210000',
    'name': '铁岭市',
    'children': [{
      'area_id': '7414',
      'code': '211202',
      'p_code': '211200',
      'name': '银州区'
    },
    {
      'area_id': '7424',
      'code': '211204',
      'p_code': '211200',
      'name': '清河区'
    },
    {
      'area_id': '7430',
      'code': '211221',
      'p_code': '211200',
      'name': '铁岭县'
    },
    {
      'area_id': '7446',
      'code': '211223',
      'p_code': '211200',
      'name': '西丰县'
    },
    {
      'area_id': '7465',
      'code': '211224',
      'p_code': '211200',
      'name': '昌图县'
    },
    {
      'area_id': '7505',
      'code': '211281',
      'p_code': '211200',
      'name': '调兵山市'
    },
    {
      'area_id': '7511',
      'code': '211282',
      'p_code': '211200',
      'name': '开原市'
    }
    ]
  },
  {
    'area_id': '7533',
    'code': '211300',
    'p_code': '210000',
    'name': '朝阳市',
    'children': [{
      'area_id': '7534',
      'code': '211302',
      'p_code': '211300',
      'name': '双塔区'
    },
    {
      'area_id': '7550',
      'code': '211303',
      'p_code': '211300',
      'name': '龙城区'
    },
    {
      'area_id': '7563',
      'code': '211321',
      'p_code': '211300',
      'name': '朝阳县'
    },
    {
      'area_id': '7592',
      'code': '211322',
      'p_code': '211300',
      'name': '建平县'
    },
    {
      'area_id': '7624',
      'code': '211324',
      'p_code': '211300',
      'name': '喀喇沁左翼蒙古族自治县'
    },
    {
      'area_id': '7648',
      'code': '211381',
      'p_code': '211300',
      'name': '北票市'
    },
    {
      'area_id': '7686',
      'code': '211382',
      'p_code': '211300',
      'name': '凌源市'
    }
    ]
  },
  {
    'area_id': '7717',
    'code': '211400',
    'p_code': '210000',
    'name': '葫芦岛市',
    'children': [{
      'area_id': '7718',
      'code': '211402',
      'p_code': '211400',
      'name': '连山区'
    },
    {
      'area_id': '7738',
      'code': '211403',
      'p_code': '211400',
      'name': '龙港区'
    },
    {
      'area_id': '7752',
      'code': '211404',
      'p_code': '211400',
      'name': '南票区'
    },
    {
      'area_id': '7771',
      'code': '211421',
      'p_code': '211400',
      'name': '绥中县'
    },
    {
      'area_id': '7799',
      'code': '211422',
      'p_code': '211400',
      'name': '建昌县'
    },
    {
      'area_id': '7828',
      'code': '211481',
      'p_code': '211400',
      'name': '兴城市'
    }
    ]
  }
  ]
},
{
  'area_id': '7856',
  'code': '220000',
  'p_code': '0',
  'name': '吉林省',
  'children': [{
    'area_id': '7857',
    'code': '220100',
    'p_code': '220000',
    'name': '长春市',
    'children': [{
      'area_id': '7858',
      'code': '220102',
      'p_code': '220100',
      'name': '南关区'
    },
    {
      'area_id': '7878',
      'code': '220103',
      'p_code': '220100',
      'name': '宽城区'
    },
    {
      'area_id': '7895',
      'code': '220104',
      'p_code': '220100',
      'name': '朝阳区'
    },
    {
      'area_id': '7909',
      'code': '220105',
      'p_code': '220100',
      'name': '二道区'
    },
    {
      'area_id': '7925',
      'code': '220106',
      'p_code': '220100',
      'name': '绿园区'
    },
    {
      'area_id': '7938',
      'code': '220112',
      'p_code': '220100',
      'name': '双阳区'
    },
    {
      'area_id': '7947',
      'code': '220122',
      'p_code': '220100',
      'name': '农安县'
    },
    {
      'area_id': '7970',
      'code': '220181',
      'p_code': '220100',
      'name': '九台区'
    },
    {
      'area_id': '7986',
      'code': '220182',
      'p_code': '220100',
      'name': '榆树市'
    },
    {
      'area_id': '8015',
      'code': '220183',
      'p_code': '220100',
      'name': '德惠市'
    }
    ]
  },
  {
    'area_id': '8034',
    'code': '220200',
    'p_code': '220000',
    'name': '吉林市',
    'children': [{
      'area_id': '8035',
      'code': '220202',
      'p_code': '220200',
      'name': '昌邑区'
    },
    {
      'area_id': '8058',
      'code': '220203',
      'p_code': '220200',
      'name': '龙潭区'
    },
    {
      'area_id': '8079',
      'code': '220204',
      'p_code': '220200',
      'name': '船营区'
    },
    {
      'area_id': '8095',
      'code': '220211',
      'p_code': '220200',
      'name': '丰满区'
    },
    {
      'area_id': '8109',
      'code': '220221',
      'p_code': '220200',
      'name': '永吉县'
    },
    {
      'area_id': '8120',
      'code': '220281',
      'p_code': '220200',
      'name': '蛟河市'
    },
    {
      'area_id': '8138',
      'code': '220282',
      'p_code': '220200',
      'name': '桦甸市'
    },
    {
      'area_id': '8153',
      'code': '220283',
      'p_code': '220200',
      'name': '舒兰市'
    },
    {
      'area_id': '8174',
      'code': '220284',
      'p_code': '220200',
      'name': '磐石市'
    }
    ]
  },
  {
    'area_id': '8193',
    'code': '220300',
    'p_code': '220000',
    'name': '四平市',
    'children': [{
      'area_id': '8194',
      'code': '220302',
      'p_code': '220300',
      'name': '铁西区'
    },
    {
      'area_id': '8202',
      'code': '220303',
      'p_code': '220300',
      'name': '铁东区'
    },
    {
      'area_id': '8216',
      'code': '220322',
      'p_code': '220300',
      'name': '梨树县'
    },
    {
      'area_id': '8240',
      'code': '220323',
      'p_code': '220300',
      'name': '伊通满族自治县'
    },
    {
      'area_id': '8256',
      'code': '220381',
      'p_code': '220300',
      'name': '公主岭市'
    },
    {
      'area_id': '8295',
      'code': '220382',
      'p_code': '220300',
      'name': '双辽市'
    }
    ]
  },
  {
    'area_id': '8317',
    'code': '220400',
    'p_code': '220000',
    'name': '辽源市',
    'children': [{
      'area_id': '8318',
      'code': '220402',
      'p_code': '220400',
      'name': '龙山区'
    },
    {
      'area_id': '8324',
      'code': '220403',
      'p_code': '220400',
      'name': '西安区'
    },
    {
      'area_id': '8327',
      'code': '220421',
      'p_code': '220400',
      'name': '东丰县'
    },
    {
      'area_id': '8342',
      'code': '220422',
      'p_code': '220400',
      'name': '东辽县'
    }
    ]
  },
  {
    'area_id': '8356',
    'code': '220500',
    'p_code': '220000',
    'name': '通化市',
    'children': [{
      'area_id': '8357',
      'code': '220502',
      'p_code': '220500',
      'name': '东昌区'
    },
    {
      'area_id': '8369',
      'code': '220503',
      'p_code': '220500',
      'name': '二道江区'
    },
    {
      'area_id': '8376',
      'code': '220521',
      'p_code': '220500',
      'name': '通化县'
    },
    {
      'area_id': '8394',
      'code': '220523',
      'p_code': '220500',
      'name': '辉南县'
    },
    {
      'area_id': '8407',
      'code': '220524',
      'p_code': '220500',
      'name': '柳河县'
    },
    {
      'area_id': '8423',
      'code': '220581',
      'p_code': '220500',
      'name': '梅河口市'
    },
    {
      'area_id': '8448',
      'code': '220582',
      'p_code': '220500',
      'name': '集安市'
    }
    ]
  },
  {
    'area_id': '8463',
    'code': '220600',
    'p_code': '220000',
    'name': '白山市',
    'children': [{
      'area_id': '8464',
      'code': '220602',
      'p_code': '220600',
      'name': '浑江区'
    },
    {
      'area_id': '8477',
      'code': '220621',
      'p_code': '220600',
      'name': '抚松县'
    },
    {
      'area_id': '8495',
      'code': '220622',
      'p_code': '220600',
      'name': '靖宇县'
    },
    {
      'area_id': '8504',
      'code': '220623',
      'p_code': '220600',
      'name': '长白朝鲜族自治县'
    },
    {
      'area_id': '8513',
      'code': '220625',
      'p_code': '220600',
      'name': '江源区'
    },
    {
      'area_id': '8524',
      'code': '220681',
      'p_code': '220600',
      'name': '临江市'
    }
    ]
  },
  {
    'area_id': '8540',
    'code': '220700',
    'p_code': '220000',
    'name': '松原市',
    'children': [{
      'area_id': '8541',
      'code': '220702',
      'p_code': '220700',
      'name': '宁江区'
    },
    {
      'area_id': '8573',
      'code': '220721',
      'p_code': '220700',
      'name': '前郭尔罗斯蒙古族自治县'
    },
    {
      'area_id': '8611',
      'code': '220722',
      'p_code': '220700',
      'name': '长岭县'
    },
    {
      'area_id': '8644',
      'code': '220723',
      'p_code': '220700',
      'name': '乾安县'
    },
    {
      'area_id': '8661',
      'code': '220724',
      'p_code': '220700',
      'name': '扶余市'
    }
    ]
  },
  {
    'area_id': '8683',
    'code': '220800',
    'p_code': '220000',
    'name': '白城市',
    'children': [{
      'area_id': '8684',
      'code': '220802',
      'p_code': '220800',
      'name': '洮北区'
    },
    {
      'area_id': '8713',
      'code': '220821',
      'p_code': '220800',
      'name': '镇赉县'
    },
    {
      'area_id': '8733',
      'code': '220822',
      'p_code': '220800',
      'name': '通榆县'
    },
    {
      'area_id': '8756',
      'code': '220881',
      'p_code': '220800',
      'name': '洮南市'
    },
    {
      'area_id': '8784',
      'code': '220882',
      'p_code': '220800',
      'name': '大安市'
    }
    ]
  },
  {
    'area_id': '8820',
    'code': '222400',
    'p_code': '220000',
    'name': '延边朝鲜族自治州',
    'children': [{
      'area_id': '8821',
      'code': '222401',
      'p_code': '222400',
      'name': '延吉市'
    },
    {
      'area_id': '8836',
      'code': '222402',
      'p_code': '222400',
      'name': '图们市'
    },
    {
      'area_id': '8844',
      'code': '222403',
      'p_code': '222400',
      'name': '敦化市'
    },
    {
      'area_id': '8871',
      'code': '222404',
      'p_code': '222400',
      'name': '珲春市'
    },
    {
      'area_id': '8887',
      'code': '222405',
      'p_code': '222400',
      'name': '龙井市'
    },
    {
      'area_id': '8899',
      'code': '222406',
      'p_code': '222400',
      'name': '和龙市'
    },
    {
      'area_id': '8914',
      'code': '222424',
      'p_code': '222400',
      'name': '汪清县'
    },
    {
      'area_id': '8938',
      'code': '222426',
      'p_code': '222400',
      'name': '安图县'
    }
    ]
  }
  ]
},
{
  'area_id': '8954',
  'code': '230000',
  'p_code': '0',
  'name': '黑龙江省',
  'children': [{
    'area_id': '8955',
    'code': '230100',
    'p_code': '230000',
    'name': '哈尔滨市',
    'children': [{
      'area_id': '8956',
      'code': '230102',
      'p_code': '230100',
      'name': '道里区'
    },
    {
      'area_id': '8982',
      'code': '230103',
      'p_code': '230100',
      'name': '南岗区'
    },
    {
      'area_id': '9005',
      'code': '230104',
      'p_code': '230100',
      'name': '道外区'
    },
    {
      'area_id': '9035',
      'code': '230106',
      'p_code': '230100',
      'name': '香坊区'
    },
    {
      'area_id': '9062',
      'code': '230108',
      'p_code': '230100',
      'name': '平房区'
    },
    {
      'area_id': '9072',
      'code': '230109',
      'p_code': '230100',
      'name': '松北区'
    },
    {
      'area_id': '9080',
      'code': '230111',
      'p_code': '230100',
      'name': '呼兰区'
    },
    {
      'area_id': '9101',
      'code': '230123',
      'p_code': '230100',
      'name': '依兰县'
    },
    {
      'area_id': '9114',
      'code': '230124',
      'p_code': '230100',
      'name': '方正县'
    },
    {
      'area_id': '9125',
      'code': '230125',
      'p_code': '230100',
      'name': '宾县'
    },
    {
      'area_id': '9145',
      'code': '230126',
      'p_code': '230100',
      'name': '巴彦县'
    },
    {
      'area_id': '9166',
      'code': '230127',
      'p_code': '230100',
      'name': '木兰县'
    },
    {
      'area_id': '9176',
      'code': '230128',
      'p_code': '230100',
      'name': '通河县'
    },
    {
      'area_id': '9188',
      'code': '230129',
      'p_code': '230100',
      'name': '延寿县'
    },
    {
      'area_id': '9200',
      'code': '230181',
      'p_code': '230100',
      'name': '阿城区'
    },
    {
      'area_id': '9221',
      'code': '230182',
      'p_code': '230100',
      'name': '双城区'
    },
    {
      'area_id': '9247',
      'code': '230183',
      'p_code': '230100',
      'name': '尚志市'
    },
    {
      'area_id': '9267',
      'code': '230184',
      'p_code': '230100',
      'name': '五常市'
    }
    ]
  },
  {
    'area_id': '9293',
    'code': '230200',
    'p_code': '230000',
    'name': '齐齐哈尔市',
    'children': [{
      'area_id': '9294',
      'code': '230202',
      'p_code': '230200',
      'name': '龙沙区'
    },
    {
      'area_id': '9303',
      'code': '230203',
      'p_code': '230200',
      'name': '建华区'
    },
    {
      'area_id': '9310',
      'code': '230204',
      'p_code': '230200',
      'name': '铁锋区'
    },
    {
      'area_id': '9320',
      'code': '230205',
      'p_code': '230200',
      'name': '昂昂溪区'
    },
    {
      'area_id': '9327',
      'code': '230206',
      'p_code': '230200',
      'name': '富拉尔基区'
    },
    {
      'area_id': '9338',
      'code': '230207',
      'p_code': '230200',
      'name': '碾子山区'
    },
    {
      'area_id': '9344',
      'code': '230208',
      'p_code': '230200',
      'name': '梅里斯达斡尔族区'
    },
    {
      'area_id': '9353',
      'code': '230221',
      'p_code': '230200',
      'name': '龙江县'
    },
    {
      'area_id': '9368',
      'code': '230223',
      'p_code': '230200',
      'name': '依安县'
    },
    {
      'area_id': '9386',
      'code': '230224',
      'p_code': '230200',
      'name': '泰来县'
    },
    {
      'area_id': '9408',
      'code': '230225',
      'p_code': '230200',
      'name': '甘南县'
    },
    {
      'area_id': '9421',
      'code': '230227',
      'p_code': '230200',
      'name': '富裕县'
    },
    {
      'area_id': '9434',
      'code': '230229',
      'p_code': '230200',
      'name': '克山县'
    },
    {
      'area_id': '9458',
      'code': '230230',
      'p_code': '230200',
      'name': '克东县'
    },
    {
      'area_id': '9477',
      'code': '230231',
      'p_code': '230200',
      'name': '拜泉县'
    },
    {
      'area_id': '9494',
      'code': '230281',
      'p_code': '230200',
      'name': '讷河市'
    }
    ]
  },
  {
    'area_id': '9528',
    'code': '230300',
    'p_code': '230000',
    'name': '鸡西市',
    'children': [{
      'area_id': '9529',
      'code': '230302',
      'p_code': '230300',
      'name': '鸡冠区'
    },
    {
      'area_id': '9539',
      'code': '230303',
      'p_code': '230300',
      'name': '恒山区'
    },
    {
      'area_id': '9549',
      'code': '230304',
      'p_code': '230300',
      'name': '滴道区'
    },
    {
      'area_id': '9556',
      'code': '230305',
      'p_code': '230300',
      'name': '梨树区'
    },
    {
      'area_id': '9563',
      'code': '230306',
      'p_code': '230300',
      'name': '城子河区'
    },
    {
      'area_id': '9571',
      'code': '230307',
      'p_code': '230300',
      'name': '麻山区'
    },
    {
      'area_id': '9574',
      'code': '230321',
      'p_code': '230300',
      'name': '鸡东县'
    },
    {
      'area_id': '9588',
      'code': '230381',
      'p_code': '230300',
      'name': '虎林市'
    },
    {
      'area_id': '9608',
      'code': '230382',
      'p_code': '230300',
      'name': '密山市'
    }
    ]
  },
  {
    'area_id': '9643',
    'code': '230400',
    'p_code': '230000',
    'name': '鹤岗市',
    'children': [{
      'area_id': '9644',
      'code': '230402',
      'p_code': '230400',
      'name': '向阳区'
    },
    {
      'area_id': '9650',
      'code': '230403',
      'p_code': '230400',
      'name': '工农区'
    },
    {
      'area_id': '9657',
      'code': '230404',
      'p_code': '230400',
      'name': '南山区'
    },
    {
      'area_id': '9664',
      'code': '230405',
      'p_code': '230400',
      'name': '兴安区'
    },
    {
      'area_id': '9672',
      'code': '230406',
      'p_code': '230400',
      'name': '东山区'
    },
    {
      'area_id': '9683',
      'code': '230407',
      'p_code': '230400',
      'name': '兴山区'
    },
    {
      'area_id': '9688',
      'code': '230421',
      'p_code': '230400',
      'name': '萝北县'
    },
    {
      'area_id': '9707',
      'code': '230422',
      'p_code': '230400',
      'name': '绥滨县'
    }
    ]
  },
  {
    'area_id': '9724',
    'code': '230500',
    'p_code': '230000',
    'name': '双鸭山市',
    'children': [{
      'area_id': '9725',
      'code': '230502',
      'p_code': '230500',
      'name': '尖山区'
    },
    {
      'area_id': '9734',
      'code': '230503',
      'p_code': '230500',
      'name': '岭东区'
    },
    {
      'area_id': '9744',
      'code': '230505',
      'p_code': '230500',
      'name': '四方台区'
    },
    {
      'area_id': '9750',
      'code': '230506',
      'p_code': '230500',
      'name': '宝山区'
    },
    {
      'area_id': '9762',
      'code': '230521',
      'p_code': '230500',
      'name': '集贤县'
    },
    {
      'area_id': '9783',
      'code': '230522',
      'p_code': '230500',
      'name': '友谊县'
    },
    {
      'area_id': '9797',
      'code': '230523',
      'p_code': '230500',
      'name': '宝清县'
    },
    {
      'area_id': '9821',
      'code': '230524',
      'p_code': '230500',
      'name': '饶河县'
    }
    ]
  },
  {
    'area_id': '9847',
    'code': '230600',
    'p_code': '230000',
    'name': '大庆市',
    'children': [{
      'area_id': '9848',
      'code': '230602',
      'p_code': '230600',
      'name': '萨尔图区'
    },
    {
      'area_id': '9858',
      'code': '230603',
      'p_code': '230600',
      'name': '龙凤区'
    },
    {
      'area_id': '9867',
      'code': '230604',
      'p_code': '230600',
      'name': '让胡路区'
    },
    {
      'area_id': '9878',
      'code': '230605',
      'p_code': '230600',
      'name': '红岗区'
    },
    {
      'area_id': '9886',
      'code': '230606',
      'p_code': '230600',
      'name': '大同区'
    },
    {
      'area_id': '9902',
      'code': '230621',
      'p_code': '230600',
      'name': '肇州县'
    },
    {
      'area_id': '9917',
      'code': '230622',
      'p_code': '230600',
      'name': '肇源县'
    },
    {
      'area_id': '9941',
      'code': '230623',
      'p_code': '230600',
      'name': '林甸县'
    },
    {
      'area_id': '9954',
      'code': '230624',
      'p_code': '230600',
      'name': '杜尔伯特蒙古族自治县'
    }
    ]
  },
  {
    'area_id': '9968',
    'code': '230700',
    'p_code': '230000',
    'name': '伊春市',
    'children': [{
      'area_id': '9969',
      'code': '230702',
      'p_code': '230700',
      'name': '伊春区'
    },
    {
      'area_id': '9975',
      'code': '230703',
      'p_code': '230700',
      'name': '南岔区'
    },
    {
      'area_id': '9996',
      'code': '230704',
      'p_code': '230700',
      'name': '友好区'
    },
    {
      'area_id': '10014',
      'code': '230705',
      'p_code': '230700',
      'name': '西林区'
    },
    {
      'area_id': '10018',
      'code': '230706',
      'p_code': '230700',
      'name': '翠峦区'
    },
    {
      'area_id': '10029',
      'code': '230707',
      'p_code': '230700',
      'name': '新青区'
    },
    {
      'area_id': '10046',
      'code': '230708',
      'p_code': '230700',
      'name': '美溪区'
    },
    {
      'area_id': '10062',
      'code': '230709',
      'p_code': '230700',
      'name': '金山屯区'
    },
    {
      'area_id': '10075',
      'code': '230710',
      'p_code': '230700',
      'name': '五营区'
    },
    {
      'area_id': '10086',
      'code': '230711',
      'p_code': '230700',
      'name': '乌马河区'
    },
    {
      'area_id': '10100',
      'code': '230712',
      'p_code': '230700',
      'name': '汤旺河区'
    },
    {
      'area_id': '10117',
      'code': '230713',
      'p_code': '230700',
      'name': '带岭区'
    },
    {
      'area_id': '10131',
      'code': '230714',
      'p_code': '230700',
      'name': '乌伊岭区'
    },
    {
      'area_id': '10145',
      'code': '230715',
      'p_code': '230700',
      'name': '红星区'
    },
    {
      'area_id': '10158',
      'code': '230716',
      'p_code': '230700',
      'name': '上甘岭区'
    },
    {
      'area_id': '10172',
      'code': '230722',
      'p_code': '230700',
      'name': '嘉荫县'
    },
    {
      'area_id': '10186',
      'code': '230781',
      'p_code': '230700',
      'name': '铁力市'
    }
    ]
  },
  {
    'area_id': '10199',
    'code': '230800',
    'p_code': '230000',
    'name': '佳木斯市',
    'children': [{
      'area_id': '10200',
      'code': '230803',
      'p_code': '230800',
      'name': '向阳区'
    },
    {
      'area_id': '10208',
      'code': '230804',
      'p_code': '230800',
      'name': '前进区'
    },
    {
      'area_id': '10211',
      'code': '230805',
      'p_code': '230800',
      'name': '东风区'
    },
    {
      'area_id': '10220',
      'code': '230811',
      'p_code': '230800',
      'name': '郊区'
    },
    {
      'area_id': '10236',
      'code': '230822',
      'p_code': '230800',
      'name': '桦南县'
    },
    {
      'area_id': '10250',
      'code': '230826',
      'p_code': '230800',
      'name': '桦川县'
    },
    {
      'area_id': '10262',
      'code': '230828',
      'p_code': '230800',
      'name': '汤原县'
    },
    {
      'area_id': '10277',
      'code': '230833',
      'p_code': '230800',
      'name': '抚远市'
    },
    {
      'area_id': '10290',
      'code': '230881',
      'p_code': '230800',
      'name': '同江市'
    },
    {
      'area_id': '10313',
      'code': '230882',
      'p_code': '230800',
      'name': '富锦市'
    }
    ]
  },
  {
    'area_id': '10341',
    'code': '230900',
    'p_code': '230000',
    'name': '七台河市',
    'children': [{
      'area_id': '10342',
      'code': '230902',
      'p_code': '230900',
      'name': '新兴区'
    },
    {
      'area_id': '10365',
      'code': '230903',
      'p_code': '230900',
      'name': '桃山区'
    },
    {
      'area_id': '10377',
      'code': '230904',
      'p_code': '230900',
      'name': '茄子河区'
    },
    {
      'area_id': '10387',
      'code': '230921',
      'p_code': '230900',
      'name': '勃利县'
    }
    ]
  },
  {
    'area_id': '10403',
    'code': '231000',
    'p_code': '230000',
    'name': '牡丹江市',
    'children': [{
      'area_id': '10404',
      'code': '231002',
      'p_code': '231000',
      'name': '东安区'
    },
    {
      'area_id': '10410',
      'code': '231003',
      'p_code': '231000',
      'name': '阳明区'
    },
    {
      'area_id': '10419',
      'code': '231004',
      'p_code': '231000',
      'name': '爱民区'
    },
    {
      'area_id': '10428',
      'code': '231005',
      'p_code': '231000',
      'name': '西安区'
    },
    {
      'area_id': '10437',
      'code': '231024',
      'p_code': '231000',
      'name': '东宁市'
    },
    {
      'area_id': '10445',
      'code': '231025',
      'p_code': '231000',
      'name': '林口县'
    },
    {
      'area_id': '10458',
      'code': '231081',
      'p_code': '231000',
      'name': '绥芬河市'
    },
    {
      'area_id': '10461',
      'code': '231083',
      'p_code': '231000',
      'name': '海林市'
    },
    {
      'area_id': '10477',
      'code': '231084',
      'p_code': '231000',
      'name': '宁安市'
    },
    {
      'area_id': '10493',
      'code': '231085',
      'p_code': '231000',
      'name': '穆棱市'
    }
    ]
  },
  {
    'area_id': '10504',
    'code': '231100',
    'p_code': '230000',
    'name': '黑河市',
    'children': [{
      'area_id': '10505',
      'code': '231102',
      'p_code': '231100',
      'name': '爱辉区'
    },
    {
      'area_id': '10543',
      'code': '231121',
      'p_code': '231100',
      'name': '嫩江县'
    },
    {
      'area_id': '10571',
      'code': '231123',
      'p_code': '231100',
      'name': '逊克县'
    },
    {
      'area_id': '10589',
      'code': '231124',
      'p_code': '231100',
      'name': '孙吴县'
    },
    {
      'area_id': '10613',
      'code': '231181',
      'p_code': '231100',
      'name': '北安市'
    },
    {
      'area_id': '10635',
      'code': '231182',
      'p_code': '231100',
      'name': '五大连池市'
    }
    ]
  },
  {
    'area_id': '10674',
    'code': '231200',
    'p_code': '230000',
    'name': '绥化市',
    'children': [{
      'area_id': '10675',
      'code': '231202',
      'p_code': '231200',
      'name': '北林区'
    },
    {
      'area_id': '10703',
      'code': '231221',
      'p_code': '231200',
      'name': '望奎县'
    },
    {
      'area_id': '10723',
      'code': '231222',
      'p_code': '231200',
      'name': '兰西县'
    },
    {
      'area_id': '10742',
      'code': '231223',
      'p_code': '231200',
      'name': '青冈县'
    },
    {
      'area_id': '10764',
      'code': '231224',
      'p_code': '231200',
      'name': '庆安县'
    },
    {
      'area_id': '10781',
      'code': '231225',
      'p_code': '231200',
      'name': '明水县'
    },
    {
      'area_id': '10801',
      'code': '231226',
      'p_code': '231200',
      'name': '绥棱县'
    },
    {
      'area_id': '10822',
      'code': '231281',
      'p_code': '231200',
      'name': '安达市'
    },
    {
      'area_id': '10844',
      'code': '231282',
      'p_code': '231200',
      'name': '肇东市'
    },
    {
      'area_id': '10872',
      'code': '231283',
      'p_code': '231200',
      'name': '海伦市'
    }
    ]
  },
  {
    'area_id': '10902',
    'code': '232700',
    'p_code': '230000',
    'name': '大兴安岭地区',
    'children': [{
      'area_id': '10903',
      'code': '232721',
      'p_code': '232700',
      'name': '呼玛县'
    },
    {
      'area_id': '10924',
      'code': '232722',
      'p_code': '232700',
      'name': '塔河县'
    },
    {
      'area_id': '10932',
      'code': '232723',
      'p_code': '232700',
      'name': '漠河县'
    },
    {
      'area_id': '10941',
      'code': '232724',
      'p_code': '232700',
      'name': '加格达奇区'
    }
    ]
  }
  ]
},
{
  'area_id': '10951',
  'code': '310000',
  'p_code': '0',
  'name': '上海',
  'children': [{
    'area_id': '10952',
    'code': '310100',
    'p_code': '310000',
    'name': '上海市',
    'children': [{
      'area_id': '10953',
      'code': '310101',
      'p_code': '310100',
      'name': '黄浦区'
    },
    {
      'area_id': '10964',
      'code': '310104',
      'p_code': '310100',
      'name': '徐汇区'
    },
    {
      'area_id': '10979',
      'code': '310105',
      'p_code': '310100',
      'name': '长宁区'
    },
    {
      'area_id': '10990',
      'code': '310106',
      'p_code': '310100',
      'name': '静安区'
    },
    {
      'area_id': '11005',
      'code': '310107',
      'p_code': '310100',
      'name': '普陀区'
    },
    {
      'area_id': '11016',
      'code': '310109',
      'p_code': '310100',
      'name': '虹口区'
    },
    {
      'area_id': '11025',
      'code': '310110',
      'p_code': '310100',
      'name': '杨浦区'
    },
    {
      'area_id': '11038',
      'code': '310112',
      'p_code': '310100',
      'name': '闵行区'
    },
    {
      'area_id': '11053',
      'code': '310113',
      'p_code': '310100',
      'name': '宝山区'
    },
    {
      'area_id': '11067',
      'code': '310114',
      'p_code': '310100',
      'name': '嘉定区'
    },
    {
      'area_id': '11080',
      'code': '310115',
      'p_code': '310100',
      'name': '浦东新区'
    },
    {
      'area_id': '11123',
      'code': '310116',
      'p_code': '310100',
      'name': '金山区'
    },
    {
      'area_id': '11135',
      'code': '310117',
      'p_code': '310100',
      'name': '松江区'
    },
    {
      'area_id': '11156',
      'code': '310118',
      'p_code': '310100',
      'name': '青浦区'
    },
    {
      'area_id': '11168',
      'code': '310120',
      'p_code': '310100',
      'name': '奉贤区'
    },
    {
      'area_id': '11181',
      'code': '310230',
      'p_code': '310100',
      'name': '崇明区'
    }
    ]
  }]
},
{
  'area_id': '11203',
  'code': '320000',
  'p_code': '0',
  'name': '江苏省',
  'children': [{
    'area_id': '11204',
    'code': '320100',
    'p_code': '320000',
    'name': '南京市',
    'children': [{
      'area_id': '11205',
      'code': '320102',
      'p_code': '320100',
      'name': '玄武区'
    },
    {
      'area_id': '11213',
      'code': '320104',
      'p_code': '320100',
      'name': '秦淮区'
    },
    {
      'area_id': '11227',
      'code': '320105',
      'p_code': '320100',
      'name': '建邺区'
    },
    {
      'area_id': '11238',
      'code': '320106',
      'p_code': '320100',
      'name': '鼓楼区'
    },
    {
      'area_id': '11252',
      'code': '320111',
      'p_code': '320100',
      'name': '浦口区'
    },
    {
      'area_id': '11266',
      'code': '320113',
      'p_code': '320100',
      'name': '栖霞区'
    },
    {
      'area_id': '11290',
      'code': '320114',
      'p_code': '320100',
      'name': '雨花台区'
    },
    {
      'area_id': '11300',
      'code': '320115',
      'p_code': '320100',
      'name': '江宁区'
    },
    {
      'area_id': '11315',
      'code': '320116',
      'p_code': '320100',
      'name': '六合区'
    },
    {
      'area_id': '11330',
      'code': '320124',
      'p_code': '320100',
      'name': '溧水区'
    },
    {
      'area_id': '11340',
      'code': '320125',
      'p_code': '320100',
      'name': '高淳区'
    }
    ]
  },
  {
    'area_id': '11353',
    'code': '320200',
    'p_code': '320000',
    'name': '无锡市',
    'children': [{
      'area_id': '11373',
      'code': '320205',
      'p_code': '320200',
      'name': '锡山区'
    },
    {
      'area_id': '11382',
      'code': '320206',
      'p_code': '320200',
      'name': '惠山区'
    },
    {
      'area_id': '11391',
      'code': '320211',
      'p_code': '320200',
      'name': '滨湖区'
    },
    {
      'area_id': '11411',
      'code': '320213',
      'p_code': '320200',
      'name': '梁溪区'
    },
    {
      'area_id': '11428',
      'code': '320214',
      'p_code': '320200',
      'name': '新吴区'
    },
    {
      'area_id': '11438',
      'code': '320281',
      'p_code': '320200',
      'name': '江阴市'
    },
    {
      'area_id': '11456',
      'code': '320282',
      'p_code': '320200',
      'name': '宜兴市'
    }
    ]
  },
  {
    'area_id': '11477',
    'code': '320300',
    'p_code': '320000',
    'name': '徐州市',
    'children': [{
      'area_id': '11478',
      'code': '320302',
      'p_code': '320300',
      'name': '鼓楼区'
    },
    {
      'area_id': '11488',
      'code': '320303',
      'p_code': '320300',
      'name': '云龙区'
    },
    {
      'area_id': '11498',
      'code': '320305',
      'p_code': '320300',
      'name': '贾汪区'
    },
    {
      'area_id': '11512',
      'code': '320311',
      'p_code': '320300',
      'name': '泉山区'
    },
    {
      'area_id': '11529',
      'code': '320321',
      'p_code': '320300',
      'name': '丰县'
    },
    {
      'area_id': '11546',
      'code': '320322',
      'p_code': '320300',
      'name': '沛县'
    },
    {
      'area_id': '11566',
      'code': '320323',
      'p_code': '320300',
      'name': '铜山区'
    },
    {
      'area_id': '11598',
      'code': '320324',
      'p_code': '320300',
      'name': '睢宁县'
    },
    {
      'area_id': '11621',
      'code': '320381',
      'p_code': '320300',
      'name': '新沂市'
    },
    {
      'area_id': '11641',
      'code': '320382',
      'p_code': '320300',
      'name': '邳州市'
    }
    ]
  },
  {
    'area_id': '11670',
    'code': '320400',
    'p_code': '320000',
    'name': '常州市',
    'children': [{
      'area_id': '11671',
      'code': '320402',
      'p_code': '320400',
      'name': '天宁区'
    },
    {
      'area_id': '11679',
      'code': '320404',
      'p_code': '320400',
      'name': '钟楼区'
    },
    {
      'area_id': '11688',
      'code': '320411',
      'p_code': '320400',
      'name': '新北区'
    },
    {
      'area_id': '11699',
      'code': '320412',
      'p_code': '320400',
      'name': '武进区'
    },
    {
      'area_id': '11718',
      'code': '320481',
      'p_code': '320400',
      'name': '溧阳市'
    },
    {
      'area_id': '11732',
      'code': '320482',
      'p_code': '320400',
      'name': '金坛区'
    }
    ]
  },
  {
    'area_id': '11743',
    'code': '320500',
    'p_code': '320000',
    'name': '苏州市',
    'children': [{
      'area_id': '11744',
      'code': '320505',
      'p_code': '320500',
      'name': '虎丘区'
    },
    {
      'area_id': '11756',
      'code': '320506',
      'p_code': '320500',
      'name': '吴中区'
    },
    {
      'area_id': '11778',
      'code': '320507',
      'p_code': '320500',
      'name': '相城区'
    },
    {
      'area_id': '11790',
      'code': '320508',
      'p_code': '320500',
      'name': '姑苏区'
    },
    {
      'area_id': '11813',
      'code': '320581',
      'p_code': '320500',
      'name': '常熟市'
    },
    {
      'area_id': '11832',
      'code': '320582',
      'p_code': '320500',
      'name': '张家港市'
    },
    {
      'area_id': '11848',
      'code': '320583',
      'p_code': '320500',
      'name': '昆山市'
    },
    {
      'area_id': '11860',
      'code': '320584',
      'p_code': '320500',
      'name': '吴江区'
    },
    {
      'area_id': '11871',
      'code': '320585',
      'p_code': '320500',
      'name': '太仓市'
    },
    {
      'area_id': '47774',
      'code': '320586',
      'p_code': '320500',
      'name': '苏州工业园区'
    }
    ]
  },
  {
    'area_id': '11880',
    'code': '320600',
    'p_code': '320000',
    'name': '南通市',
    'children': [{
      'area_id': '11881',
      'code': '320602',
      'p_code': '320600',
      'name': '崇川区'
    },
    {
      'area_id': '11901',
      'code': '320611',
      'p_code': '320600',
      'name': '港闸区'
    },
    {
      'area_id': '11909',
      'code': '320612',
      'p_code': '320600',
      'name': '通州区'
    },
    {
      'area_id': '11931',
      'code': '320621',
      'p_code': '320600',
      'name': '海安县'
    },
    {
      'area_id': '11943',
      'code': '320623',
      'p_code': '320600',
      'name': '如东县'
    },
    {
      'area_id': '11966',
      'code': '320681',
      'p_code': '320600',
      'name': '启东市'
    },
    {
      'area_id': '11986',
      'code': '320682',
      'p_code': '320600',
      'name': '如皋市'
    },
    {
      'area_id': '12009',
      'code': '320684',
      'p_code': '320600',
      'name': '海门市'
    }
    ]
  },
  {
    'area_id': '12033',
    'code': '320700',
    'p_code': '320000',
    'name': '连云港市',
    'children': [{
      'area_id': '12034',
      'code': '320703',
      'p_code': '320700',
      'name': '连云区'
    },
    {
      'area_id': '12051',
      'code': '320706',
      'p_code': '320700',
      'name': '海州区'
    },
    {
      'area_id': '12075',
      'code': '320721',
      'p_code': '320700',
      'name': '赣榆区'
    },
    {
      'area_id': '12094',
      'code': '320722',
      'p_code': '320700',
      'name': '东海县'
    },
    {
      'area_id': '12115',
      'code': '320723',
      'p_code': '320700',
      'name': '灌云县'
    },
    {
      'area_id': '12133',
      'code': '320724',
      'p_code': '320700',
      'name': '灌南县'
    }
    ]
  },
  {
    'area_id': '12145',
    'code': '320800',
    'p_code': '320000',
    'name': '淮安市',
    'children': [{
      'area_id': '12146',
      'code': '320802',
      'p_code': '320800',
      'name': '清江浦区'
    },
    {
      'area_id': '12173',
      'code': '320803',
      'p_code': '320800',
      'name': '淮安区'
    },
    {
      'area_id': '12202',
      'code': '320804',
      'p_code': '320800',
      'name': '淮阴区'
    },
    {
      'area_id': '12227',
      'code': '320826',
      'p_code': '320800',
      'name': '涟水县'
    },
    {
      'area_id': '12260',
      'code': '320829',
      'p_code': '320800',
      'name': '洪泽区'
    },
    {
      'area_id': '12274',
      'code': '320830',
      'p_code': '320800',
      'name': '盱眙县'
    },
    {
      'area_id': '12298',
      'code': '320831',
      'p_code': '320800',
      'name': '金湖县'
    }
    ]
  },
  {
    'area_id': '12314',
    'code': '320900',
    'p_code': '320000',
    'name': '盐城市',
    'children': [{
      'area_id': '12315',
      'code': '320902',
      'p_code': '320900',
      'name': '亭湖区'
    },
    {
      'area_id': '12334',
      'code': '320903',
      'p_code': '320900',
      'name': '盐都区'
    },
    {
      'area_id': '12356',
      'code': '320921',
      'p_code': '320900',
      'name': '响水县'
    },
    {
      'area_id': '12368',
      'code': '320922',
      'p_code': '320900',
      'name': '滨海县'
    },
    {
      'area_id': '12390',
      'code': '320923',
      'p_code': '320900',
      'name': '阜宁县'
    },
    {
      'area_id': '12407',
      'code': '320924',
      'p_code': '320900',
      'name': '射阳县'
    },
    {
      'area_id': '12427',
      'code': '320925',
      'p_code': '320900',
      'name': '建湖县'
    },
    {
      'area_id': '12442',
      'code': '320981',
      'p_code': '320900',
      'name': '东台市'
    },
    {
      'area_id': '12463',
      'code': '320982',
      'p_code': '320900',
      'name': '大丰区'
    }
    ]
  },
  {
    'area_id': '12482',
    'code': '321000',
    'p_code': '320000',
    'name': '扬州市',
    'children': [{
      'area_id': '12483',
      'code': '321002',
      'p_code': '321000',
      'name': '广陵区'
    },
    {
      'area_id': '12496',
      'code': '321003',
      'p_code': '321000',
      'name': '邗江区'
    },
    {
      'area_id': '12523',
      'code': '321023',
      'p_code': '321000',
      'name': '宝应县'
    },
    {
      'area_id': '12539',
      'code': '321081',
      'p_code': '321000',
      'name': '仪征市'
    },
    {
      'area_id': '12559',
      'code': '321084',
      'p_code': '321000',
      'name': '高邮市'
    },
    {
      'area_id': '12575',
      'code': '321088',
      'p_code': '321000',
      'name': '江都区'
    }
    ]
  },
  {
    'area_id': '12590',
    'code': '321100',
    'p_code': '320000',
    'name': '镇江市',
    'children': [{
      'area_id': '12591',
      'code': '321102',
      'p_code': '321100',
      'name': '京口区'
    },
    {
      'area_id': '12605',
      'code': '321111',
      'p_code': '321100',
      'name': '润州区'
    },
    {
      'area_id': '12615',
      'code': '321112',
      'p_code': '321100',
      'name': '丹徒区'
    },
    {
      'area_id': '12627',
      'code': '321181',
      'p_code': '321100',
      'name': '丹阳市'
    },
    {
      'area_id': '12642',
      'code': '321182',
      'p_code': '321100',
      'name': '扬中市'
    },
    {
      'area_id': '12649',
      'code': '321183',
      'p_code': '321100',
      'name': '句容市'
    }
    ]
  },
  {
    'area_id': '12662',
    'code': '321200',
    'p_code': '320000',
    'name': '泰州市',
    'children': [{
      'area_id': '12663',
      'code': '321202',
      'p_code': '321200',
      'name': '海陵区'
    },
    {
      'area_id': '12682',
      'code': '321203',
      'p_code': '321200',
      'name': '高港区'
    },
    {
      'area_id': '12693',
      'code': '321281',
      'p_code': '321200',
      'name': '兴化市'
    },
    {
      'area_id': '12730',
      'code': '321282',
      'p_code': '321200',
      'name': '靖江市'
    },
    {
      'area_id': '12745',
      'code': '321283',
      'p_code': '321200',
      'name': '泰兴市'
    },
    {
      'area_id': '12763',
      'code': '321284',
      'p_code': '321200',
      'name': '姜堰区'
    }
    ]
  },
  {
    'area_id': '12785',
    'code': '321300',
    'p_code': '320000',
    'name': '宿迁市',
    'children': [{
      'area_id': '12786',
      'code': '321302',
      'p_code': '321300',
      'name': '宿城区'
    },
    {
      'area_id': '12811',
      'code': '321311',
      'p_code': '321300',
      'name': '宿豫区'
    },
    {
      'area_id': '12832',
      'code': '321322',
      'p_code': '321300',
      'name': '沭阳县'
    },
    {
      'area_id': '12874',
      'code': '321323',
      'p_code': '321300',
      'name': '泗阳县'
    },
    {
      'area_id': '12894',
      'code': '321324',
      'p_code': '321300',
      'name': '泗洪县'
    }
    ]
  }
  ]
},
{
  'area_id': '12921',
  'code': '330000',
  'p_code': '0',
  'name': '浙江省',
  'children': [{
    'area_id': '12922',
    'code': '330100',
    'p_code': '330000',
    'name': '杭州市',
    'children': [{
      'area_id': '12923',
      'code': '330102',
      'p_code': '330100',
      'name': '上城区'
    },
    {
      'area_id': '12930',
      'code': '330103',
      'p_code': '330100',
      'name': '下城区'
    },
    {
      'area_id': '12939',
      'code': '330104',
      'p_code': '330100',
      'name': '江干区'
    },
    {
      'area_id': '12950',
      'code': '330105',
      'p_code': '330100',
      'name': '拱墅区'
    },
    {
      'area_id': '12961',
      'code': '330106',
      'p_code': '330100',
      'name': '西湖区'
    },
    {
      'area_id': '12974',
      'code': '330108',
      'p_code': '330100',
      'name': '滨江区'
    },
    {
      'area_id': '12978',
      'code': '330109',
      'p_code': '330100',
      'name': '萧山区'
    },
    {
      'area_id': '13010',
      'code': '330110',
      'p_code': '330100',
      'name': '余杭区'
    },
    {
      'area_id': '13031',
      'code': '330122',
      'p_code': '330100',
      'name': '桐庐县'
    },
    {
      'area_id': '13046',
      'code': '330127',
      'p_code': '330100',
      'name': '淳安县'
    },
    {
      'area_id': '13070',
      'code': '330182',
      'p_code': '330100',
      'name': '建德市'
    },
    {
      'area_id': '13087',
      'code': '330183',
      'p_code': '330100',
      'name': '富阳区'
    },
    {
      'area_id': '13112',
      'code': '330185',
      'p_code': '330100',
      'name': '临安市'
    }
    ]
  },
  {
    'area_id': '13131',
    'code': '330200',
    'p_code': '330000',
    'name': '宁波市',
    'children': [{
      'area_id': '13132',
      'code': '330203',
      'p_code': '330200',
      'name': '海曙区'
    },
    {
      'area_id': '13150',
      'code': '330205',
      'p_code': '330200',
      'name': '江北区'
    },
    {
      'area_id': '13159',
      'code': '330206',
      'p_code': '330200',
      'name': '北仑区'
    },
    {
      'area_id': '13171',
      'code': '330211',
      'p_code': '330200',
      'name': '镇海区'
    },
    {
      'area_id': '13178',
      'code': '330212',
      'p_code': '330200',
      'name': '鄞州区'
    },
    {
      'area_id': '13203',
      'code': '330225',
      'p_code': '330200',
      'name': '象山县'
    },
    {
      'area_id': '13222',
      'code': '330226',
      'p_code': '330200',
      'name': '宁海县'
    },
    {
      'area_id': '13241',
      'code': '330281',
      'p_code': '330200',
      'name': '余姚市'
    },
    {
      'area_id': '13263',
      'code': '330282',
      'p_code': '330200',
      'name': '慈溪市'
    },
    {
      'area_id': '13286',
      'code': '330283',
      'p_code': '330200',
      'name': '奉化区'
    }
    ]
  },
  {
    'area_id': '13298',
    'code': '330300',
    'p_code': '330000',
    'name': '温州市',
    'children': [{
      'area_id': '13299',
      'code': '330302',
      'p_code': '330300',
      'name': '鹿城区'
    },
    {
      'area_id': '13308',
      'code': '330303',
      'p_code': '330300',
      'name': '龙湾区'
    },
    {
      'area_id': '13319',
      'code': '330304',
      'p_code': '330300',
      'name': '瓯海区'
    },
    {
      'area_id': '13333',
      'code': '330322',
      'p_code': '330300',
      'name': '洞头区'
    },
    {
      'area_id': '13341',
      'code': '330324',
      'p_code': '330300',
      'name': '永嘉县'
    },
    {
      'area_id': '13363',
      'code': '330326',
      'p_code': '330300',
      'name': '平阳县'
    },
    {
      'area_id': '13374',
      'code': '330327',
      'p_code': '330300',
      'name': '苍南县'
    },
    {
      'area_id': '13387',
      'code': '330328',
      'p_code': '330300',
      'name': '文成县'
    },
    {
      'area_id': '13398',
      'code': '330329',
      'p_code': '330300',
      'name': '泰顺县'
    },
    {
      'area_id': '13410',
      'code': '330381',
      'p_code': '330300',
      'name': '瑞安市'
    },
    {
      'area_id': '13426',
      'code': '330382',
      'p_code': '330300',
      'name': '乐清市'
    }
    ]
  },
  {
    'area_id': '13444',
    'code': '330400',
    'p_code': '330000',
    'name': '嘉兴市',
    'children': [{
      'area_id': '13445',
      'code': '330402',
      'p_code': '330400',
      'name': '南湖区'
    },
    {
      'area_id': '13459',
      'code': '330411',
      'p_code': '330400',
      'name': '秀洲区'
    },
    {
      'area_id': '13469',
      'code': '330421',
      'p_code': '330400',
      'name': '嘉善县'
    },
    {
      'area_id': '13479',
      'code': '330424',
      'p_code': '330400',
      'name': '海盐县'
    },
    {
      'area_id': '13489',
      'code': '330481',
      'p_code': '330400',
      'name': '海宁市'
    },
    {
      'area_id': '13502',
      'code': '330482',
      'p_code': '330400',
      'name': '平湖市'
    },
    {
      'area_id': '13512',
      'code': '330483',
      'p_code': '330400',
      'name': '桐乡市'
    }
    ]
  },
  {
    'area_id': '13525',
    'code': '330500',
    'p_code': '330000',
    'name': '湖州市',
    'children': [{
      'area_id': '13526',
      'code': '330502',
      'p_code': '330500',
      'name': '吴兴区'
    },
    {
      'area_id': '13545',
      'code': '330503',
      'p_code': '330500',
      'name': '南浔区'
    },
    {
      'area_id': '13555',
      'code': '330521',
      'p_code': '330500',
      'name': '德清县'
    },
    {
      'area_id': '13567',
      'code': '330522',
      'p_code': '330500',
      'name': '长兴县'
    },
    {
      'area_id': '13584',
      'code': '330523',
      'p_code': '330500',
      'name': '安吉县'
    }
    ]
  },
  {
    'area_id': '13598',
    'code': '330600',
    'p_code': '330000',
    'name': '绍兴市',
    'children': [{
      'area_id': '13599',
      'code': '330602',
      'p_code': '330600',
      'name': '越城区'
    },
    {
      'area_id': '13617',
      'code': '330621',
      'p_code': '330600',
      'name': '柯桥区'
    },
    {
      'area_id': '13634',
      'code': '330624',
      'p_code': '330600',
      'name': '新昌县'
    },
    {
      'area_id': '13651',
      'code': '330681',
      'p_code': '330600',
      'name': '诸暨市'
    },
    {
      'area_id': '13679',
      'code': '330682',
      'p_code': '330600',
      'name': '上虞区'
    },
    {
      'area_id': '13701',
      'code': '330683',
      'p_code': '330600',
      'name': '嵊州市'
    }
    ]
  },
  {
    'area_id': '13724',
    'code': '330700',
    'p_code': '330000',
    'name': '金华市',
    'children': [{
      'area_id': '13725',
      'code': '330702',
      'p_code': '330700',
      'name': '婺城区'
    },
    {
      'area_id': '13753',
      'code': '330703',
      'p_code': '330700',
      'name': '金东区'
    },
    {
      'area_id': '13765',
      'code': '330723',
      'p_code': '330700',
      'name': '武义县'
    },
    {
      'area_id': '13784',
      'code': '330726',
      'p_code': '330700',
      'name': '浦江县'
    },
    {
      'area_id': '13800',
      'code': '330727',
      'p_code': '330700',
      'name': '磐安县'
    },
    {
      'area_id': '13820',
      'code': '330781',
      'p_code': '330700',
      'name': '兰溪市'
    },
    {
      'area_id': '13837',
      'code': '330782',
      'p_code': '330700',
      'name': '义乌市'
    },
    {
      'area_id': '13851',
      'code': '330783',
      'p_code': '330700',
      'name': '东阳市'
    },
    {
      'area_id': '13870',
      'code': '330784',
      'p_code': '330700',
      'name': '永康市'
    }
    ]
  },
  {
    'area_id': '13885',
    'code': '330800',
    'p_code': '330000',
    'name': '衢州市',
    'children': [{
      'area_id': '13886',
      'code': '330802',
      'p_code': '330800',
      'name': '柯城区'
    },
    {
      'area_id': '13904',
      'code': '330803',
      'p_code': '330800',
      'name': '衢江区'
    },
    {
      'area_id': '13925',
      'code': '330822',
      'p_code': '330800',
      'name': '常山县'
    },
    {
      'area_id': '13940',
      'code': '330824',
      'p_code': '330800',
      'name': '开化县'
    },
    {
      'area_id': '13959',
      'code': '330825',
      'p_code': '330800',
      'name': '龙游县'
    },
    {
      'area_id': '13975',
      'code': '330881',
      'p_code': '330800',
      'name': '江山市'
    }
    ]
  },
  {
    'area_id': '13996',
    'code': '330900',
    'p_code': '330000',
    'name': '舟山市',
    'children': [{
      'area_id': '13997',
      'code': '330902',
      'p_code': '330900',
      'name': '定海区'
    },
    {
      'area_id': '14010',
      'code': '330903',
      'p_code': '330900',
      'name': '普陀区'
    },
    {
      'area_id': '14020',
      'code': '330921',
      'p_code': '330900',
      'name': '岱山县'
    },
    {
      'area_id': '14028',
      'code': '330922',
      'p_code': '330900',
      'name': '嵊泗县'
    }
    ]
  },
  {
    'area_id': '14036',
    'code': '331000',
    'p_code': '330000',
    'name': '台州市',
    'children': [{
      'area_id': '14037',
      'code': '331002',
      'p_code': '331000',
      'name': '椒江区'
    },
    {
      'area_id': '14050',
      'code': '331003',
      'p_code': '331000',
      'name': '黄岩区'
    },
    {
      'area_id': '14070',
      'code': '331004',
      'p_code': '331000',
      'name': '路桥区'
    },
    {
      'area_id': '14083',
      'code': '331021',
      'p_code': '331000',
      'name': '玉环县'
    },
    {
      'area_id': '14095',
      'code': '331022',
      'p_code': '331000',
      'name': '三门县'
    },
    {
      'area_id': '14110',
      'code': '331023',
      'p_code': '331000',
      'name': '天台县'
    },
    {
      'area_id': '14126',
      'code': '331024',
      'p_code': '331000',
      'name': '仙居县'
    },
    {
      'area_id': '14147',
      'code': '331081',
      'p_code': '331000',
      'name': '温岭市'
    },
    {
      'area_id': '14165',
      'code': '331082',
      'p_code': '331000',
      'name': '临海市'
    }
    ]
  },
  {
    'area_id': '14185',
    'code': '331100',
    'p_code': '330000',
    'name': '丽水市',
    'children': [{
      'area_id': '14186',
      'code': '331102',
      'p_code': '331100',
      'name': '莲都区'
    },
    {
      'area_id': '14203',
      'code': '331121',
      'p_code': '331100',
      'name': '青田县'
    },
    {
      'area_id': '14236',
      'code': '331122',
      'p_code': '331100',
      'name': '缙云县'
    },
    {
      'area_id': '14255',
      'code': '331123',
      'p_code': '331100',
      'name': '遂昌县'
    },
    {
      'area_id': '14276',
      'code': '331124',
      'p_code': '331100',
      'name': '松阳县'
    },
    {
      'area_id': '14296',
      'code': '331125',
      'p_code': '331100',
      'name': '云和县'
    },
    {
      'area_id': '14307',
      'code': '331126',
      'p_code': '331100',
      'name': '庆元县'
    },
    {
      'area_id': '14327',
      'code': '331127',
      'p_code': '331100',
      'name': '景宁畲族自治县'
    },
    {
      'area_id': '14349',
      'code': '331181',
      'p_code': '331100',
      'name': '龙泉市'
    }
    ]
  }
  ]
},
{
  'area_id': '14369',
  'code': '340000',
  'p_code': '0',
  'name': '安徽省',
  'children': [{
    'area_id': '14370',
    'code': '340100',
    'p_code': '340000',
    'name': '合肥市',
    'children': [{
      'area_id': '14371',
      'code': '340102',
      'p_code': '340100',
      'name': '瑶海区'
    },
    {
      'area_id': '14390',
      'code': '340103',
      'p_code': '340100',
      'name': '庐阳区'
    },
    {
      'area_id': '14402',
      'code': '340104',
      'p_code': '340100',
      'name': '蜀山区'
    },
    {
      'area_id': '14422',
      'code': '340111',
      'p_code': '340100',
      'name': '包河区'
    },
    {
      'area_id': '14433',
      'code': '340121',
      'p_code': '340100',
      'name': '长丰县'
    },
    {
      'area_id': '14450',
      'code': '340122',
      'p_code': '340100',
      'name': '肥东县'
    },
    {
      'area_id': '14471',
      'code': '340123',
      'p_code': '340100',
      'name': '肥西县'
    },
    {
      'area_id': '14486',
      'code': '341400',
      'p_code': '340100',
      'name': '巢湖市'
    },
    {
      'area_id': '14505',
      'code': '341421',
      'p_code': '340100',
      'name': '庐江县'
    }
    ]
  },
  {
    'area_id': '14527',
    'code': '340200',
    'p_code': '340000',
    'name': '芜湖市',
    'children': [{
      'area_id': '14528',
      'code': '340202',
      'p_code': '340200',
      'name': '镜湖区'
    },
    {
      'area_id': '14540',
      'code': '340203',
      'p_code': '340200',
      'name': '弋江区'
    },
    {
      'area_id': '14550',
      'code': '340207',
      'p_code': '340200',
      'name': '鸠江区'
    },
    {
      'area_id': '14565',
      'code': '340208',
      'p_code': '340200',
      'name': '三山区'
    },
    {
      'area_id': '14572',
      'code': '340221',
      'p_code': '340200',
      'name': '芜湖县'
    },
    {
      'area_id': '14579',
      'code': '340222',
      'p_code': '340200',
      'name': '繁昌县'
    },
    {
      'area_id': '14587',
      'code': '340223',
      'p_code': '340200',
      'name': '南陵县'
    },
    {
      'area_id': '14597',
      'code': '341422',
      'p_code': '340200',
      'name': '无为县'
    }
    ]
  },
  {
    'area_id': '14619',
    'code': '340300',
    'p_code': '340000',
    'name': '蚌埠市',
    'children': [{
      'area_id': '14620',
      'code': '340302',
      'p_code': '340300',
      'name': '龙子湖区'
    },
    {
      'area_id': '14629',
      'code': '340303',
      'p_code': '340300',
      'name': '蚌山区'
    },
    {
      'area_id': '14641',
      'code': '340304',
      'p_code': '340300',
      'name': '禹会区'
    },
    {
      'area_id': '14648',
      'code': '340311',
      'p_code': '340300',
      'name': '淮上区'
    },
    {
      'area_id': '14657',
      'code': '340321',
      'p_code': '340300',
      'name': '怀远县'
    },
    {
      'area_id': '14678',
      'code': '340322',
      'p_code': '340300',
      'name': '五河县'
    },
    {
      'area_id': '14694',
      'code': '340323',
      'p_code': '340300',
      'name': '固镇县'
    }
    ]
  },
  {
    'area_id': '14707',
    'code': '340400',
    'p_code': '340000',
    'name': '淮南市',
    'children': [{
      'area_id': '14708',
      'code': '340402',
      'p_code': '340400',
      'name': '大通区'
    },
    {
      'area_id': '14715',
      'code': '340403',
      'p_code': '340400',
      'name': '田家庵区'
    },
    {
      'area_id': '14730',
      'code': '340404',
      'p_code': '340400',
      'name': '谢家集区'
    },
    {
      'area_id': '14742',
      'code': '340405',
      'p_code': '340400',
      'name': '八公山区'
    },
    {
      'area_id': '14749',
      'code': '340406',
      'p_code': '340400',
      'name': '潘集区'
    },
    {
      'area_id': '14761',
      'code': '340421',
      'p_code': '340400',
      'name': '凤台县'
    },
    {
      'area_id': '14781',
      'code': '340499',
      'p_code': '340400',
      'name': '寿县'
    }
    ]
  },
  {
    'area_id': '14810',
    'code': '340500',
    'p_code': '340000',
    'name': '马鞍山市',
    'children': [{
      'area_id': '14811',
      'code': '340503',
      'p_code': '340500',
      'name': '花山区'
    },
    {
      'area_id': '14824',
      'code': '340504',
      'p_code': '340500',
      'name': '雨山区'
    },
    {
      'area_id': '14833',
      'code': '340506',
      'p_code': '340500',
      'name': '博望区'
    },
    {
      'area_id': '14838',
      'code': '340521',
      'p_code': '340500',
      'name': '当涂县'
    },
    {
      'area_id': '14853',
      'code': '341423',
      'p_code': '340500',
      'name': '含山县'
    },
    {
      'area_id': '14865',
      'code': '341424',
      'p_code': '340500',
      'name': '和县'
    }
    ]
  },
  {
    'area_id': '14878',
    'code': '340600',
    'p_code': '340000',
    'name': '淮北市',
    'children': [{
      'area_id': '14879',
      'code': '340602',
      'p_code': '340600',
      'name': '杜集区'
    },
    {
      'area_id': '14886',
      'code': '340603',
      'p_code': '340600',
      'name': '相山区'
    },
    {
      'area_id': '14899',
      'code': '340604',
      'p_code': '340600',
      'name': '烈山区'
    },
    {
      'area_id': '14908',
      'code': '340621',
      'p_code': '340600',
      'name': '濉溪县'
    }
    ]
  },
  {
    'area_id': '14922',
    'code': '340700',
    'p_code': '340000',
    'name': '铜陵市',
    'children': [{
      'area_id': '14930',
      'code': '340705',
      'p_code': '340700',
      'name': '铜官区'
    },
    {
      'area_id': '14936',
      'code': '340711',
      'p_code': '340700',
      'name': '郊区'
    },
    {
      'area_id': '14945',
      'code': '340721',
      'p_code': '340700',
      'name': '义安区'
    },
    {
      'area_id': '14956',
      'code': '340799',
      'p_code': '340700',
      'name': '枞阳县'
    }
    ]
  },
  {
    'area_id': '14980',
    'code': '340800',
    'p_code': '340000',
    'name': '安庆市',
    'children': [{
      'area_id': '14981',
      'code': '340802',
      'p_code': '340800',
      'name': '迎江区'
    },
    {
      'area_id': '14992',
      'code': '340803',
      'p_code': '340800',
      'name': '大观区'
    },
    {
      'area_id': '15006',
      'code': '340811',
      'p_code': '340800',
      'name': '宜秀区'
    },
    {
      'area_id': '15014',
      'code': '340822',
      'p_code': '340800',
      'name': '怀宁县'
    },
    {
      'area_id': '15035',
      'code': '340823',
      'p_code': '340800',
      'name': '枞阳县'
    },
    {
      'area_id': '15059',
      'code': '340824',
      'p_code': '340800',
      'name': '潜山县'
    },
    {
      'area_id': '15078',
      'code': '340825',
      'p_code': '340800',
      'name': '太湖县'
    },
    {
      'area_id': '15096',
      'code': '340826',
      'p_code': '340800',
      'name': '宿松县'
    },
    {
      'area_id': '15121',
      'code': '340827',
      'p_code': '340800',
      'name': '望江县'
    },
    {
      'area_id': '15133',
      'code': '340828',
      'p_code': '340800',
      'name': '岳西县'
    },
    {
      'area_id': '15159',
      'code': '340881',
      'p_code': '340800',
      'name': '桐城市'
    }
    ]
  },
  {
    'area_id': '15177',
    'code': '341000',
    'p_code': '340000',
    'name': '黄山市',
    'children': [{
      'area_id': '15178',
      'code': '341002',
      'p_code': '341000',
      'name': '屯溪区'
    },
    {
      'area_id': '15188',
      'code': '341003',
      'p_code': '341000',
      'name': '黄山区'
    },
    {
      'area_id': '15204',
      'code': '341004',
      'p_code': '341000',
      'name': '徽州区'
    },
    {
      'area_id': '15213',
      'code': '341021',
      'p_code': '341000',
      'name': '歙县'
    },
    {
      'area_id': '15243',
      'code': '341022',
      'p_code': '341000',
      'name': '休宁县'
    },
    {
      'area_id': '15265',
      'code': '341023',
      'p_code': '341000',
      'name': '黟县'
    },
    {
      'area_id': '15274',
      'code': '341024',
      'p_code': '341000',
      'name': '祁门县'
    }
    ]
  },
  {
    'area_id': '15293',
    'code': '341100',
    'p_code': '340000',
    'name': '滁州市',
    'children': [{
      'area_id': '15294',
      'code': '341102',
      'p_code': '341100',
      'name': '琅琊区'
    },
    {
      'area_id': '15307',
      'code': '341103',
      'p_code': '341100',
      'name': '南谯区'
    },
    {
      'area_id': '15319',
      'code': '341122',
      'p_code': '341100',
      'name': '来安县'
    },
    {
      'area_id': '15332',
      'code': '341124',
      'p_code': '341100',
      'name': '全椒县'
    },
    {
      'area_id': '15343',
      'code': '341125',
      'p_code': '341100',
      'name': '定远县'
    },
    {
      'area_id': '15369',
      'code': '341126',
      'p_code': '341100',
      'name': '凤阳县'
    },
    {
      'area_id': '15387',
      'code': '341181',
      'p_code': '341100',
      'name': '天长市'
    },
    {
      'area_id': '15405',
      'code': '341182',
      'p_code': '341100',
      'name': '明光市'
    }
    ]
  },
  {
    'area_id': '15423',
    'code': '341200',
    'p_code': '340000',
    'name': '阜阳市',
    'children': [{
      'area_id': '15424',
      'code': '341202',
      'p_code': '341200',
      'name': '颍州区'
    },
    {
      'area_id': '15442',
      'code': '341203',
      'p_code': '341200',
      'name': '颍东区'
    },
    {
      'area_id': '15455',
      'code': '341204',
      'p_code': '341200',
      'name': '颍泉区'
    },
    {
      'area_id': '15462',
      'code': '341221',
      'p_code': '341200',
      'name': '临泉县'
    },
    {
      'area_id': '15495',
      'code': '341222',
      'p_code': '341200',
      'name': '太和县'
    },
    {
      'area_id': '15528',
      'code': '341225',
      'p_code': '341200',
      'name': '阜南县'
    },
    {
      'area_id': '15560',
      'code': '341226',
      'p_code': '341200',
      'name': '颍上县'
    },
    {
      'area_id': '15591',
      'code': '341282',
      'p_code': '341200',
      'name': '界首市'
    }
    ]
  },
  {
    'area_id': '15610',
    'code': '341300',
    'p_code': '340000',
    'name': '宿州市',
    'children': [{
      'area_id': '15611',
      'code': '341302',
      'p_code': '341300',
      'name': '埇桥区'
    },
    {
      'area_id': '15654',
      'code': '341321',
      'p_code': '341300',
      'name': '砀山县'
    },
    {
      'area_id': '15671',
      'code': '341322',
      'p_code': '341300',
      'name': '萧县'
    },
    {
      'area_id': '15696',
      'code': '341323',
      'p_code': '341300',
      'name': '灵璧县'
    },
    {
      'area_id': '15717',
      'code': '341324',
      'p_code': '341300',
      'name': '泗县'
    }
    ]
  },
  {
    'area_id': '15734',
    'code': '341500',
    'p_code': '340000',
    'name': '六安市',
    'children': [{
      'area_id': '15735',
      'code': '341502',
      'p_code': '341500',
      'name': '金安区'
    },
    {
      'area_id': '15759',
      'code': '341503',
      'p_code': '341500',
      'name': '裕安区'
    },
    {
      'area_id': '15783',
      'code': '341504',
      'p_code': '341500',
      'name': '叶集区'
    },
    {
      'area_id': '15790',
      'code': '341521',
      'p_code': '341500',
      'name': '寿县'
    },
    {
      'area_id': '15819',
      'code': '341522',
      'p_code': '341500',
      'name': '霍邱县'
    },
    {
      'area_id': '15856',
      'code': '341523',
      'p_code': '341500',
      'name': '舒城县'
    },
    {
      'area_id': '15879',
      'code': '341524',
      'p_code': '341500',
      'name': '金寨县'
    },
    {
      'area_id': '15904',
      'code': '341525',
      'p_code': '341500',
      'name': '霍山县'
    }
    ]
  },
  {
    'area_id': '15922',
    'code': '341600',
    'p_code': '340000',
    'name': '亳州市',
    'children': [{
      'area_id': '15923',
      'code': '341602',
      'p_code': '341600',
      'name': '谯城区'
    },
    {
      'area_id': '15951',
      'code': '341621',
      'p_code': '341600',
      'name': '涡阳县'
    },
    {
      'area_id': '15978',
      'code': '341622',
      'p_code': '341600',
      'name': '蒙城县'
    },
    {
      'area_id': '16001',
      'code': '341623',
      'p_code': '341600',
      'name': '利辛县'
    }
    ]
  },
  {
    'area_id': '16027',
    'code': '341700',
    'p_code': '340000',
    'name': '池州市',
    'children': [{
      'area_id': '16028',
      'code': '341702',
      'p_code': '341700',
      'name': '贵池区'
    },
    {
      'area_id': '16054',
      'code': '341721',
      'p_code': '341700',
      'name': '东至县'
    },
    {
      'area_id': '16072',
      'code': '341722',
      'p_code': '341700',
      'name': '石台县'
    },
    {
      'area_id': '16082',
      'code': '341723',
      'p_code': '341700',
      'name': '青阳县'
    }
    ]
  },
  {
    'area_id': '16097',
    'code': '341800',
    'p_code': '340000',
    'name': '宣城市',
    'children': [{
      'area_id': '16098',
      'code': '341802',
      'p_code': '341800',
      'name': '宣州区'
    },
    {
      'area_id': '16125',
      'code': '341821',
      'p_code': '341800',
      'name': '郎溪县'
    },
    {
      'area_id': '16138',
      'code': '341822',
      'p_code': '341800',
      'name': '广德县'
    },
    {
      'area_id': '16149',
      'code': '341823',
      'p_code': '341800',
      'name': '泾县'
    },
    {
      'area_id': '16161',
      'code': '341824',
      'p_code': '341800',
      'name': '绩溪县'
    },
    {
      'area_id': '16174',
      'code': '341825',
      'p_code': '341800',
      'name': '旌德县'
    },
    {
      'area_id': '16185',
      'code': '341881',
      'p_code': '341800',
      'name': '宁国市'
    }
    ]
  }
  ]
},
{
  'area_id': '16205',
  'code': '350000',
  'p_code': '0',
  'name': '福建省',
  'children': [{
    'area_id': '16206',
    'code': '350100',
    'p_code': '350000',
    'name': '福州市',
    'children': [{
      'area_id': '16207',
      'code': '350102',
      'p_code': '350100',
      'name': '鼓楼区'
    },
    {
      'area_id': '16218',
      'code': '350103',
      'p_code': '350100',
      'name': '台江区'
    },
    {
      'area_id': '16229',
      'code': '350104',
      'p_code': '350100',
      'name': '仓山区'
    },
    {
      'area_id': '16244',
      'code': '350105',
      'p_code': '350100',
      'name': '马尾区'
    },
    {
      'area_id': '16249',
      'code': '350111',
      'p_code': '350100',
      'name': '晋安区'
    },
    {
      'area_id': '16259',
      'code': '350121',
      'p_code': '350100',
      'name': '闽侯县'
    },
    {
      'area_id': '16276',
      'code': '350122',
      'p_code': '350100',
      'name': '连江县'
    },
    {
      'area_id': '16300',
      'code': '350123',
      'p_code': '350100',
      'name': '罗源县'
    },
    {
      'area_id': '16313',
      'code': '350124',
      'p_code': '350100',
      'name': '闽清县'
    },
    {
      'area_id': '16330',
      'code': '350125',
      'p_code': '350100',
      'name': '永泰县'
    },
    {
      'area_id': '16352',
      'code': '350128',
      'p_code': '350100',
      'name': '平潭县'
    },
    {
      'area_id': '16368',
      'code': '350181',
      'p_code': '350100',
      'name': '福清市'
    },
    {
      'area_id': '16395',
      'code': '350182',
      'p_code': '350100',
      'name': '长乐市'
    }
    ]
  },
  {
    'area_id': '16414',
    'code': '350200',
    'p_code': '350000',
    'name': '厦门市',
    'children': [{
      'area_id': '16415',
      'code': '350203',
      'p_code': '350200',
      'name': '思明区'
    },
    {
      'area_id': '16426',
      'code': '350205',
      'p_code': '350200',
      'name': '海沧区'
    },
    {
      'area_id': '16434',
      'code': '350206',
      'p_code': '350200',
      'name': '湖里区'
    },
    {
      'area_id': '16442',
      'code': '350211',
      'p_code': '350200',
      'name': '集美区'
    },
    {
      'area_id': '16453',
      'code': '350212',
      'p_code': '350200',
      'name': '同安区'
    },
    {
      'area_id': '16465',
      'code': '350213',
      'p_code': '350200',
      'name': '翔安区'
    }
    ]
  },
  {
    'area_id': '16472',
    'code': '350300',
    'p_code': '350000',
    'name': '莆田市',
    'children': [{
      'area_id': '16473',
      'code': '350302',
      'p_code': '350300',
      'name': '城厢区'
    },
    {
      'area_id': '16481',
      'code': '350303',
      'p_code': '350300',
      'name': '涵江区'
    },
    {
      'area_id': '16495',
      'code': '350304',
      'p_code': '350300',
      'name': '荔城区'
    },
    {
      'area_id': '16502',
      'code': '350305',
      'p_code': '350300',
      'name': '秀屿区'
    },
    {
      'area_id': '16516',
      'code': '350322',
      'p_code': '350300',
      'name': '仙游县'
    }
    ]
  },
  {
    'area_id': '16535',
    'code': '350400',
    'p_code': '350000',
    'name': '三明市',
    'children': [{
      'area_id': '16536',
      'code': '350402',
      'p_code': '350400',
      'name': '梅列区'
    },
    {
      'area_id': '16543',
      'code': '350403',
      'p_code': '350400',
      'name': '三元区'
    },
    {
      'area_id': '16552',
      'code': '350421',
      'p_code': '350400',
      'name': '明溪县'
    },
    {
      'area_id': '16562',
      'code': '350423',
      'p_code': '350400',
      'name': '清流县'
    },
    {
      'area_id': '16576',
      'code': '350424',
      'p_code': '350400',
      'name': '宁化县'
    },
    {
      'area_id': '16593',
      'code': '350425',
      'p_code': '350400',
      'name': '大田县'
    },
    {
      'area_id': '16613',
      'code': '350426',
      'p_code': '350400',
      'name': '尤溪县'
    },
    {
      'area_id': '16629',
      'code': '350427',
      'p_code': '350400',
      'name': '沙县'
    },
    {
      'area_id': '16646',
      'code': '350428',
      'p_code': '350400',
      'name': '将乐县'
    },
    {
      'area_id': '16660',
      'code': '350429',
      'p_code': '350400',
      'name': '泰宁县'
    },
    {
      'area_id': '16670',
      'code': '350430',
      'p_code': '350400',
      'name': '建宁县'
    },
    {
      'area_id': '16681',
      'code': '350481',
      'p_code': '350400',
      'name': '永安市'
    }
    ]
  },
  {
    'area_id': '16697',
    'code': '350500',
    'p_code': '350000',
    'name': '泉州市',
    'children': [{
      'area_id': '16698',
      'code': '350502',
      'p_code': '350500',
      'name': '鲤城区'
    },
    {
      'area_id': '16708',
      'code': '350503',
      'p_code': '350500',
      'name': '丰泽区'
    },
    {
      'area_id': '16717',
      'code': '350504',
      'p_code': '350500',
      'name': '洛江区'
    },
    {
      'area_id': '16724',
      'code': '350505',
      'p_code': '350500',
      'name': '泉港区'
    },
    {
      'area_id': '16732',
      'code': '350521',
      'p_code': '350500',
      'name': '惠安县'
    },
    {
      'area_id': '16751',
      'code': '350524',
      'p_code': '350500',
      'name': '安溪县'
    },
    {
      'area_id': '16776',
      'code': '350525',
      'p_code': '350500',
      'name': '永春县'
    },
    {
      'area_id': '16799',
      'code': '350526',
      'p_code': '350500',
      'name': '德化县'
    },
    {
      'area_id': '16818',
      'code': '350527',
      'p_code': '350500',
      'name': '金门县'
    },
    {
      'area_id': '16819',
      'code': '350581',
      'p_code': '350500',
      'name': '石狮市'
    },
    {
      'area_id': '16829',
      'code': '350582',
      'p_code': '350500',
      'name': '晋江市'
    },
    {
      'area_id': '16852',
      'code': '350583',
      'p_code': '350500',
      'name': '南安市'
    }
    ]
  },
  {
    'area_id': '16880',
    'code': '350600',
    'p_code': '350000',
    'name': '漳州市',
    'children': [{
      'area_id': '16881',
      'code': '350602',
      'p_code': '350600',
      'name': '芗城区'
    },
    {
      'area_id': '16896',
      'code': '350603',
      'p_code': '350600',
      'name': '龙文区'
    },
    {
      'area_id': '16902',
      'code': '350622',
      'p_code': '350600',
      'name': '云霄县'
    },
    {
      'area_id': '16915',
      'code': '350623',
      'p_code': '350600',
      'name': '漳浦县'
    },
    {
      'area_id': '16946',
      'code': '350624',
      'p_code': '350600',
      'name': '诏安县'
    },
    {
      'area_id': '16967',
      'code': '350625',
      'p_code': '350600',
      'name': '长泰县'
    },
    {
      'area_id': '16977',
      'code': '350626',
      'p_code': '350600',
      'name': '东山县'
    },
    {
      'area_id': '16985',
      'code': '350627',
      'p_code': '350600',
      'name': '南靖县'
    },
    {
      'area_id': '16998',
      'code': '350628',
      'p_code': '350600',
      'name': '平和县'
    },
    {
      'area_id': '17016',
      'code': '350629',
      'p_code': '350600',
      'name': '华安县'
    },
    {
      'area_id': '17027',
      'code': '350681',
      'p_code': '350600',
      'name': '龙海市'
    }
    ]
  },
  {
    'area_id': '17052',
    'code': '350700',
    'p_code': '350000',
    'name': '南平市',
    'children': [{
      'area_id': '17053',
      'code': '350702',
      'p_code': '350700',
      'name': '延平区'
    },
    {
      'area_id': '17075',
      'code': '350721',
      'p_code': '350700',
      'name': '顺昌县'
    },
    {
      'area_id': '17088',
      'code': '350722',
      'p_code': '350700',
      'name': '浦城县'
    },
    {
      'area_id': '17109',
      'code': '350723',
      'p_code': '350700',
      'name': '光泽县'
    },
    {
      'area_id': '17118',
      'code': '350724',
      'p_code': '350700',
      'name': '松溪县'
    },
    {
      'area_id': '17128',
      'code': '350725',
      'p_code': '350700',
      'name': '政和县'
    },
    {
      'area_id': '17139',
      'code': '350781',
      'p_code': '350700',
      'name': '邵武市'
    },
    {
      'area_id': '17159',
      'code': '350782',
      'p_code': '350700',
      'name': '武夷山市'
    },
    {
      'area_id': '17170',
      'code': '350783',
      'p_code': '350700',
      'name': '建瓯市'
    },
    {
      'area_id': '17189',
      'code': '350784',
      'p_code': '350700',
      'name': '建阳区'
    }
    ]
  },
  {
    'area_id': '17203',
    'code': '350800',
    'p_code': '350000',
    'name': '龙岩市',
    'children': [{
      'area_id': '17204',
      'code': '350802',
      'p_code': '350800',
      'name': '新罗区'
    },
    {
      'area_id': '17225',
      'code': '350821',
      'p_code': '350800',
      'name': '长汀县'
    },
    {
      'area_id': '17244',
      'code': '350822',
      'p_code': '350800',
      'name': '永定区'
    },
    {
      'area_id': '17269',
      'code': '350823',
      'p_code': '350800',
      'name': '上杭县'
    },
    {
      'area_id': '17292',
      'code': '350824',
      'p_code': '350800',
      'name': '武平县'
    },
    {
      'area_id': '17310',
      'code': '350825',
      'p_code': '350800',
      'name': '连城县'
    },
    {
      'area_id': '17328',
      'code': '350881',
      'p_code': '350800',
      'name': '漳平市'
    }
    ]
  },
  {
    'area_id': '17345',
    'code': '350900',
    'p_code': '350000',
    'name': '宁德市',
    'children': [{
      'area_id': '17346',
      'code': '350902',
      'p_code': '350900',
      'name': '蕉城区'
    },
    {
      'area_id': '17364',
      'code': '350921',
      'p_code': '350900',
      'name': '霞浦县'
    },
    {
      'area_id': '17379',
      'code': '350922',
      'p_code': '350900',
      'name': '古田县'
    },
    {
      'area_id': '17394',
      'code': '350923',
      'p_code': '350900',
      'name': '屏南县'
    },
    {
      'area_id': '17406',
      'code': '350924',
      'p_code': '350900',
      'name': '寿宁县'
    },
    {
      'area_id': '17421',
      'code': '350925',
      'p_code': '350900',
      'name': '周宁县'
    },
    {
      'area_id': '17431',
      'code': '350926',
      'p_code': '350900',
      'name': '柘荣县'
    },
    {
      'area_id': '17441',
      'code': '350981',
      'p_code': '350900',
      'name': '福安市'
    },
    {
      'area_id': '17466',
      'code': '350982',
      'p_code': '350900',
      'name': '福鼎市'
    }
    ]
  }
  ]
},
{
  'area_id': '17484',
  'code': '360000',
  'p_code': '0',
  'name': '江西省',
  'children': [{
    'area_id': '17485',
    'code': '360100',
    'p_code': '360000',
    'name': '南昌市',
    'children': [{
      'area_id': '17486',
      'code': '360102',
      'p_code': '360100',
      'name': '东湖区'
    },
    {
      'area_id': '17500',
      'code': '360103',
      'p_code': '360100',
      'name': '西湖区'
    },
    {
      'area_id': '17513',
      'code': '360104',
      'p_code': '360100',
      'name': '青云谱区'
    },
    {
      'area_id': '17521',
      'code': '360105',
      'p_code': '360100',
      'name': '湾里区'
    },
    {
      'area_id': '17528',
      'code': '360111',
      'p_code': '360100',
      'name': '青山湖区'
    },
    {
      'area_id': '17543',
      'code': '360121',
      'p_code': '360100',
      'name': '南昌县'
    },
    {
      'area_id': '17566',
      'code': '360122',
      'p_code': '360100',
      'name': '新建区'
    },
    {
      'area_id': '17595',
      'code': '360123',
      'p_code': '360100',
      'name': '安义县'
    },
    {
      'area_id': '17609',
      'code': '360124',
      'p_code': '360100',
      'name': '进贤县'
    }
    ]
  },
  {
    'area_id': '17632',
    'code': '360200',
    'p_code': '360000',
    'name': '景德镇市',
    'children': [{
      'area_id': '17633',
      'code': '360202',
      'p_code': '360200',
      'name': '昌江区'
    },
    {
      'area_id': '17644',
      'code': '360203',
      'p_code': '360200',
      'name': '珠山区'
    },
    {
      'area_id': '17656',
      'code': '360222',
      'p_code': '360200',
      'name': '浮梁县'
    },
    {
      'area_id': '17677',
      'code': '360281',
      'p_code': '360200',
      'name': '乐平市'
    }
    ]
  },
  {
    'area_id': '17698',
    'code': '360300',
    'p_code': '360000',
    'name': '萍乡市',
    'children': [{
      'area_id': '17699',
      'code': '360302',
      'p_code': '360300',
      'name': '安源区'
    },
    {
      'area_id': '17712',
      'code': '360313',
      'p_code': '360300',
      'name': '湘东区'
    },
    {
      'area_id': '17724',
      'code': '360321',
      'p_code': '360300',
      'name': '莲花县'
    },
    {
      'area_id': '17738',
      'code': '360322',
      'p_code': '360300',
      'name': '上栗县'
    },
    {
      'area_id': '17749',
      'code': '360323',
      'p_code': '360300',
      'name': '芦溪县'
    }
    ]
  },
  {
    'area_id': '17760',
    'code': '360400',
    'p_code': '360000',
    'name': '九江市',
    'children': [{
      'area_id': '17761',
      'code': '360402',
      'p_code': '360400',
      'name': '濂溪区'
    },
    {
      'area_id': '17776',
      'code': '360403',
      'p_code': '360400',
      'name': '浔阳区'
    },
    {
      'area_id': '17785',
      'code': '360421',
      'p_code': '360400',
      'name': '九江县'
    },
    {
      'area_id': '17802',
      'code': '360423',
      'p_code': '360400',
      'name': '武宁县'
    },
    {
      'area_id': '17824',
      'code': '360424',
      'p_code': '360400',
      'name': '修水县'
    },
    {
      'area_id': '17861',
      'code': '360425',
      'p_code': '360400',
      'name': '永修县'
    },
    {
      'area_id': '17882',
      'code': '360426',
      'p_code': '360400',
      'name': '德安县'
    },
    {
      'area_id': '17898',
      'code': '360427',
      'p_code': '360400',
      'name': '庐山市'
    },
    {
      'area_id': '17912',
      'code': '360428',
      'p_code': '360400',
      'name': '都昌县'
    },
    {
      'area_id': '17939',
      'code': '360429',
      'p_code': '360400',
      'name': '湖口县'
    },
    {
      'area_id': '17954',
      'code': '360430',
      'p_code': '360400',
      'name': '彭泽县'
    },
    {
      'area_id': '17977',
      'code': '360481',
      'p_code': '360400',
      'name': '瑞昌市'
    },
    {
      'area_id': '17999',
      'code': '360483',
      'p_code': '360400',
      'name': '共青城市'
    }
    ]
  },
  {
    'area_id': '18006',
    'code': '360500',
    'p_code': '360000',
    'name': '新余市',
    'children': [{
      'area_id': '18007',
      'code': '360502',
      'p_code': '360500',
      'name': '渝水区'
    },
    {
      'area_id': '18029',
      'code': '360521',
      'p_code': '360500',
      'name': '分宜县'
    }
    ]
  },
  {
    'area_id': '18048',
    'code': '360600',
    'p_code': '360000',
    'name': '鹰潭市',
    'children': [{
      'area_id': '18049',
      'code': '360602',
      'p_code': '360600',
      'name': '月湖区'
    },
    {
      'area_id': '18058',
      'code': '360622',
      'p_code': '360600',
      'name': '余江县'
    },
    {
      'area_id': '18080',
      'code': '360681',
      'p_code': '360600',
      'name': '贵溪市'
    }
    ]
  },
  {
    'area_id': '18114',
    'code': '360700',
    'p_code': '360000',
    'name': '赣州市',
    'children': [{
      'area_id': '18115',
      'code': '360702',
      'p_code': '360700',
      'name': '章贡区'
    },
    {
      'area_id': '18132',
      'code': '360721',
      'p_code': '360700',
      'name': '赣县'
    },
    {
      'area_id': '18153',
      'code': '360722',
      'p_code': '360700',
      'name': '信丰县'
    },
    {
      'area_id': '18171',
      'code': '360723',
      'p_code': '360700',
      'name': '大余县'
    },
    {
      'area_id': '18184',
      'code': '360724',
      'p_code': '360700',
      'name': '上犹县'
    },
    {
      'area_id': '18200',
      'code': '360725',
      'p_code': '360700',
      'name': '崇义县'
    },
    {
      'area_id': '18218',
      'code': '360726',
      'p_code': '360700',
      'name': '安远县'
    },
    {
      'area_id': '18238',
      'code': '360727',
      'p_code': '360700',
      'name': '龙南县'
    },
    {
      'area_id': '18255',
      'code': '360728',
      'p_code': '360700',
      'name': '定南县'
    },
    {
      'area_id': '18264',
      'code': '360729',
      'p_code': '360700',
      'name': '全南县'
    },
    {
      'area_id': '18276',
      'code': '360730',
      'p_code': '360700',
      'name': '宁都县'
    },
    {
      'area_id': '18302',
      'code': '360731',
      'p_code': '360700',
      'name': '于都县'
    },
    {
      'area_id': '18327',
      'code': '360732',
      'p_code': '360700',
      'name': '兴国县'
    },
    {
      'area_id': '18354',
      'code': '360733',
      'p_code': '360700',
      'name': '会昌县'
    },
    {
      'area_id': '18375',
      'code': '360734',
      'p_code': '360700',
      'name': '寻乌县'
    },
    {
      'area_id': '18391',
      'code': '360735',
      'p_code': '360700',
      'name': '石城县'
    },
    {
      'area_id': '18402',
      'code': '360781',
      'p_code': '360700',
      'name': '瑞金市'
    },
    {
      'area_id': '18421',
      'code': '360782',
      'p_code': '360700',
      'name': '南康区'
    }
    ]
  },
  {
    'area_id': '18443',
    'code': '360800',
    'p_code': '360000',
    'name': '吉安市',
    'children': [{
      'area_id': '18444',
      'code': '360802',
      'p_code': '360800',
      'name': '吉州区'
    },
    {
      'area_id': '18457',
      'code': '360803',
      'p_code': '360800',
      'name': '青原区'
    },
    {
      'area_id': '18469',
      'code': '360821',
      'p_code': '360800',
      'name': '吉安县'
    },
    {
      'area_id': '18492',
      'code': '360822',
      'p_code': '360800',
      'name': '吉水县'
    },
    {
      'area_id': '18512',
      'code': '360823',
      'p_code': '360800',
      'name': '峡江县'
    },
    {
      'area_id': '18525',
      'code': '360824',
      'p_code': '360800',
      'name': '新干县'
    },
    {
      'area_id': '18543',
      'code': '360825',
      'p_code': '360800',
      'name': '永丰县'
    },
    {
      'area_id': '18568',
      'code': '360826',
      'p_code': '360800',
      'name': '泰和县'
    },
    {
      'area_id': '18597',
      'code': '360827',
      'p_code': '360800',
      'name': '遂川县'
    },
    {
      'area_id': '18624',
      'code': '360828',
      'p_code': '360800',
      'name': '万安县'
    },
    {
      'area_id': '18643',
      'code': '360829',
      'p_code': '360800',
      'name': '安福县'
    },
    {
      'area_id': '18664',
      'code': '360830',
      'p_code': '360800',
      'name': '永新县'
    },
    {
      'area_id': '18690',
      'code': '360881',
      'p_code': '360800',
      'name': '井冈山市'
    }
    ]
  },
  {
    'area_id': '18714',
    'code': '360900',
    'p_code': '360000',
    'name': '宜春市',
    'children': [{
      'area_id': '18715',
      'code': '360902',
      'p_code': '360900',
      'name': '袁州区'
    },
    {
      'area_id': '18755',
      'code': '360921',
      'p_code': '360900',
      'name': '奉新县'
    },
    {
      'area_id': '18775',
      'code': '360922',
      'p_code': '360900',
      'name': '万载县'
    },
    {
      'area_id': '18794',
      'code': '360923',
      'p_code': '360900',
      'name': '上高县'
    },
    {
      'area_id': '18812',
      'code': '360924',
      'p_code': '360900',
      'name': '宜丰县'
    },
    {
      'area_id': '18830',
      'code': '360925',
      'p_code': '360900',
      'name': '靖安县'
    },
    {
      'area_id': '18843',
      'code': '360926',
      'p_code': '360900',
      'name': '铜鼓县'
    },
    {
      'area_id': '18857',
      'code': '360981',
      'p_code': '360900',
      'name': '丰城市'
    },
    {
      'area_id': '18893',
      'code': '360982',
      'p_code': '360900',
      'name': '樟树市'
    },
    {
      'area_id': '18916',
      'code': '360983',
      'p_code': '360900',
      'name': '高安市'
    }
    ]
  },
  {
    'area_id': '18947',
    'code': '361000',
    'p_code': '360000',
    'name': '抚州市',
    'children': [{
      'area_id': '18948',
      'code': '361002',
      'p_code': '361000',
      'name': '临川区'
    },
    {
      'area_id': '18986',
      'code': '361021',
      'p_code': '361000',
      'name': '南城县'
    },
    {
      'area_id': '19000',
      'code': '361022',
      'p_code': '361000',
      'name': '黎川县'
    },
    {
      'area_id': '19018',
      'code': '361023',
      'p_code': '361000',
      'name': '南丰县'
    },
    {
      'area_id': '19033',
      'code': '361024',
      'p_code': '361000',
      'name': '崇仁县'
    },
    {
      'area_id': '19049',
      'code': '361025',
      'p_code': '361000',
      'name': '乐安县'
    },
    {
      'area_id': '19066',
      'code': '361026',
      'p_code': '361000',
      'name': '宜黄县'
    },
    {
      'area_id': '19082',
      'code': '361027',
      'p_code': '361000',
      'name': '金溪县'
    },
    {
      'area_id': '19097',
      'code': '361028',
      'p_code': '361000',
      'name': '资溪县'
    },
    {
      'area_id': '19105',
      'code': '361029',
      'p_code': '361000',
      'name': '东乡县'
    },
    {
      'area_id': '19126',
      'code': '361030',
      'p_code': '361000',
      'name': '广昌县'
    }
    ]
  },
  {
    'area_id': '19140',
    'code': '361100',
    'p_code': '360000',
    'name': '上饶市',
    'children': [{
      'area_id': '19141',
      'code': '361102',
      'p_code': '361100',
      'name': '信州区'
    },
    {
      'area_id': '19151',
      'code': '361121',
      'p_code': '361100',
      'name': '上饶县'
    },
    {
      'area_id': '19176',
      'code': '361122',
      'p_code': '361100',
      'name': '广丰区'
    },
    {
      'area_id': '19201',
      'code': '361123',
      'p_code': '361100',
      'name': '玉山县'
    },
    {
      'area_id': '19220',
      'code': '361124',
      'p_code': '361100',
      'name': '铅山县'
    },
    {
      'area_id': '19241',
      'code': '361125',
      'p_code': '361100',
      'name': '横峰县'
    },
    {
      'area_id': '19256',
      'code': '361126',
      'p_code': '361100',
      'name': '弋阳县'
    },
    {
      'area_id': '19274',
      'code': '361127',
      'p_code': '361100',
      'name': '余干县'
    },
    {
      'area_id': '19302',
      'code': '361128',
      'p_code': '361100',
      'name': '鄱阳县'
    },
    {
      'area_id': '19334',
      'code': '361129',
      'p_code': '361100',
      'name': '万年县'
    },
    {
      'area_id': '19347',
      'code': '361130',
      'p_code': '361100',
      'name': '婺源县'
    },
    {
      'area_id': '19365',
      'code': '361181',
      'p_code': '361100',
      'name': '德兴市'
    }
    ]
  }
  ]
},
{
  'area_id': '19381',
  'code': '370000',
  'p_code': '0',
  'name': '山东省',
  'children': [{
    'area_id': '19382',
    'code': '370100',
    'p_code': '370000',
    'name': '济南市',
    'children': [{
      'area_id': '19383',
      'code': '370102',
      'p_code': '370100',
      'name': '历下区'
    },
    {
      'area_id': '19398',
      'code': '370103',
      'p_code': '370100',
      'name': '市中区'
    },
    {
      'area_id': '19416',
      'code': '370104',
      'p_code': '370100',
      'name': '槐荫区'
    },
    {
      'area_id': '19434',
      'code': '370105',
      'p_code': '370100',
      'name': '天桥区'
    },
    {
      'area_id': '19450',
      'code': '370112',
      'p_code': '370100',
      'name': '历城区'
    },
    {
      'area_id': '19472',
      'code': '370113',
      'p_code': '370100',
      'name': '长清区'
    },
    {
      'area_id': '19483',
      'code': '370124',
      'p_code': '370100',
      'name': '平阴县'
    },
    {
      'area_id': '19492',
      'code': '370125',
      'p_code': '370100',
      'name': '济阳县'
    },
    {
      'area_id': '19503',
      'code': '370126',
      'p_code': '370100',
      'name': '商河县'
    },
    {
      'area_id': '19516',
      'code': '370181',
      'p_code': '370100',
      'name': '章丘区'
    }
    ]
  },
  {
    'area_id': '19537',
    'code': '370200',
    'p_code': '370000',
    'name': '青岛市',
    'children': [{
      'area_id': '19538',
      'code': '370202',
      'p_code': '370200',
      'name': '市南区'
    },
    {
      'area_id': '19549',
      'code': '370203',
      'p_code': '370200',
      'name': '市北区'
    },
    {
      'area_id': '19573',
      'code': '370211',
      'p_code': '370200',
      'name': '黄岛区'
    },
    {
      'area_id': '19596',
      'code': '370212',
      'p_code': '370200',
      'name': '崂山区'
    },
    {
      'area_id': '19601',
      'code': '370213',
      'p_code': '370200',
      'name': '李沧区'
    },
    {
      'area_id': '19613',
      'code': '370214',
      'p_code': '370200',
      'name': '城阳区'
    },
    {
      'area_id': '19622',
      'code': '370281',
      'p_code': '370200',
      'name': '胶州市'
    },
    {
      'area_id': '19635',
      'code': '370282',
      'p_code': '370200',
      'name': '即墨市'
    },
    {
      'area_id': '19651',
      'code': '370283',
      'p_code': '370200',
      'name': '平度市'
    },
    {
      'area_id': '19670',
      'code': '370285',
      'p_code': '370200',
      'name': '莱西市'
    }
    ]
  },
  {
    'area_id': '19682',
    'code': '370300',
    'p_code': '370000',
    'name': '淄博市',
    'children': [{
      'area_id': '19683',
      'code': '370302',
      'p_code': '370300',
      'name': '淄川区'
    },
    {
      'area_id': '19697',
      'code': '370303',
      'p_code': '370300',
      'name': '张店区'
    },
    {
      'area_id': '19711',
      'code': '370304',
      'p_code': '370300',
      'name': '博山区'
    },
    {
      'area_id': '19722',
      'code': '370305',
      'p_code': '370300',
      'name': '临淄区'
    },
    {
      'area_id': '19735',
      'code': '370306',
      'p_code': '370300',
      'name': '周村区'
    },
    {
      'area_id': '19746',
      'code': '370321',
      'p_code': '370300',
      'name': '桓台县'
    },
    {
      'area_id': '19756',
      'code': '370322',
      'p_code': '370300',
      'name': '高青县'
    },
    {
      'area_id': '19766',
      'code': '370323',
      'p_code': '370300',
      'name': '沂源县'
    }
    ]
  },
  {
    'area_id': '19779',
    'code': '370400',
    'p_code': '370000',
    'name': '枣庄市',
    'children': [{
      'area_id': '19780',
      'code': '370402',
      'p_code': '370400',
      'name': '市中区'
    },
    {
      'area_id': '19792',
      'code': '370403',
      'p_code': '370400',
      'name': '薛城区'
    },
    {
      'area_id': '19802',
      'code': '370404',
      'p_code': '370400',
      'name': '峄城区'
    },
    {
      'area_id': '19810',
      'code': '370405',
      'p_code': '370400',
      'name': '台儿庄区'
    },
    {
      'area_id': '19817',
      'code': '370406',
      'p_code': '370400',
      'name': '山亭区'
    },
    {
      'area_id': '19828',
      'code': '370481',
      'p_code': '370400',
      'name': '滕州市'
    }
    ]
  },
  {
    'area_id': '19850',
    'code': '370500',
    'p_code': '370000',
    'name': '东营市',
    'children': [{
      'area_id': '19851',
      'code': '370502',
      'p_code': '370500',
      'name': '东营区'
    },
    {
      'area_id': '19862',
      'code': '370503',
      'p_code': '370500',
      'name': '河口区'
    },
    {
      'area_id': '19871',
      'code': '370521',
      'p_code': '370500',
      'name': '垦利区'
    },
    {
      'area_id': '19884',
      'code': '370522',
      'p_code': '370500',
      'name': '利津县'
    },
    {
      'area_id': '19895',
      'code': '370523',
      'p_code': '370500',
      'name': '广饶县'
    }
    ]
  },
  {
    'area_id': '19907',
    'code': '370600',
    'p_code': '370000',
    'name': '烟台市',
    'children': [{
      'area_id': '19908',
      'code': '370602',
      'p_code': '370600',
      'name': '芝罘区'
    },
    {
      'area_id': '19921',
      'code': '370611',
      'p_code': '370600',
      'name': '福山区'
    },
    {
      'area_id': '19933',
      'code': '370612',
      'p_code': '370600',
      'name': '牟平区'
    },
    {
      'area_id': '19947',
      'code': '370613',
      'p_code': '370600',
      'name': '莱山区'
    },
    {
      'area_id': '19955',
      'code': '370634',
      'p_code': '370600',
      'name': '长岛县'
    },
    {
      'area_id': '19964',
      'code': '370681',
      'p_code': '370600',
      'name': '龙口市'
    },
    {
      'area_id': '19978',
      'code': '370682',
      'p_code': '370600',
      'name': '莱阳市'
    },
    {
      'area_id': '19997',
      'code': '370683',
      'p_code': '370600',
      'name': '莱州市'
    },
    {
      'area_id': '20015',
      'code': '370684',
      'p_code': '370600',
      'name': '蓬莱市'
    },
    {
      'area_id': '20028',
      'code': '370685',
      'p_code': '370600',
      'name': '招远市'
    },
    {
      'area_id': '20043',
      'code': '370686',
      'p_code': '370600',
      'name': '栖霞市'
    },
    {
      'area_id': '20060',
      'code': '370687',
      'p_code': '370600',
      'name': '海阳市'
    }
    ]
  },
  {
    'area_id': '20076',
    'code': '370700',
    'p_code': '370000',
    'name': '潍坊市',
    'children': [{
      'area_id': '20077',
      'code': '370702',
      'p_code': '370700',
      'name': '潍城区'
    },
    {
      'area_id': '20085',
      'code': '370703',
      'p_code': '370700',
      'name': '寒亭区'
    },
    {
      'area_id': '20093',
      'code': '370704',
      'p_code': '370700',
      'name': '坊子区'
    },
    {
      'area_id': '20101',
      'code': '370705',
      'p_code': '370700',
      'name': '奎文区'
    },
    {
      'area_id': '20112',
      'code': '370724',
      'p_code': '370700',
      'name': '临朐县'
    },
    {
      'area_id': '20123',
      'code': '370725',
      'p_code': '370700',
      'name': '昌乐县'
    },
    {
      'area_id': '20134',
      'code': '370781',
      'p_code': '370700',
      'name': '青州市'
    },
    {
      'area_id': '20148',
      'code': '370782',
      'p_code': '370700',
      'name': '诸城市'
    },
    {
      'area_id': '20163',
      'code': '370783',
      'p_code': '370700',
      'name': '寿光市'
    },
    {
      'area_id': '20179',
      'code': '370784',
      'p_code': '370700',
      'name': '安丘市'
    },
    {
      'area_id': '20192',
      'code': '370785',
      'p_code': '370700',
      'name': '高密市'
    },
    {
      'area_id': '20203',
      'code': '370786',
      'p_code': '370700',
      'name': '昌邑市'
    }
    ]
  },
  {
    'area_id': '20213',
    'code': '370800',
    'p_code': '370000',
    'name': '济宁市',
    'children': [{
      'area_id': '20214',
      'code': '370811',
      'p_code': '370800',
      'name': '任城区'
    },
    {
      'area_id': '20236',
      'code': '370826',
      'p_code': '370800',
      'name': '微山县'
    },
    {
      'area_id': '20252',
      'code': '370827',
      'p_code': '370800',
      'name': '鱼台县'
    },
    {
      'area_id': '20264',
      'code': '370828',
      'p_code': '370800',
      'name': '金乡县'
    },
    {
      'area_id': '20278',
      'code': '370829',
      'p_code': '370800',
      'name': '嘉祥县'
    },
    {
      'area_id': '20295',
      'code': '370830',
      'p_code': '370800',
      'name': '汶上县'
    },
    {
      'area_id': '20311',
      'code': '370831',
      'p_code': '370800',
      'name': '泗水县'
    },
    {
      'area_id': '20325',
      'code': '370832',
      'p_code': '370800',
      'name': '梁山县'
    },
    {
      'area_id': '20341',
      'code': '370881',
      'p_code': '370800',
      'name': '曲阜市'
    },
    {
      'area_id': '20354',
      'code': '370882',
      'p_code': '370800',
      'name': '兖州区'
    },
    {
      'area_id': '20367',
      'code': '370883',
      'p_code': '370800',
      'name': '邹城市'
    }
    ]
  },
  {
    'area_id': '20384',
    'code': '370900',
    'p_code': '370000',
    'name': '泰安市',
    'children': [{
      'area_id': '20385',
      'code': '370902',
      'p_code': '370900',
      'name': '泰山区'
    },
    {
      'area_id': '20394',
      'code': '370903',
      'p_code': '370900',
      'name': '岱岳区'
    },
    {
      'area_id': '20413',
      'code': '370921',
      'p_code': '370900',
      'name': '宁阳县'
    },
    {
      'area_id': '20427',
      'code': '370923',
      'p_code': '370900',
      'name': '东平县'
    },
    {
      'area_id': '20442',
      'code': '370982',
      'p_code': '370900',
      'name': '新泰市'
    },
    {
      'area_id': '20463',
      'code': '370983',
      'p_code': '370900',
      'name': '肥城市'
    }
    ]
  },
  {
    'area_id': '20478',
    'code': '371000',
    'p_code': '370000',
    'name': '威海市',
    'children': [{
      'area_id': '20479',
      'code': '371002',
      'p_code': '371000',
      'name': '环翠区'
    },
    {
      'area_id': '20499',
      'code': '371081',
      'p_code': '371000',
      'name': '文登区'
    },
    {
      'area_id': '20517',
      'code': '371082',
      'p_code': '371000',
      'name': '荣成市'
    },
    {
      'area_id': '20540',
      'code': '371083',
      'p_code': '371000',
      'name': '乳山市'
    }
    ]
  },
  {
    'area_id': '20556',
    'code': '371100',
    'p_code': '370000',
    'name': '日照市',
    'children': [{
      'area_id': '20557',
      'code': '371102',
      'p_code': '371100',
      'name': '东港区'
    },
    {
      'area_id': '20572',
      'code': '371103',
      'p_code': '371100',
      'name': '岚山区'
    },
    {
      'area_id': '20582',
      'code': '371121',
      'p_code': '371100',
      'name': '五莲县'
    },
    {
      'area_id': '20595',
      'code': '371122',
      'p_code': '371100',
      'name': '莒县'
    }
    ]
  },
  {
    'area_id': '20617',
    'code': '371200',
    'p_code': '370000',
    'name': '莱芜市',
    'children': [{
      'area_id': '20618',
      'code': '371202',
      'p_code': '371200',
      'name': '莱城区'
    },
    {
      'area_id': '20634',
      'code': '371203',
      'p_code': '371200',
      'name': '钢城区'
    }
    ]
  },
  {
    'area_id': '20640',
    'code': '371300',
    'p_code': '370000',
    'name': '临沂市',
    'children': [{
      'area_id': '20641',
      'code': '371302',
      'p_code': '371300',
      'name': '兰山区'
    },
    {
      'area_id': '20654',
      'code': '371311',
      'p_code': '371300',
      'name': '罗庄区'
    },
    {
      'area_id': '20664',
      'code': '371312',
      'p_code': '371300',
      'name': '河东区'
    },
    {
      'area_id': '20676',
      'code': '371321',
      'p_code': '371300',
      'name': '沂南县'
    },
    {
      'area_id': '20692',
      'code': '371322',
      'p_code': '371300',
      'name': '郯城县'
    },
    {
      'area_id': '20706',
      'code': '371323',
      'p_code': '371300',
      'name': '沂水县'
    },
    {
      'area_id': '20725',
      'code': '371324',
      'p_code': '371300',
      'name': '兰陵县'
    },
    {
      'area_id': '20743',
      'code': '371325',
      'p_code': '371300',
      'name': '费县'
    },
    {
      'area_id': '20756',
      'code': '371326',
      'p_code': '371300',
      'name': '平邑县'
    },
    {
      'area_id': '20771',
      'code': '371327',
      'p_code': '371300',
      'name': '莒南县'
    },
    {
      'area_id': '20788',
      'code': '371328',
      'p_code': '371300',
      'name': '蒙阴县'
    },
    {
      'area_id': '20799',
      'code': '371329',
      'p_code': '371300',
      'name': '临沭县'
    }
    ]
  },
  {
    'area_id': '20810',
    'code': '371400',
    'p_code': '370000',
    'name': '德州市',
    'children': [{
      'area_id': '20811',
      'code': '371402',
      'p_code': '371400',
      'name': '德城区'
    },
    {
      'area_id': '20824',
      'code': '371421',
      'p_code': '371400',
      'name': '陵城区'
    },
    {
      'area_id': '20838',
      'code': '371422',
      'p_code': '371400',
      'name': '宁津县'
    },
    {
      'area_id': '20851',
      'code': '371423',
      'p_code': '371400',
      'name': '庆云县'
    },
    {
      'area_id': '20861',
      'code': '371424',
      'p_code': '371400',
      'name': '临邑县'
    },
    {
      'area_id': '20874',
      'code': '371425',
      'p_code': '371400',
      'name': '齐河县'
    },
    {
      'area_id': '20890',
      'code': '371426',
      'p_code': '371400',
      'name': '平原县'
    },
    {
      'area_id': '20903',
      'code': '371427',
      'p_code': '371400',
      'name': '夏津县'
    },
    {
      'area_id': '20918',
      'code': '371428',
      'p_code': '371400',
      'name': '武城县'
    },
    {
      'area_id': '20927',
      'code': '371481',
      'p_code': '371400',
      'name': '乐陵市'
    },
    {
      'area_id': '20944',
      'code': '371482',
      'p_code': '371400',
      'name': '禹城市'
    }
    ]
  },
  {
    'area_id': '20956',
    'code': '371500',
    'p_code': '370000',
    'name': '聊城市',
    'children': [{
      'area_id': '20957',
      'code': '371502',
      'p_code': '371500',
      'name': '东昌府区'
    },
    {
      'area_id': '20982',
      'code': '371521',
      'p_code': '371500',
      'name': '阳谷县'
    },
    {
      'area_id': '21001',
      'code': '371522',
      'p_code': '371500',
      'name': '莘县'
    },
    {
      'area_id': '21026',
      'code': '371523',
      'p_code': '371500',
      'name': '茌平县'
    },
    {
      'area_id': '21041',
      'code': '371524',
      'p_code': '371500',
      'name': '东阿县'
    },
    {
      'area_id': '21052',
      'code': '371525',
      'p_code': '371500',
      'name': '冠县'
    },
    {
      'area_id': '21071',
      'code': '371526',
      'p_code': '371500',
      'name': '高唐县'
    },
    {
      'area_id': '21084',
      'code': '371581',
      'p_code': '371500',
      'name': '临清市'
    }
    ]
  },
  {
    'area_id': '21101',
    'code': '371600',
    'p_code': '370000',
    'name': '滨州市',
    'children': [{
      'area_id': '21102',
      'code': '371602',
      'p_code': '371600',
      'name': '滨城区'
    },
    {
      'area_id': '21118',
      'code': '371621',
      'p_code': '371600',
      'name': '惠民县'
    },
    {
      'area_id': '21134',
      'code': '371622',
      'p_code': '371600',
      'name': '阳信县'
    },
    {
      'area_id': '21145',
      'code': '371623',
      'p_code': '371600',
      'name': '无棣县'
    },
    {
      'area_id': '21158',
      'code': '371624',
      'p_code': '371600',
      'name': '沾化区'
    },
    {
      'area_id': '21171',
      'code': '371625',
      'p_code': '371600',
      'name': '博兴县'
    },
    {
      'area_id': '21184',
      'code': '371626',
      'p_code': '371600',
      'name': '邹平县'
    }
    ]
  },
  {
    'area_id': '21201',
    'code': '371700',
    'p_code': '370000',
    'name': '菏泽市',
    'children': [{
      'area_id': '21202',
      'code': '371702',
      'p_code': '371700',
      'name': '牡丹区'
    },
    {
      'area_id': '21227',
      'code': '371721',
      'p_code': '371700',
      'name': '曹县'
    },
    {
      'area_id': '21255',
      'code': '371722',
      'p_code': '371700',
      'name': '单县'
    },
    {
      'area_id': '21278',
      'code': '371723',
      'p_code': '371700',
      'name': '成武县'
    },
    {
      'area_id': '21292',
      'code': '371724',
      'p_code': '371700',
      'name': '巨野县'
    },
    {
      'area_id': '21310',
      'code': '371725',
      'p_code': '371700',
      'name': '郓城县'
    },
    {
      'area_id': '21333',
      'code': '371726',
      'p_code': '371700',
      'name': '鄄城县'
    },
    {
      'area_id': '21351',
      'code': '371727',
      'p_code': '371700',
      'name': '定陶区'
    },
    {
      'area_id': '21364',
      'code': '371728',
      'p_code': '371700',
      'name': '东明县'
    }
    ]
  }
  ]
},
{
  'area_id': '21379',
  'code': '410000',
  'p_code': '0',
  'name': '河南省',
  'children': [{
    'area_id': '21380',
    'code': '410100',
    'p_code': '410000',
    'name': '郑州市',
    'children': [{
      'area_id': '21381',
      'code': '410102',
      'p_code': '410100',
      'name': '中原区'
    },
    {
      'area_id': '21399',
      'code': '410103',
      'p_code': '410100',
      'name': '二七区'
    },
    {
      'area_id': '21415',
      'code': '410104',
      'p_code': '410100',
      'name': '管城回族区'
    },
    {
      'area_id': '21432',
      'code': '410105',
      'p_code': '410100',
      'name': '金水区'
    },
    {
      'area_id': '21457',
      'code': '410106',
      'p_code': '410100',
      'name': '上街区'
    },
    {
      'area_id': '21464',
      'code': '410108',
      'p_code': '410100',
      'name': '惠济区'
    },
    {
      'area_id': '21473',
      'code': '410122',
      'p_code': '410100',
      'name': '中牟县'
    },
    {
      'area_id': '21498',
      'code': '410181',
      'p_code': '410100',
      'name': '巩义市'
    },
    {
      'area_id': '21519',
      'code': '410182',
      'p_code': '410100',
      'name': '荥阳市'
    },
    {
      'area_id': '21534',
      'code': '410183',
      'p_code': '410100',
      'name': '新密市'
    },
    {
      'area_id': '21554',
      'code': '410184',
      'p_code': '410100',
      'name': '新郑市'
    },
    {
      'area_id': '21575',
      'code': '410185',
      'p_code': '410100',
      'name': '登封市'
    }
    ]
  },
  {
    'area_id': '21593',
    'code': '410200',
    'p_code': '410000',
    'name': '开封市',
    'children': [{
      'area_id': '21594',
      'code': '410202',
      'p_code': '410200',
      'name': '龙亭区'
    },
    {
      'area_id': '21608',
      'code': '410203',
      'p_code': '410200',
      'name': '顺河回族区'
    },
    {
      'area_id': '21617',
      'code': '410204',
      'p_code': '410200',
      'name': '鼓楼区'
    },
    {
      'area_id': '21626',
      'code': '410205',
      'p_code': '410200',
      'name': '禹王台区'
    },
    {
      'area_id': '21634',
      'code': '410221',
      'p_code': '410200',
      'name': '杞县'
    },
    {
      'area_id': '21657',
      'code': '410222',
      'p_code': '410200',
      'name': '通许县'
    },
    {
      'area_id': '21670',
      'code': '410223',
      'p_code': '410200',
      'name': '尉氏县'
    },
    {
      'area_id': '21688',
      'code': '410224',
      'p_code': '410200',
      'name': '祥符区'
    },
    {
      'area_id': '21704',
      'code': '410225',
      'p_code': '410200',
      'name': '兰考县'
    }
    ]
  },
  {
    'area_id': '21728',
    'code': '410300',
    'p_code': '410000',
    'name': '洛阳市',
    'children': [{
      'area_id': '21729',
      'code': '410302',
      'p_code': '410300',
      'name': '老城区'
    },
    {
      'area_id': '21739',
      'code': '410303',
      'p_code': '410300',
      'name': '西工区'
    },
    {
      'area_id': '21749',
      'code': '410304',
      'p_code': '410300',
      'name': '瀍河回族区'
    },
    {
      'area_id': '21758',
      'code': '410305',
      'p_code': '410300',
      'name': '涧西区'
    },
    {
      'area_id': '21773',
      'code': '410306',
      'p_code': '410300',
      'name': '吉利区'
    },
    {
      'area_id': '21776',
      'code': '410307',
      'p_code': '410300',
      'name': '洛龙区'
    },
    {
      'area_id': '21794',
      'code': '410322',
      'p_code': '410300',
      'name': '孟津县'
    },
    {
      'area_id': '21805',
      'code': '410323',
      'p_code': '410300',
      'name': '新安县'
    },
    {
      'area_id': '21818',
      'code': '410324',
      'p_code': '410300',
      'name': '栾川县'
    },
    {
      'area_id': '21833',
      'code': '410325',
      'p_code': '410300',
      'name': '嵩县'
    },
    {
      'area_id': '21853',
      'code': '410326',
      'p_code': '410300',
      'name': '汝阳县'
    },
    {
      'area_id': '21868',
      'code': '410327',
      'p_code': '410300',
      'name': '宜阳县'
    },
    {
      'area_id': '21885',
      'code': '410328',
      'p_code': '410300',
      'name': '洛宁县'
    },
    {
      'area_id': '21904',
      'code': '410329',
      'p_code': '410300',
      'name': '伊川县'
    },
    {
      'area_id': '21919',
      'code': '410381',
      'p_code': '410300',
      'name': '偃师市'
    }
    ]
  },
  {
    'area_id': '21933',
    'code': '410400',
    'p_code': '410000',
    'name': '平顶山市',
    'children': [{
      'area_id': '21934',
      'code': '410402',
      'p_code': '410400',
      'name': '新华区'
    },
    {
      'area_id': '21950',
      'code': '410403',
      'p_code': '410400',
      'name': '卫东区'
    },
    {
      'area_id': '21963',
      'code': '410404',
      'p_code': '410400',
      'name': '石龙区'
    },
    {
      'area_id': '21968',
      'code': '410411',
      'p_code': '410400',
      'name': '湛河区'
    },
    {
      'area_id': '21977',
      'code': '410421',
      'p_code': '410400',
      'name': '宝丰县'
    },
    {
      'area_id': '21991',
      'code': '410422',
      'p_code': '410400',
      'name': '叶县'
    },
    {
      'area_id': '22010',
      'code': '410423',
      'p_code': '410400',
      'name': '鲁山县'
    },
    {
      'area_id': '22035',
      'code': '410425',
      'p_code': '410400',
      'name': '郏县'
    },
    {
      'area_id': '22051',
      'code': '410481',
      'p_code': '410400',
      'name': '舞钢市'
    },
    {
      'area_id': '22065',
      'code': '410482',
      'p_code': '410400',
      'name': '汝州市'
    }
    ]
  },
  {
    'area_id': '22086',
    'code': '410500',
    'p_code': '410000',
    'name': '安阳市',
    'children': [{
      'area_id': '22087',
      'code': '410502',
      'p_code': '410500',
      'name': '文峰区'
    },
    {
      'area_id': '22107',
      'code': '410503',
      'p_code': '410500',
      'name': '北关区'
    },
    {
      'area_id': '22117',
      'code': '410505',
      'p_code': '410500',
      'name': '殷都区'
    },
    {
      'area_id': '22128',
      'code': '410506',
      'p_code': '410500',
      'name': '龙安区'
    },
    {
      'area_id': '22138',
      'code': '410522',
      'p_code': '410500',
      'name': '安阳县'
    },
    {
      'area_id': '22160',
      'code': '410523',
      'p_code': '410500',
      'name': '汤阴县'
    },
    {
      'area_id': '22171',
      'code': '410526',
      'p_code': '410500',
      'name': '滑县'
    },
    {
      'area_id': '22195',
      'code': '410527',
      'p_code': '410500',
      'name': '内黄县'
    },
    {
      'area_id': '22213',
      'code': '410581',
      'p_code': '410500',
      'name': '林州市'
    }
    ]
  },
  {
    'area_id': '22234',
    'code': '410600',
    'p_code': '410000',
    'name': '鹤壁市',
    'children': [{
      'area_id': '22235',
      'code': '410602',
      'p_code': '410600',
      'name': '鹤山区'
    },
    {
      'area_id': '22243',
      'code': '410603',
      'p_code': '410600',
      'name': '山城区'
    },
    {
      'area_id': '22252',
      'code': '410611',
      'p_code': '410600',
      'name': '淇滨区'
    },
    {
      'area_id': '22264',
      'code': '410621',
      'p_code': '410600',
      'name': '浚县'
    },
    {
      'area_id': '22276',
      'code': '410622',
      'p_code': '410600',
      'name': '淇县'
    }
    ]
  },
  {
    'area_id': '22286',
    'code': '410700',
    'p_code': '410000',
    'name': '新乡市',
    'children': [{
      'area_id': '22287',
      'code': '410702',
      'p_code': '410700',
      'name': '红旗区'
    },
    {
      'area_id': '22298',
      'code': '410703',
      'p_code': '410700',
      'name': '卫滨区'
    },
    {
      'area_id': '22307',
      'code': '410704',
      'p_code': '410700',
      'name': '凤泉区'
    },
    {
      'area_id': '22313',
      'code': '410711',
      'p_code': '410700',
      'name': '牧野区'
    },
    {
      'area_id': '22324',
      'code': '410721',
      'p_code': '410700',
      'name': '新乡县'
    },
    {
      'area_id': '22333',
      'code': '410724',
      'p_code': '410700',
      'name': '获嘉县'
    },
    {
      'area_id': '22349',
      'code': '410725',
      'p_code': '410700',
      'name': '原阳县'
    },
    {
      'area_id': '22368',
      'code': '410726',
      'p_code': '410700',
      'name': '延津县'
    },
    {
      'area_id': '22385',
      'code': '410727',
      'p_code': '410700',
      'name': '封丘县'
    },
    {
      'area_id': '22405',
      'code': '410728',
      'p_code': '410700',
      'name': '长垣县'
    },
    {
      'area_id': '22425',
      'code': '410781',
      'p_code': '410700',
      'name': '卫辉市'
    },
    {
      'area_id': '22444',
      'code': '410782',
      'p_code': '410700',
      'name': '辉县市'
    }
    ]
  },
  {
    'area_id': '22467',
    'code': '410800',
    'p_code': '410000',
    'name': '焦作市',
    'children': [{
      'area_id': '22468',
      'code': '410802',
      'p_code': '410800',
      'name': '解放区'
    },
    {
      'area_id': '22478',
      'code': '410803',
      'p_code': '410800',
      'name': '中站区'
    },
    {
      'area_id': '22489',
      'code': '410804',
      'p_code': '410800',
      'name': '马村区'
    },
    {
      'area_id': '22497',
      'code': '410811',
      'p_code': '410800',
      'name': '山阳区'
    },
    {
      'area_id': '22513',
      'code': '410821',
      'p_code': '410800',
      'name': '修武县'
    },
    {
      'area_id': '22523',
      'code': '410822',
      'p_code': '410800',
      'name': '博爱县'
    },
    {
      'area_id': '22533',
      'code': '410823',
      'p_code': '410800',
      'name': '武陟县'
    },
    {
      'area_id': '22550',
      'code': '410825',
      'p_code': '410800',
      'name': '温县'
    },
    {
      'area_id': '22562',
      'code': '410882',
      'p_code': '410800',
      'name': '沁阳市'
    },
    {
      'area_id': '22576',
      'code': '410883',
      'p_code': '410800',
      'name': '孟州市'
    }
    ]
  },
  {
    'area_id': '22588',
    'code': '410881',
    'p_code': '410000',
    'name': '济源市'
  },
  {
    'area_id': '22605',
    'code': '410900',
    'p_code': '410000',
    'name': '濮阳市',
    'children': [{
      'area_id': '22606',
      'code': '410902',
      'p_code': '410900',
      'name': '华龙区'
    },
    {
      'area_id': '22626',
      'code': '410922',
      'p_code': '410900',
      'name': '清丰县'
    },
    {
      'area_id': '22644',
      'code': '410923',
      'p_code': '410900',
      'name': '南乐县'
    },
    {
      'area_id': '22657',
      'code': '410926',
      'p_code': '410900',
      'name': '范县'
    },
    {
      'area_id': '22670',
      'code': '410927',
      'p_code': '410900',
      'name': '台前县'
    },
    {
      'area_id': '22680',
      'code': '410928',
      'p_code': '410900',
      'name': '濮阳县'
    }
    ]
  },
  {
    'area_id': '22701',
    'code': '411000',
    'p_code': '410000',
    'name': '许昌市',
    'children': [{
      'area_id': '22702',
      'code': '411002',
      'p_code': '411000',
      'name': '魏都区'
    },
    {
      'area_id': '22717',
      'code': '411023',
      'p_code': '411000',
      'name': '许昌县'
    },
    {
      'area_id': '22734',
      'code': '411024',
      'p_code': '411000',
      'name': '鄢陵县'
    },
    {
      'area_id': '22747',
      'code': '411025',
      'p_code': '411000',
      'name': '襄城县'
    },
    {
      'area_id': '22764',
      'code': '411081',
      'p_code': '411000',
      'name': '禹州市'
    },
    {
      'area_id': '22791',
      'code': '411082',
      'p_code': '411000',
      'name': '长葛市'
    }
    ]
  },
  {
    'area_id': '22808',
    'code': '411100',
    'p_code': '410000',
    'name': '漯河市',
    'children': [{
      'area_id': '22809',
      'code': '411102',
      'p_code': '411100',
      'name': '源汇区'
    },
    {
      'area_id': '22818',
      'code': '411103',
      'p_code': '411100',
      'name': '郾城区'
    },
    {
      'area_id': '22828',
      'code': '411104',
      'p_code': '411100',
      'name': '召陵区'
    },
    {
      'area_id': '22838',
      'code': '411121',
      'p_code': '411100',
      'name': '舞阳县'
    },
    {
      'area_id': '22853',
      'code': '411122',
      'p_code': '411100',
      'name': '临颍县'
    }
    ]
  },
  {
    'area_id': '22869',
    'code': '411200',
    'p_code': '410000',
    'name': '三门峡市',
    'children': [{
      'area_id': '22870',
      'code': '411202',
      'p_code': '411200',
      'name': '湖滨区'
    },
    {
      'area_id': '22882',
      'code': '411221',
      'p_code': '411200',
      'name': '渑池县'
    },
    {
      'area_id': '22895',
      'code': '411222',
      'p_code': '411200',
      'name': '陕州区'
    },
    {
      'area_id': '22909',
      'code': '411224',
      'p_code': '411200',
      'name': '卢氏县'
    },
    {
      'area_id': '22929',
      'code': '411281',
      'p_code': '411200',
      'name': '义马市'
    },
    {
      'area_id': '22937',
      'code': '411282',
      'p_code': '411200',
      'name': '灵宝市'
    }
    ]
  },
  {
    'area_id': '22956',
    'code': '411300',
    'p_code': '410000',
    'name': '南阳市',
    'children': [{
      'area_id': '22957',
      'code': '411302',
      'p_code': '411300',
      'name': '宛城区'
    },
    {
      'area_id': '22976',
      'code': '411303',
      'p_code': '411300',
      'name': '卧龙区'
    },
    {
      'area_id': '22998',
      'code': '411321',
      'p_code': '411300',
      'name': '南召县'
    },
    {
      'area_id': '23020',
      'code': '411322',
      'p_code': '411300',
      'name': '方城县'
    },
    {
      'area_id': '23040',
      'code': '411323',
      'p_code': '411300',
      'name': '西峡县'
    },
    {
      'area_id': '23060',
      'code': '411324',
      'p_code': '411300',
      'name': '镇平县'
    },
    {
      'area_id': '23083',
      'code': '411325',
      'p_code': '411300',
      'name': '内乡县'
    },
    {
      'area_id': '23100',
      'code': '411326',
      'p_code': '411300',
      'name': '淅川县'
    },
    {
      'area_id': '23118',
      'code': '411327',
      'p_code': '411300',
      'name': '社旗县'
    },
    {
      'area_id': '23135',
      'code': '411328',
      'p_code': '411300',
      'name': '唐河县'
    },
    {
      'area_id': '23158',
      'code': '411329',
      'p_code': '411300',
      'name': '新野县'
    },
    {
      'area_id': '23174',
      'code': '411330',
      'p_code': '411300',
      'name': '桐柏县'
    },
    {
      'area_id': '23191',
      'code': '411381',
      'p_code': '411300',
      'name': '邓州市'
    }
    ]
  },
  {
    'area_id': '23221',
    'code': '411400',
    'p_code': '410000',
    'name': '商丘市',
    'children': [{
      'area_id': '23222',
      'code': '411402',
      'p_code': '411400',
      'name': '梁园区'
    },
    {
      'area_id': '23243',
      'code': '411403',
      'p_code': '411400',
      'name': '睢阳区'
    },
    {
      'area_id': '23263',
      'code': '411421',
      'p_code': '411400',
      'name': '民权县'
    },
    {
      'area_id': '23284',
      'code': '411422',
      'p_code': '411400',
      'name': '睢县'
    },
    {
      'area_id': '23305',
      'code': '411423',
      'p_code': '411400',
      'name': '宁陵县'
    },
    {
      'area_id': '23321',
      'code': '411424',
      'p_code': '411400',
      'name': '柘城县'
    },
    {
      'area_id': '23344',
      'code': '411425',
      'p_code': '411400',
      'name': '虞城县'
    },
    {
      'area_id': '23371',
      'code': '411426',
      'p_code': '411400',
      'name': '夏邑县'
    },
    {
      'area_id': '23396',
      'code': '411481',
      'p_code': '411400',
      'name': '永城市'
    }
    ]
  },
  {
    'area_id': '23426',
    'code': '411500',
    'p_code': '410000',
    'name': '信阳市',
    'children': [{
      'area_id': '23427',
      'code': '411502',
      'p_code': '411500',
      'name': '浉河区'
    },
    {
      'area_id': '23446',
      'code': '411503',
      'p_code': '411500',
      'name': '平桥区'
    },
    {
      'area_id': '23478',
      'code': '411521',
      'p_code': '411500',
      'name': '罗山县'
    },
    {
      'area_id': '23499',
      'code': '411522',
      'p_code': '411500',
      'name': '光山县'
    },
    {
      'area_id': '23519',
      'code': '411523',
      'p_code': '411500',
      'name': '新县'
    },
    {
      'area_id': '23535',
      'code': '411524',
      'p_code': '411500',
      'name': '商城县'
    },
    {
      'area_id': '23556',
      'code': '411525',
      'p_code': '411500',
      'name': '固始县'
    },
    {
      'area_id': '23590',
      'code': '411526',
      'p_code': '411500',
      'name': '潢川县'
    },
    {
      'area_id': '23614',
      'code': '411527',
      'p_code': '411500',
      'name': '淮滨县'
    },
    {
      'area_id': '23634',
      'code': '411528',
      'p_code': '411500',
      'name': '息县'
    }
    ]
  },
  {
    'area_id': '23657',
    'code': '411600',
    'p_code': '410000',
    'name': '周口市',
    'children': [{
      'area_id': '23658',
      'code': '411602',
      'p_code': '411600',
      'name': '川汇区'
    },
    {
      'area_id': '23673',
      'code': '411621',
      'p_code': '411600',
      'name': '扶沟县'
    },
    {
      'area_id': '23691',
      'code': '411622',
      'p_code': '411600',
      'name': '西华县'
    },
    {
      'area_id': '23715',
      'code': '411623',
      'p_code': '411600',
      'name': '商水县'
    },
    {
      'area_id': '23740',
      'code': '411624',
      'p_code': '411600',
      'name': '沈丘县'
    },
    {
      'area_id': '23763',
      'code': '411625',
      'p_code': '411600',
      'name': '郸城县'
    },
    {
      'area_id': '23786',
      'code': '411626',
      'p_code': '411600',
      'name': '淮阳县'
    },
    {
      'area_id': '23805',
      'code': '411627',
      'p_code': '411600',
      'name': '太康县'
    },
    {
      'area_id': '23829',
      'code': '411628',
      'p_code': '411600',
      'name': '鹿邑县'
    },
    {
      'area_id': '23854',
      'code': '411681',
      'p_code': '411600',
      'name': '项城市'
    }
    ]
  },
  {
    'area_id': '23876',
    'code': '411700',
    'p_code': '410000',
    'name': '驻马店市',
    'children': [{
      'area_id': '23877',
      'code': '411702',
      'p_code': '411700',
      'name': '驿城区'
    },
    {
      'area_id': '23903',
      'code': '411721',
      'p_code': '411700',
      'name': '西平县'
    },
    {
      'area_id': '23925',
      'code': '411722',
      'p_code': '411700',
      'name': '上蔡县'
    },
    {
      'area_id': '23952',
      'code': '411723',
      'p_code': '411700',
      'name': '平舆县'
    },
    {
      'area_id': '23972',
      'code': '411724',
      'p_code': '411700',
      'name': '正阳县'
    },
    {
      'area_id': '23992',
      'code': '411725',
      'p_code': '411700',
      'name': '确山县'
    },
    {
      'area_id': '24005',
      'code': '411726',
      'p_code': '411700',
      'name': '泌阳县'
    },
    {
      'area_id': '24030',
      'code': '411727',
      'p_code': '411700',
      'name': '汝南县'
    },
    {
      'area_id': '24048',
      'code': '411728',
      'p_code': '411700',
      'name': '遂平县'
    },
    {
      'area_id': '24066',
      'code': '411729',
      'p_code': '411700',
      'name': '新蔡县'
    }
    ]
  }
  ]
},
{
  'area_id': '24090',
  'code': '420000',
  'p_code': '0',
  'name': '湖北省',
  'children': [{
    'area_id': '24091',
    'code': '420100',
    'p_code': '420000',
    'name': '武汉市',
    'children': [{
      'area_id': '24092',
      'code': '420102',
      'p_code': '420100',
      'name': '江岸区'
    },
    {
      'area_id': '24110',
      'code': '420103',
      'p_code': '420100',
      'name': '江汉区'
    },
    {
      'area_id': '24125',
      'code': '420104',
      'p_code': '420100',
      'name': '硚口区'
    },
    {
      'area_id': '24137',
      'code': '420105',
      'p_code': '420100',
      'name': '汉阳区'
    },
    {
      'area_id': '24150',
      'code': '420106',
      'p_code': '420100',
      'name': '武昌区'
    },
    {
      'area_id': '24166',
      'code': '420107',
      'p_code': '420100',
      'name': '青山区'
    },
    {
      'area_id': '24184',
      'code': '420111',
      'p_code': '420100',
      'name': '洪山区'
    },
    {
      'area_id': '24202',
      'code': '420112',
      'p_code': '420100',
      'name': '东西湖区'
    },
    {
      'area_id': '24220',
      'code': '420113',
      'p_code': '420100',
      'name': '汉南区'
    },
    {
      'area_id': '24225',
      'code': '420114',
      'p_code': '420100',
      'name': '蔡甸区'
    },
    {
      'area_id': '24245',
      'code': '420115',
      'p_code': '420100',
      'name': '江夏区'
    },
    {
      'area_id': '24266',
      'code': '420116',
      'p_code': '420100',
      'name': '黄陂区'
    },
    {
      'area_id': '24287',
      'code': '420117',
      'p_code': '420100',
      'name': '新洲区'
    }
    ]
  },
  {
    'area_id': '24304',
    'code': '420200',
    'p_code': '420000',
    'name': '黄石市',
    'children': [{
      'area_id': '24305',
      'code': '420202',
      'p_code': '420200',
      'name': '黄石港区'
    },
    {
      'area_id': '24309',
      'code': '420203',
      'p_code': '420200',
      'name': '西塞山区'
    },
    {
      'area_id': '24313',
      'code': '420204',
      'p_code': '420200',
      'name': '下陆区'
    },
    {
      'area_id': '24318',
      'code': '420205',
      'p_code': '420200',
      'name': '铁山区'
    },
    {
      'area_id': '24320',
      'code': '420222',
      'p_code': '420200',
      'name': '阳新县'
    },
    {
      'area_id': '24343',
      'code': '420281',
      'p_code': '420200',
      'name': '大冶市'
    }
    ]
  },
  {
    'area_id': '24362',
    'code': '420300',
    'p_code': '420000',
    'name': '十堰市',
    'children': [{
      'area_id': '24363',
      'code': '420302',
      'p_code': '420300',
      'name': '茅箭区'
    },
    {
      'area_id': '24372',
      'code': '420303',
      'p_code': '420300',
      'name': '张湾区'
    },
    {
      'area_id': '24385',
      'code': '420321',
      'p_code': '420300',
      'name': '郧阳区'
    },
    {
      'area_id': '24406',
      'code': '420322',
      'p_code': '420300',
      'name': '郧西县'
    },
    {
      'area_id': '24426',
      'code': '420323',
      'p_code': '420300',
      'name': '竹山县'
    },
    {
      'area_id': '24444',
      'code': '420324',
      'p_code': '420300',
      'name': '竹溪县'
    },
    {
      'area_id': '24475',
      'code': '420325',
      'p_code': '420300',
      'name': '房县'
    },
    {
      'area_id': '24505',
      'code': '420381',
      'p_code': '420300',
      'name': '丹江口市'
    }
    ]
  },
  {
    'area_id': '24527',
    'code': '420500',
    'p_code': '420000',
    'name': '宜昌市',
    'children': [{
      'area_id': '24528',
      'code': '420502',
      'p_code': '420500',
      'name': '西陵区'
    },
    {
      'area_id': '24540',
      'code': '420503',
      'p_code': '420500',
      'name': '伍家岗区'
    },
    {
      'area_id': '24546',
      'code': '420504',
      'p_code': '420500',
      'name': '点军区'
    },
    {
      'area_id': '24552',
      'code': '420505',
      'p_code': '420500',
      'name': '猇亭区'
    },
    {
      'area_id': '24556',
      'code': '420506',
      'p_code': '420500',
      'name': '夷陵区'
    },
    {
      'area_id': '24571',
      'code': '420525',
      'p_code': '420500',
      'name': '远安县'
    },
    {
      'area_id': '24579',
      'code': '420526',
      'p_code': '420500',
      'name': '兴山县'
    },
    {
      'area_id': '24588',
      'code': '420527',
      'p_code': '420500',
      'name': '秭归县'
    },
    {
      'area_id': '24601',
      'code': '420528',
      'p_code': '420500',
      'name': '长阳土家族自治县'
    },
    {
      'area_id': '24613',
      'code': '420529',
      'p_code': '420500',
      'name': '五峰土家族自治县'
    },
    {
      'area_id': '24622',
      'code': '420581',
      'p_code': '420500',
      'name': '宜都市'
    },
    {
      'area_id': '24634',
      'code': '420582',
      'p_code': '420500',
      'name': '当阳市'
    },
    {
      'area_id': '24645',
      'code': '420583',
      'p_code': '420500',
      'name': '枝江市'
    }
    ]
  },
  {
    'area_id': '24655',
    'code': '420600',
    'p_code': '420000',
    'name': '襄阳市',
    'children': [{
      'area_id': '24656',
      'code': '420602',
      'p_code': '420600',
      'name': '襄城区'
    },
    {
      'area_id': '24666',
      'code': '420606',
      'p_code': '420600',
      'name': '樊城区'
    },
    {
      'area_id': '24687',
      'code': '420607',
      'p_code': '420600',
      'name': '襄州区'
    },
    {
      'area_id': '24705',
      'code': '420624',
      'p_code': '420600',
      'name': '南漳县'
    },
    {
      'area_id': '24717',
      'code': '420625',
      'p_code': '420600',
      'name': '谷城县'
    },
    {
      'area_id': '24729',
      'code': '420626',
      'p_code': '420600',
      'name': '保康县'
    },
    {
      'area_id': '24742',
      'code': '420682',
      'p_code': '420600',
      'name': '老河口市'
    },
    {
      'area_id': '24757',
      'code': '420683',
      'p_code': '420600',
      'name': '枣阳市'
    },
    {
      'area_id': '24776',
      'code': '420684',
      'p_code': '420600',
      'name': '宜城市'
    }
    ]
  },
  {
    'area_id': '24791',
    'code': '420700',
    'p_code': '420000',
    'name': '鄂州市',
    'children': [{
      'area_id': '24792',
      'code': '420702',
      'p_code': '420700',
      'name': '梁子湖区'
    },
    {
      'area_id': '24799',
      'code': '420703',
      'p_code': '420700',
      'name': '华容区'
    },
    {
      'area_id': '24807',
      'code': '420704',
      'p_code': '420700',
      'name': '鄂城区'
    }
    ]
  },
  {
    'area_id': '24822',
    'code': '420800',
    'p_code': '420000',
    'name': '荆门市',
    'children': [{
      'area_id': '24823',
      'code': '420802',
      'p_code': '420800',
      'name': '东宝区'
    },
    {
      'area_id': '24834',
      'code': '420804',
      'p_code': '420800',
      'name': '掇刀区'
    },
    {
      'area_id': '24842',
      'code': '420821',
      'p_code': '420800',
      'name': '京山县'
    },
    {
      'area_id': '24866',
      'code': '420822',
      'p_code': '420800',
      'name': '沙洋县'
    },
    {
      'area_id': '24881',
      'code': '420881',
      'p_code': '420800',
      'name': '钟祥市'
    }
    ]
  },
  {
    'area_id': '24912',
    'code': '420900',
    'p_code': '420000',
    'name': '孝感市',
    'children': [{
      'area_id': '24913',
      'code': '420902',
      'p_code': '420900',
      'name': '孝南区'
    },
    {
      'area_id': '24935',
      'code': '420921',
      'p_code': '420900',
      'name': '孝昌县'
    },
    {
      'area_id': '24951',
      'code': '420922',
      'p_code': '420900',
      'name': '大悟县'
    },
    {
      'area_id': '24969',
      'code': '420923',
      'p_code': '420900',
      'name': '云梦县'
    },
    {
      'area_id': '24983',
      'code': '420981',
      'p_code': '420900',
      'name': '应城市'
    },
    {
      'area_id': '25001',
      'code': '420982',
      'p_code': '420900',
      'name': '安陆市'
    },
    {
      'area_id': '25018',
      'code': '420984',
      'p_code': '420900',
      'name': '汉川市'
    }
    ]
  },
  {
    'area_id': '25046',
    'code': '421000',
    'p_code': '420000',
    'name': '荆州市',
    'children': [{
      'area_id': '25047',
      'code': '421002',
      'p_code': '421000',
      'name': '沙市区'
    },
    {
      'area_id': '25061',
      'code': '421003',
      'p_code': '421000',
      'name': '荆州区'
    },
    {
      'area_id': '25074',
      'code': '421022',
      'p_code': '421000',
      'name': '公安县'
    },
    {
      'area_id': '25091',
      'code': '421023',
      'p_code': '421000',
      'name': '监利县'
    },
    {
      'area_id': '25115',
      'code': '421024',
      'p_code': '421000',
      'name': '江陵县'
    },
    {
      'area_id': '25129',
      'code': '421081',
      'p_code': '421000',
      'name': '石首市'
    },
    {
      'area_id': '25145',
      'code': '421083',
      'p_code': '421000',
      'name': '洪湖市'
    },
    {
      'area_id': '25166',
      'code': '421087',
      'p_code': '421000',
      'name': '松滋市'
    }
    ]
  },
  {
    'area_id': '25183',
    'code': '421100',
    'p_code': '420000',
    'name': '黄冈市',
    'children': [{
      'area_id': '25184',
      'code': '421102',
      'p_code': '421100',
      'name': '黄州区'
    },
    {
      'area_id': '25195',
      'code': '421121',
      'p_code': '421100',
      'name': '团风县'
    },
    {
      'area_id': '25208',
      'code': '421122',
      'p_code': '421100',
      'name': '红安县'
    },
    {
      'area_id': '25222',
      'code': '421123',
      'p_code': '421100',
      'name': '罗田县'
    },
    {
      'area_id': '25240',
      'code': '421124',
      'p_code': '421100',
      'name': '英山县'
    },
    {
      'area_id': '25256',
      'code': '421125',
      'p_code': '421100',
      'name': '浠水县'
    },
    {
      'area_id': '25273',
      'code': '421126',
      'p_code': '421100',
      'name': '蕲春县'
    },
    {
      'area_id': '25290',
      'code': '421127',
      'p_code': '421100',
      'name': '黄梅县'
    },
    {
      'area_id': '25318',
      'code': '421181',
      'p_code': '421100',
      'name': '麻城市'
    },
    {
      'area_id': '25348',
      'code': '421182',
      'p_code': '421100',
      'name': '武穴市'
    }
    ]
  },
  {
    'area_id': '25361',
    'code': '421200',
    'p_code': '420000',
    'name': '咸宁市',
    'children': [{
      'area_id': '25362',
      'code': '421202',
      'p_code': '421200',
      'name': '咸安区'
    },
    {
      'area_id': '25379',
      'code': '421221',
      'p_code': '421200',
      'name': '嘉鱼县'
    },
    {
      'area_id': '25390',
      'code': '421222',
      'p_code': '421200',
      'name': '通城县'
    },
    {
      'area_id': '25407',
      'code': '421223',
      'p_code': '421200',
      'name': '崇阳县'
    },
    {
      'area_id': '25421',
      'code': '421224',
      'p_code': '421200',
      'name': '通山县'
    },
    {
      'area_id': '25436',
      'code': '421281',
      'p_code': '421200',
      'name': '赤壁市'
    }
    ]
  },
  {
    'area_id': '25456',
    'code': '421300',
    'p_code': '420000',
    'name': '随州市',
    'children': [{
      'area_id': '25457',
      'code': '421302',
      'p_code': '421300',
      'name': '曾都区'
    },
    {
      'area_id': '25470',
      'code': '421321',
      'p_code': '421300',
      'name': '随县'
    },
    {
      'area_id': '25490',
      'code': '421381',
      'p_code': '421300',
      'name': '广水市'
    }
    ]
  },
  {
    'area_id': '25510',
    'code': '422800',
    'p_code': '420000',
    'name': '恩施土家族苗族自治州',
    'children': [{
      'area_id': '25511',
      'code': '422801',
      'p_code': '422800',
      'name': '恩施市'
    },
    {
      'area_id': '25529',
      'code': '422802',
      'p_code': '422800',
      'name': '利川市'
    },
    {
      'area_id': '25545',
      'code': '422822',
      'p_code': '422800',
      'name': '建始县'
    },
    {
      'area_id': '25556',
      'code': '422823',
      'p_code': '422800',
      'name': '巴东县'
    },
    {
      'area_id': '25569',
      'code': '422825',
      'p_code': '422800',
      'name': '宣恩县'
    },
    {
      'area_id': '25579',
      'code': '422826',
      'p_code': '422800',
      'name': '咸丰县'
    },
    {
      'area_id': '25591',
      'code': '422827',
      'p_code': '422800',
      'name': '来凤县'
    },
    {
      'area_id': '25600',
      'code': '422828',
      'p_code': '422800',
      'name': '鹤峰县'
    }
    ]
  },
  {
    'area_id': '25610',
    'code': '429004',
    'p_code': '420000',
    'name': '仙桃市'
  },
  {
    'area_id': '25636',
    'code': '429005',
    'p_code': '420000',
    'name': '潜江市'
  },
  {
    'area_id': '25662',
    'code': '429006',
    'p_code': '420000',
    'name': '天门市'
  },
  {
    'area_id': '25691',
    'code': '429021',
    'p_code': '420000',
    'name': '神农架林区'
  }
  ]
},
{
  'area_id': '25700',
  'code': '430000',
  'p_code': '0',
  'name': '湖南省',
  'children': [{
    'area_id': '25701',
    'code': '430100',
    'p_code': '430000',
    'name': '长沙市',
    'children': [{
      'area_id': '25702',
      'code': '430102',
      'p_code': '430100',
      'name': '芙蓉区'
    },
    {
      'area_id': '25717',
      'code': '430103',
      'p_code': '430100',
      'name': '天心区'
    },
    {
      'area_id': '25732',
      'code': '430104',
      'p_code': '430100',
      'name': '岳麓区'
    },
    {
      'area_id': '25752',
      'code': '430105',
      'p_code': '430100',
      'name': '开福区'
    },
    {
      'area_id': '25770',
      'code': '430111',
      'p_code': '430100',
      'name': '雨花区'
    },
    {
      'area_id': '25785',
      'code': '430121',
      'p_code': '430100',
      'name': '长沙县'
    },
    {
      'area_id': '25808',
      'code': '430122',
      'p_code': '430100',
      'name': '望城区'
    },
    {
      'area_id': '25830',
      'code': '430124',
      'p_code': '430100',
      'name': '宁乡县'
    },
    {
      'area_id': '25864',
      'code': '430181',
      'p_code': '430100',
      'name': '浏阳市'
    }
    ]
  },
  {
    'area_id': '25902',
    'code': '430200',
    'p_code': '430000',
    'name': '株洲市',
    'children': [{
      'area_id': '25903',
      'code': '430202',
      'p_code': '430200',
      'name': '荷塘区'
    },
    {
      'area_id': '25911',
      'code': '430203',
      'p_code': '430200',
      'name': '芦淞区'
    },
    {
      'area_id': '25922',
      'code': '430204',
      'p_code': '430200',
      'name': '石峰区'
    },
    {
      'area_id': '25931',
      'code': '430211',
      'p_code': '430200',
      'name': '天元区'
    },
    {
      'area_id': '25939',
      'code': '430221',
      'p_code': '430200',
      'name': '株洲县'
    },
    {
      'area_id': '25954',
      'code': '430223',
      'p_code': '430200',
      'name': '攸县'
    },
    {
      'area_id': '25977',
      'code': '430224',
      'p_code': '430200',
      'name': '茶陵县'
    },
    {
      'area_id': '26002',
      'code': '430225',
      'p_code': '430200',
      'name': '炎陵县'
    },
    {
      'area_id': '26020',
      'code': '430281',
      'p_code': '430200',
      'name': '醴陵市'
    }
    ]
  },
  {
    'area_id': '26056',
    'code': '430300',
    'p_code': '430000',
    'name': '湘潭市',
    'children': [{
      'area_id': '26057',
      'code': '430302',
      'p_code': '430300',
      'name': '雨湖区'
    },
    {
      'area_id': '26076',
      'code': '430304',
      'p_code': '430300',
      'name': '岳塘区'
    },
    {
      'area_id': '26094',
      'code': '430321',
      'p_code': '430300',
      'name': '湘潭县'
    },
    {
      'area_id': '26114',
      'code': '430381',
      'p_code': '430300',
      'name': '湘乡市'
    },
    {
      'area_id': '26137',
      'code': '430382',
      'p_code': '430300',
      'name': '韶山市'
    }
    ]
  },
  {
    'area_id': '26145',
    'code': '430400',
    'p_code': '430000',
    'name': '衡阳市',
    'children': [{
      'area_id': '26146',
      'code': '430405',
      'p_code': '430400',
      'name': '珠晖区'
    },
    {
      'area_id': '26162',
      'code': '430406',
      'p_code': '430400',
      'name': '雁峰区'
    },
    {
      'area_id': '26171',
      'code': '430407',
      'p_code': '430400',
      'name': '石鼓区'
    },
    {
      'area_id': '26181',
      'code': '430408',
      'p_code': '430400',
      'name': '蒸湘区'
    },
    {
      'area_id': '26189',
      'code': '430412',
      'p_code': '430400',
      'name': '南岳区'
    },
    {
      'area_id': '26195',
      'code': '430421',
      'p_code': '430400',
      'name': '衡阳县'
    },
    {
      'area_id': '26222',
      'code': '430422',
      'p_code': '430400',
      'name': '衡南县'
    },
    {
      'area_id': '26252',
      'code': '430423',
      'p_code': '430400',
      'name': '衡山县'
    },
    {
      'area_id': '26270',
      'code': '430424',
      'p_code': '430400',
      'name': '衡东县'
    },
    {
      'area_id': '26296',
      'code': '430426',
      'p_code': '430400',
      'name': '祁东县'
    },
    {
      'area_id': '26320',
      'code': '430481',
      'p_code': '430400',
      'name': '耒阳市'
    },
    {
      'area_id': '26357',
      'code': '430482',
      'p_code': '430400',
      'name': '常宁市'
    }
    ]
  },
  {
    'area_id': '26385',
    'code': '430500',
    'p_code': '430000',
    'name': '邵阳市',
    'children': [{
      'area_id': '26386',
      'code': '430502',
      'p_code': '430500',
      'name': '双清区'
    },
    {
      'area_id': '26399',
      'code': '430503',
      'p_code': '430500',
      'name': '大祥区'
    },
    {
      'area_id': '26414',
      'code': '430511',
      'p_code': '430500',
      'name': '北塔区'
    },
    {
      'area_id': '26421',
      'code': '430521',
      'p_code': '430500',
      'name': '邵东县'
    },
    {
      'area_id': '26450',
      'code': '430522',
      'p_code': '430500',
      'name': '新邵县'
    },
    {
      'area_id': '26466',
      'code': '430523',
      'p_code': '430500',
      'name': '邵阳县'
    },
    {
      'area_id': '26492',
      'code': '430524',
      'p_code': '430500',
      'name': '隆回县'
    },
    {
      'area_id': '26519',
      'code': '430525',
      'p_code': '430500',
      'name': '洞口县'
    },
    {
      'area_id': '26543',
      'code': '430527',
      'p_code': '430500',
      'name': '绥宁县'
    },
    {
      'area_id': '26569',
      'code': '430528',
      'p_code': '430500',
      'name': '新宁县'
    },
    {
      'area_id': '26588',
      'code': '430529',
      'p_code': '430500',
      'name': '城步苗族自治县'
    },
    {
      'area_id': '26601',
      'code': '430581',
      'p_code': '430500',
      'name': '武冈市'
    }
    ]
  },
  {
    'area_id': '26623',
    'code': '430600',
    'p_code': '430000',
    'name': '岳阳市',
    'children': [{
      'area_id': '26624',
      'code': '430602',
      'p_code': '430600',
      'name': '岳阳楼区'
    },
    {
      'area_id': '26649',
      'code': '430603',
      'p_code': '430600',
      'name': '云溪区'
    },
    {
      'area_id': '26659',
      'code': '430611',
      'p_code': '430600',
      'name': '君山区'
    },
    {
      'area_id': '26667',
      'code': '430621',
      'p_code': '430600',
      'name': '岳阳县'
    },
    {
      'area_id': '26689',
      'code': '430623',
      'p_code': '430600',
      'name': '华容县'
    },
    {
      'area_id': '26710',
      'code': '430624',
      'p_code': '430600',
      'name': '湘阴县'
    },
    {
      'area_id': '26730',
      'code': '430626',
      'p_code': '430600',
      'name': '平江县'
    },
    {
      'area_id': '26758',
      'code': '430681',
      'p_code': '430600',
      'name': '汨罗市'
    },
    {
      'area_id': '26797',
      'code': '430682',
      'p_code': '430600',
      'name': '临湘市'
    }
    ]
  },
  {
    'area_id': '26818',
    'code': '430700',
    'p_code': '430000',
    'name': '常德市',
    'children': [{
      'area_id': '26819',
      'code': '430702',
      'p_code': '430700',
      'name': '武陵区'
    },
    {
      'area_id': '26838',
      'code': '430703',
      'p_code': '430700',
      'name': '鼎城区'
    },
    {
      'area_id': '26876',
      'code': '430721',
      'p_code': '430700',
      'name': '安乡县'
    },
    {
      'area_id': '26896',
      'code': '430722',
      'p_code': '430700',
      'name': '汉寿县'
    },
    {
      'area_id': '26929',
      'code': '430723',
      'p_code': '430700',
      'name': '澧县'
    },
    {
      'area_id': '26962',
      'code': '430724',
      'p_code': '430700',
      'name': '临澧县'
    },
    {
      'area_id': '26980',
      'code': '430725',
      'p_code': '430700',
      'name': '桃源县'
    },
    {
      'area_id': '27021',
      'code': '430726',
      'p_code': '430700',
      'name': '石门县'
    },
    {
      'area_id': '27047',
      'code': '430781',
      'p_code': '430700',
      'name': '津市市'
    }
    ]
  },
  {
    'area_id': '27060',
    'code': '430800',
    'p_code': '430000',
    'name': '张家界市',
    'children': [{
      'area_id': '27061',
      'code': '430802',
      'p_code': '430800',
      'name': '永定区'
    },
    {
      'area_id': '27093',
      'code': '430811',
      'p_code': '430800',
      'name': '武陵源区'
    },
    {
      'area_id': '27100',
      'code': '430821',
      'p_code': '430800',
      'name': '慈利县'
    },
    {
      'area_id': '27132',
      'code': '430822',
      'p_code': '430800',
      'name': '桑植县'
    }
    ]
  },
  {
    'area_id': '27172',
    'code': '430900',
    'p_code': '430000',
    'name': '益阳市',
    'children': [{
      'area_id': '27173',
      'code': '430902',
      'p_code': '430900',
      'name': '资阳区'
    },
    {
      'area_id': '27183',
      'code': '430903',
      'p_code': '430900',
      'name': '赫山区'
    },
    {
      'area_id': '27203',
      'code': '430921',
      'p_code': '430900',
      'name': '南县'
    },
    {
      'area_id': '27222',
      'code': '430922',
      'p_code': '430900',
      'name': '桃江县'
    },
    {
      'area_id': '27239',
      'code': '430923',
      'p_code': '430900',
      'name': '安化县'
    },
    {
      'area_id': '27263',
      'code': '430981',
      'p_code': '430900',
      'name': '沅江市'
    }
    ]
  },
  {
    'area_id': '27281',
    'code': '431000',
    'p_code': '430000',
    'name': '郴州市',
    'children': [{
      'area_id': '27282',
      'code': '431002',
      'p_code': '431000',
      'name': '北湖区'
    },
    {
      'area_id': '27299',
      'code': '431003',
      'p_code': '431000',
      'name': '苏仙区'
    },
    {
      'area_id': '27317',
      'code': '431021',
      'p_code': '431000',
      'name': '桂阳县'
    },
    {
      'area_id': '27344',
      'code': '431022',
      'p_code': '431000',
      'name': '宜章县'
    },
    {
      'area_id': '27367',
      'code': '431023',
      'p_code': '431000',
      'name': '永兴县'
    },
    {
      'area_id': '27390',
      'code': '431024',
      'p_code': '431000',
      'name': '嘉禾县'
    },
    {
      'area_id': '27404',
      'code': '431025',
      'p_code': '431000',
      'name': '临武县'
    },
    {
      'area_id': '27423',
      'code': '431026',
      'p_code': '431000',
      'name': '汝城县'
    },
    {
      'area_id': '27444',
      'code': '431027',
      'p_code': '431000',
      'name': '桂东县'
    },
    {
      'area_id': '27461',
      'code': '431028',
      'p_code': '431000',
      'name': '安仁县'
    },
    {
      'area_id': '27479',
      'code': '431081',
      'p_code': '431000',
      'name': '资兴市'
    }
    ]
  },
  {
    'area_id': '27500',
    'code': '431100',
    'p_code': '430000',
    'name': '永州市',
    'children': [{
      'area_id': '27501',
      'code': '431102',
      'p_code': '431100',
      'name': '零陵区'
    },
    {
      'area_id': '27518',
      'code': '431103',
      'p_code': '431100',
      'name': '冷水滩区'
    },
    {
      'area_id': '27539',
      'code': '431121',
      'p_code': '431100',
      'name': '祁阳县'
    },
    {
      'area_id': '27575',
      'code': '431122',
      'p_code': '431100',
      'name': '东安县'
    },
    {
      'area_id': '27595',
      'code': '431123',
      'p_code': '431100',
      'name': '双牌县'
    },
    {
      'area_id': '27613',
      'code': '431124',
      'p_code': '431100',
      'name': '道县'
    },
    {
      'area_id': '27641',
      'code': '431125',
      'p_code': '431100',
      'name': '江永县'
    },
    {
      'area_id': '27654',
      'code': '431126',
      'p_code': '431100',
      'name': '宁远县'
    },
    {
      'area_id': '27674',
      'code': '431127',
      'p_code': '431100',
      'name': '蓝山县'
    },
    {
      'area_id': '27695',
      'code': '431128',
      'p_code': '431100',
      'name': '新田县'
    },
    {
      'area_id': '27715',
      'code': '431129',
      'p_code': '431100',
      'name': '江华瑶族自治县'
    }
    ]
  },
  {
    'area_id': '27741',
    'code': '431200',
    'p_code': '430000',
    'name': '怀化市',
    'children': [{
      'area_id': '27742',
      'code': '431202',
      'p_code': '431200',
      'name': '鹤城区'
    },
    {
      'area_id': '27758',
      'code': '431221',
      'p_code': '431200',
      'name': '中方县'
    },
    {
      'area_id': '27781',
      'code': '431222',
      'p_code': '431200',
      'name': '沅陵县'
    },
    {
      'area_id': '27805',
      'code': '431223',
      'p_code': '431200',
      'name': '辰溪县'
    },
    {
      'area_id': '27836',
      'code': '431224',
      'p_code': '431200',
      'name': '溆浦县'
    },
    {
      'area_id': '27880',
      'code': '431225',
      'p_code': '431200',
      'name': '会同县'
    },
    {
      'area_id': '27906',
      'code': '431226',
      'p_code': '431200',
      'name': '麻阳苗族自治县'
    },
    {
      'area_id': '27930',
      'code': '431227',
      'p_code': '431200',
      'name': '新晃侗族自治县'
    },
    {
      'area_id': '27954',
      'code': '431228',
      'p_code': '431200',
      'name': '芷江侗族自治县'
    },
    {
      'area_id': '27983',
      'code': '431229',
      'p_code': '431200',
      'name': '靖州苗族侗族自治县'
    },
    {
      'area_id': '27997',
      'code': '431230',
      'p_code': '431200',
      'name': '通道侗族自治县'
    },
    {
      'area_id': '28021',
      'code': '431281',
      'p_code': '431200',
      'name': '洪江市'
    }
    ]
  },
  {
    'area_id': '28054',
    'code': '431300',
    'p_code': '430000',
    'name': '娄底市',
    'children': [{
      'area_id': '28055',
      'code': '431302',
      'p_code': '431300',
      'name': '娄星区'
    },
    {
      'area_id': '28070',
      'code': '431321',
      'p_code': '431300',
      'name': '双峰县'
    },
    {
      'area_id': '28088',
      'code': '431322',
      'p_code': '431300',
      'name': '新化县'
    },
    {
      'area_id': '28118',
      'code': '431381',
      'p_code': '431300',
      'name': '冷水江市'
    },
    {
      'area_id': '28135',
      'code': '431382',
      'p_code': '431300',
      'name': '涟源市'
    }
    ]
  },
  {
    'area_id': '28156',
    'code': '433100',
    'p_code': '430000',
    'name': '湘西土家族苗族自治州',
    'children': [{
      'area_id': '28157',
      'code': '433101',
      'p_code': '433100',
      'name': '吉首市'
    },
    {
      'area_id': '28174',
      'code': '433122',
      'p_code': '433100',
      'name': '泸溪县'
    },
    {
      'area_id': '28191',
      'code': '433123',
      'p_code': '433100',
      'name': '凤凰县'
    },
    {
      'area_id': '28216',
      'code': '433124',
      'p_code': '433100',
      'name': '花垣县'
    },
    {
      'area_id': '28235',
      'code': '433125',
      'p_code': '433100',
      'name': '保靖县'
    },
    {
      'area_id': '28256',
      'code': '433126',
      'p_code': '433100',
      'name': '古丈县'
    },
    {
      'area_id': '28269',
      'code': '433127',
      'p_code': '433100',
      'name': '永顺县'
    },
    {
      'area_id': '28300',
      'code': '433130',
      'p_code': '433100',
      'name': '龙山县'
    }
    ]
  }
  ]
},
{
  'area_id': '28335',
  'code': '440000',
  'p_code': '0',
  'name': '广东省',
  'children': [{
    'area_id': '28336',
    'code': '440100',
    'p_code': '440000',
    'name': '广州市',
    'children': [{
      'area_id': '28337',
      'code': '440103',
      'p_code': '440100',
      'name': '荔湾区'
    },
    {
      'area_id': '28360',
      'code': '440104',
      'p_code': '440100',
      'name': '越秀区'
    },
    {
      'area_id': '28379',
      'code': '440105',
      'p_code': '440100',
      'name': '海珠区'
    },
    {
      'area_id': '28398',
      'code': '440106',
      'p_code': '440100',
      'name': '天河区'
    },
    {
      'area_id': '28420',
      'code': '440111',
      'p_code': '440100',
      'name': '白云区'
    },
    {
      'area_id': '28439',
      'code': '440112',
      'p_code': '440100',
      'name': '黄埔区'
    },
    {
      'area_id': '28455',
      'code': '440113',
      'p_code': '440100',
      'name': '番禺区'
    },
    {
      'area_id': '28472',
      'code': '440114',
      'p_code': '440100',
      'name': '花都区'
    },
    {
      'area_id': '28481',
      'code': '440115',
      'p_code': '440100',
      'name': '南沙区'
    },
    {
      'area_id': '28491',
      'code': '440183',
      'p_code': '440100',
      'name': '增城区'
    },
    {
      'area_id': '28503',
      'code': '440184',
      'p_code': '440100',
      'name': '从化区'
    }
    ]
  },
  {
    'area_id': '28515',
    'code': '440200',
    'p_code': '440000',
    'name': '韶关市',
    'children': [{
      'area_id': '28516',
      'code': '440203',
      'p_code': '440200',
      'name': '武江区'
    },
    {
      'area_id': '28524',
      'code': '440204',
      'p_code': '440200',
      'name': '浈江区'
    },
    {
      'area_id': '28536',
      'code': '440205',
      'p_code': '440200',
      'name': '曲江区'
    },
    {
      'area_id': '28550',
      'code': '440222',
      'p_code': '440200',
      'name': '始兴县'
    },
    {
      'area_id': '28561',
      'code': '440224',
      'p_code': '440200',
      'name': '仁化县'
    },
    {
      'area_id': '28573',
      'code': '440229',
      'p_code': '440200',
      'name': '翁源县'
    },
    {
      'area_id': '28582',
      'code': '440232',
      'p_code': '440200',
      'name': '乳源瑶族自治县'
    },
    {
      'area_id': '28594',
      'code': '440233',
      'p_code': '440200',
      'name': '新丰县'
    },
    {
      'area_id': '28602',
      'code': '440281',
      'p_code': '440200',
      'name': '乐昌市'
    },
    {
      'area_id': '28622',
      'code': '440282',
      'p_code': '440200',
      'name': '南雄市'
    }
    ]
  },
  {
    'area_id': '28642',
    'code': '440300',
    'p_code': '440000',
    'name': '深圳市',
    'children': [{
      'area_id': '28643',
      'code': '440303',
      'p_code': '440300',
      'name': '罗湖区'
    },
    {
      'area_id': '28654',
      'code': '440304',
      'p_code': '440300',
      'name': '福田区'
    },
    {
      'area_id': '28666',
      'code': '440305',
      'p_code': '440300',
      'name': '南山区'
    },
    {
      'area_id': '28675',
      'code': '440306',
      'p_code': '440300',
      'name': '宝安区'
    },
    {
      'area_id': '28689',
      'code': '440307',
      'p_code': '440300',
      'name': '龙岗区'
    },
    {
      'area_id': '28704',
      'code': '440308',
      'p_code': '440300',
      'name': '盐田区'
    },
    {
      'area_id': '47775',
      'code': '440310',
      'p_code': '440300',
      'name': '坪山区'
    },
    {
      'area_id': '47776',
      'code': '440311',
      'p_code': '440300',
      'name': '龙华区'
    }
    ]
  },
  {
    'area_id': '28711',
    'code': '440400',
    'p_code': '440000',
    'name': '珠海市',
    'children': [{
      'area_id': '28712',
      'code': '440402',
      'p_code': '440400',
      'name': '香洲区'
    },
    {
      'area_id': '28733',
      'code': '440403',
      'p_code': '440400',
      'name': '斗门区'
    },
    {
      'area_id': '28740',
      'code': '440404',
      'p_code': '440400',
      'name': '金湾区'
    }
    ]
  },
  {
    'area_id': '28747',
    'code': '440500',
    'p_code': '440000',
    'name': '汕头市',
    'children': [{
      'area_id': '28748',
      'code': '440507',
      'p_code': '440500',
      'name': '龙湖区'
    },
    {
      'area_id': '28756',
      'code': '440511',
      'p_code': '440500',
      'name': '金平区'
    },
    {
      'area_id': '28774',
      'code': '440512',
      'p_code': '440500',
      'name': '濠江区'
    },
    {
      'area_id': '28782',
      'code': '440513',
      'p_code': '440500',
      'name': '潮阳区'
    },
    {
      'area_id': '28796',
      'code': '440514',
      'p_code': '440500',
      'name': '潮南区'
    },
    {
      'area_id': '28808',
      'code': '440515',
      'p_code': '440500',
      'name': '澄海区'
    },
    {
      'area_id': '28820',
      'code': '440523',
      'p_code': '440500',
      'name': '南澳县'
    }
    ]
  },
  {
    'area_id': '28824',
    'code': '440600',
    'p_code': '440000',
    'name': '佛山市',
    'children': [{
      'area_id': '28825',
      'code': '440604',
      'p_code': '440600',
      'name': '禅城区'
    },
    {
      'area_id': '28830',
      'code': '440605',
      'p_code': '440600',
      'name': '南海区'
    },
    {
      'area_id': '28838',
      'code': '440606',
      'p_code': '440600',
      'name': '顺德区'
    },
    {
      'area_id': '28849',
      'code': '440607',
      'p_code': '440600',
      'name': '三水区'
    },
    {
      'area_id': '28862',
      'code': '440608',
      'p_code': '440600',
      'name': '高明区'
    }
    ]
  },
  {
    'area_id': '28871',
    'code': '440700',
    'p_code': '440000',
    'name': '江门市',
    'children': [{
      'area_id': '28872',
      'code': '440703',
      'p_code': '440700',
      'name': '蓬江区'
    },
    {
      'area_id': '28882',
      'code': '440704',
      'p_code': '440700',
      'name': '江海区'
    },
    {
      'area_id': '28888',
      'code': '440705',
      'p_code': '440700',
      'name': '新会区'
    },
    {
      'area_id': '28903',
      'code': '440781',
      'p_code': '440700',
      'name': '台山市'
    },
    {
      'area_id': '28922',
      'code': '440783',
      'p_code': '440700',
      'name': '开平市'
    },
    {
      'area_id': '28939',
      'code': '440784',
      'p_code': '440700',
      'name': '鹤山市'
    },
    {
      'area_id': '28952',
      'code': '440785',
      'p_code': '440700',
      'name': '恩平市'
    }
    ]
  },
  {
    'area_id': '28964',
    'code': '440800',
    'p_code': '440000',
    'name': '湛江市',
    'children': [{
      'area_id': '28965',
      'code': '440802',
      'p_code': '440800',
      'name': '赤坎区'
    },
    {
      'area_id': '28974',
      'code': '440803',
      'p_code': '440800',
      'name': '霞山区'
    },
    {
      'area_id': '28987',
      'code': '440804',
      'p_code': '440800',
      'name': '坡头区'
    },
    {
      'area_id': '28997',
      'code': '440811',
      'p_code': '440800',
      'name': '麻章区'
    },
    {
      'area_id': '29006',
      'code': '440823',
      'p_code': '440800',
      'name': '遂溪县'
    },
    {
      'area_id': '29023',
      'code': '440825',
      'p_code': '440800',
      'name': '徐闻县'
    },
    {
      'area_id': '29044',
      'code': '440881',
      'p_code': '440800',
      'name': '廉江市'
    },
    {
      'area_id': '29067',
      'code': '440882',
      'p_code': '440800',
      'name': '雷州市'
    },
    {
      'area_id': '29095',
      'code': '440883',
      'p_code': '440800',
      'name': '吴川市'
    }
    ]
  },
  {
    'area_id': '29111',
    'code': '440900',
    'p_code': '440000',
    'name': '茂名市',
    'children': [{
      'area_id': '29112',
      'code': '440902',
      'p_code': '440900',
      'name': '茂南区'
    },
    {
      'area_id': '29129',
      'code': '440903',
      'p_code': '440900',
      'name': '电白区'
    },
    {
      'area_id': '29158',
      'code': '440981',
      'p_code': '440900',
      'name': '高州市'
    },
    {
      'area_id': '29190',
      'code': '440982',
      'p_code': '440900',
      'name': '化州市'
    },
    {
      'area_id': '29221',
      'code': '440983',
      'p_code': '440900',
      'name': '信宜市'
    }
    ]
  },
  {
    'area_id': '29242',
    'code': '441200',
    'p_code': '440000',
    'name': '肇庆市',
    'children': [{
      'area_id': '29243',
      'code': '441202',
      'p_code': '441200',
      'name': '端州区'
    },
    {
      'area_id': '29248',
      'code': '441203',
      'p_code': '441200',
      'name': '鼎湖区'
    },
    {
      'area_id': '29256',
      'code': '441223',
      'p_code': '441200',
      'name': '广宁县'
    },
    {
      'area_id': '29272',
      'code': '441224',
      'p_code': '441200',
      'name': '怀集县'
    },
    {
      'area_id': '29293',
      'code': '441225',
      'p_code': '441200',
      'name': '封开县'
    },
    {
      'area_id': '29310',
      'code': '441226',
      'p_code': '441200',
      'name': '德庆县'
    },
    {
      'area_id': '29324',
      'code': '441283',
      'p_code': '441200',
      'name': '高要区'
    },
    {
      'area_id': '29342',
      'code': '441284',
      'p_code': '441200',
      'name': '四会市'
    }
    ]
  },
  {
    'area_id': '29358',
    'code': '441300',
    'p_code': '440000',
    'name': '惠州市',
    'children': [{
      'area_id': '29359',
      'code': '441302',
      'p_code': '441300',
      'name': '惠城区'
    },
    {
      'area_id': '29379',
      'code': '441303',
      'p_code': '441300',
      'name': '惠阳区'
    },
    {
      'area_id': '29392',
      'code': '441322',
      'p_code': '441300',
      'name': '博罗县'
    },
    {
      'area_id': '29411',
      'code': '441323',
      'p_code': '441300',
      'name': '惠东县'
    },
    {
      'area_id': '29433',
      'code': '441324',
      'p_code': '441300',
      'name': '龙门县'
    }
    ]
  },
  {
    'area_id': '29446',
    'code': '441400',
    'p_code': '440000',
    'name': '梅州市',
    'children': [{
      'area_id': '29447',
      'code': '441402',
      'p_code': '441400',
      'name': '梅江区'
    },
    {
      'area_id': '29455',
      'code': '441421',
      'p_code': '441400',
      'name': '梅县区'
    },
    {
      'area_id': '29476',
      'code': '441422',
      'p_code': '441400',
      'name': '大埔县'
    },
    {
      'area_id': '29494',
      'code': '441423',
      'p_code': '441400',
      'name': '丰顺县'
    },
    {
      'area_id': '29512',
      'code': '441424',
      'p_code': '441400',
      'name': '五华县'
    },
    {
      'area_id': '29529',
      'code': '441426',
      'p_code': '441400',
      'name': '平远县'
    },
    {
      'area_id': '29542',
      'code': '441427',
      'p_code': '441400',
      'name': '蕉岭县'
    },
    {
      'area_id': '29552',
      'code': '441481',
      'p_code': '441400',
      'name': '兴宁市'
    }
    ]
  },
  {
    'area_id': '29573',
    'code': '441500',
    'p_code': '440000',
    'name': '汕尾市',
    'children': [{
      'area_id': '29574',
      'code': '441502',
      'p_code': '441500',
      'name': '城区'
    },
    {
      'area_id': '29585',
      'code': '441521',
      'p_code': '441500',
      'name': '海丰县'
    },
    {
      'area_id': '29603',
      'code': '441523',
      'p_code': '441500',
      'name': '陆河县'
    },
    {
      'area_id': '29612',
      'code': '441581',
      'p_code': '441500',
      'name': '陆丰市'
    }
    ]
  },
  {
    'area_id': '29642',
    'code': '441600',
    'p_code': '440000',
    'name': '河源市',
    'children': [{
      'area_id': '29643',
      'code': '441602',
      'p_code': '441600',
      'name': '源城区'
    },
    {
      'area_id': '29651',
      'code': '441621',
      'p_code': '441600',
      'name': '紫金县'
    },
    {
      'area_id': '29670',
      'code': '441622',
      'p_code': '441600',
      'name': '龙川县'
    },
    {
      'area_id': '29695',
      'code': '441623',
      'p_code': '441600',
      'name': '连平县'
    },
    {
      'area_id': '29709',
      'code': '441624',
      'p_code': '441600',
      'name': '和平县'
    },
    {
      'area_id': '29727',
      'code': '441625',
      'p_code': '441600',
      'name': '东源县'
    }
    ]
  },
  {
    'area_id': '29749',
    'code': '441700',
    'p_code': '440000',
    'name': '阳江市',
    'children': [{
      'area_id': '29750',
      'code': '441702',
      'p_code': '441700',
      'name': '江城区'
    },
    {
      'area_id': '29767',
      'code': '441721',
      'p_code': '441700',
      'name': '阳西县'
    },
    {
      'area_id': '29778',
      'code': '441723',
      'p_code': '441700',
      'name': '阳东区'
    },
    {
      'area_id': '29798',
      'code': '441781',
      'p_code': '441700',
      'name': '阳春市'
    }
    ]
  },
  {
    'area_id': '29825',
    'code': '441800',
    'p_code': '440000',
    'name': '清远市',
    'children': [{
      'area_id': '29826',
      'code': '441802',
      'p_code': '441800',
      'name': '清城区'
    },
    {
      'area_id': '29837',
      'code': '441821',
      'p_code': '441800',
      'name': '佛冈县'
    },
    {
      'area_id': '29844',
      'code': '441823',
      'p_code': '441800',
      'name': '阳山县'
    },
    {
      'area_id': '29858',
      'code': '441825',
      'p_code': '441800',
      'name': '连山壮族瑶族自治县'
    },
    {
      'area_id': '29868',
      'code': '441826',
      'p_code': '441800',
      'name': '连南瑶族自治县'
    },
    {
      'area_id': '29876',
      'code': '441827',
      'p_code': '441800',
      'name': '清新区'
    },
    {
      'area_id': '29886',
      'code': '441881',
      'p_code': '441800',
      'name': '英德市'
    },
    {
      'area_id': '29911',
      'code': '441882',
      'p_code': '441800',
      'name': '连州市'
    }
    ]
  },
  {
    'area_id': '29924',
    'code': '441900',
    'p_code': '440000',
    'name': '东莞市'
  },
  {
    'area_id': '29960',
    'code': '442000',
    'p_code': '440000',
    'name': '中山市'
  },
  {
    'area_id': '29985',
    'code': '445100',
    'p_code': '440000',
    'name': '潮州市',
    'children': [{
      'area_id': '29986',
      'code': '445102',
      'p_code': '445100',
      'name': '湘桥区'
    },
    {
      'area_id': '30002',
      'code': '445121',
      'p_code': '445100',
      'name': '潮安区'
    },
    {
      'area_id': '30023',
      'code': '445122',
      'p_code': '445100',
      'name': '饶平县'
    }
    ]
  },
  {
    'area_id': '30046',
    'code': '445200',
    'p_code': '440000',
    'name': '揭阳市',
    'children': [{
      'area_id': '30047',
      'code': '445202',
      'p_code': '445200',
      'name': '榕城区'
    },
    {
      'area_id': '30062',
      'code': '445221',
      'p_code': '445200',
      'name': '揭东区'
    },
    {
      'area_id': '30082',
      'code': '445222',
      'p_code': '445200',
      'name': '揭西县'
    },
    {
      'area_id': '30106',
      'code': '445224',
      'p_code': '445200',
      'name': '惠来县'
    },
    {
      'area_id': '30127',
      'code': '445281',
      'p_code': '445200',
      'name': '普宁市'
    }
    ]
  },
  {
    'area_id': '30161',
    'code': '445300',
    'p_code': '440000',
    'name': '云浮市',
    'children': [{
      'area_id': '30162',
      'code': '445302',
      'p_code': '445300',
      'name': '云城区'
    },
    {
      'area_id': '30171',
      'code': '445321',
      'p_code': '445300',
      'name': '新兴县'
    },
    {
      'area_id': '30187',
      'code': '445322',
      'p_code': '445300',
      'name': '郁南县'
    },
    {
      'area_id': '30207',
      'code': '445323',
      'p_code': '445300',
      'name': '云安区'
    },
    {
      'area_id': '30216',
      'code': '445381',
      'p_code': '445300',
      'name': '罗定市'
    }
    ]
  }
  ]
},
{
  'area_id': '30239',
  'code': '450000',
  'p_code': '0',
  'name': '广西壮族自治区',
  'children': [{
    'area_id': '30240',
    'code': '450100',
    'p_code': '450000',
    'name': '南宁市',
    'children': [{
      'area_id': '30241',
      'code': '450102',
      'p_code': '450100',
      'name': '兴宁区'
    },
    {
      'area_id': '30248',
      'code': '450103',
      'p_code': '450100',
      'name': '青秀区'
    },
    {
      'area_id': '30260',
      'code': '450105',
      'p_code': '450100',
      'name': '江南区'
    },
    {
      'area_id': '30272',
      'code': '450107',
      'p_code': '450100',
      'name': '西乡塘区'
    },
    {
      'area_id': '30289',
      'code': '450108',
      'p_code': '450100',
      'name': '良庆区'
    },
    {
      'area_id': '30298',
      'code': '450109',
      'p_code': '450100',
      'name': '邕宁区'
    },
    {
      'area_id': '30304',
      'code': '450122',
      'p_code': '450100',
      'name': '武鸣区'
    },
    {
      'area_id': '30321',
      'code': '450123',
      'p_code': '450100',
      'name': '隆安县'
    },
    {
      'area_id': '30333',
      'code': '450124',
      'p_code': '450100',
      'name': '马山县'
    },
    {
      'area_id': '30346',
      'code': '450125',
      'p_code': '450100',
      'name': '上林县'
    },
    {
      'area_id': '30358',
      'code': '450126',
      'p_code': '450100',
      'name': '宾阳县'
    },
    {
      'area_id': '30376',
      'code': '450127',
      'p_code': '450100',
      'name': '横县'
    }
    ]
  },
  {
    'area_id': '30395',
    'code': '450200',
    'p_code': '450000',
    'name': '柳州市',
    'children': [{
      'area_id': '30396',
      'code': '450202',
      'p_code': '450200',
      'name': '城中区'
    },
    {
      'area_id': '30404',
      'code': '450203',
      'p_code': '450200',
      'name': '鱼峰区'
    },
    {
      'area_id': '30415',
      'code': '450204',
      'p_code': '450200',
      'name': '柳南区'
    },
    {
      'area_id': '30425',
      'code': '450205',
      'p_code': '450200',
      'name': '柳北区'
    },
    {
      'area_id': '30436',
      'code': '450221',
      'p_code': '450200',
      'name': '柳江区'
    },
    {
      'area_id': '30451',
      'code': '450222',
      'p_code': '450200',
      'name': '柳城县'
    },
    {
      'area_id': '30464',
      'code': '450223',
      'p_code': '450200',
      'name': '鹿寨县'
    },
    {
      'area_id': '30474',
      'code': '450224',
      'p_code': '450200',
      'name': '融安县'
    },
    {
      'area_id': '30487',
      'code': '450225',
      'p_code': '450200',
      'name': '融水苗族自治县'
    },
    {
      'area_id': '30508',
      'code': '450226',
      'p_code': '450200',
      'name': '三江侗族自治县'
    }
    ]
  },
  {
    'area_id': '30524',
    'code': '450300',
    'p_code': '450000',
    'name': '桂林市',
    'children': [{
      'area_id': '30525',
      'code': '450302',
      'p_code': '450300',
      'name': '秀峰区'
    },
    {
      'area_id': '30529',
      'code': '450303',
      'p_code': '450300',
      'name': '叠彩区'
    },
    {
      'area_id': '30533',
      'code': '450304',
      'p_code': '450300',
      'name': '象山区'
    },
    {
      'area_id': '30538',
      'code': '450305',
      'p_code': '450300',
      'name': '七星区'
    },
    {
      'area_id': '30545',
      'code': '450311',
      'p_code': '450300',
      'name': '雁山区'
    },
    {
      'area_id': '30551',
      'code': '450321',
      'p_code': '450300',
      'name': '阳朔县'
    },
    {
      'area_id': '30561',
      'code': '450322',
      'p_code': '450300',
      'name': '临桂区'
    },
    {
      'area_id': '30573',
      'code': '450323',
      'p_code': '450300',
      'name': '灵川县'
    },
    {
      'area_id': '30585',
      'code': '450324',
      'p_code': '450300',
      'name': '全州县'
    },
    {
      'area_id': '30604',
      'code': '450325',
      'p_code': '450300',
      'name': '兴安县'
    },
    {
      'area_id': '30615',
      'code': '450326',
      'p_code': '450300',
      'name': '永福县'
    },
    {
      'area_id': '30625',
      'code': '450327',
      'p_code': '450300',
      'name': '灌阳县'
    },
    {
      'area_id': '30635',
      'code': '450328',
      'p_code': '450300',
      'name': '龙胜各族自治县'
    },
    {
      'area_id': '30646',
      'code': '450329',
      'p_code': '450300',
      'name': '资源县'
    },
    {
      'area_id': '30654',
      'code': '450330',
      'p_code': '450300',
      'name': '平乐县'
    },
    {
      'area_id': '30665',
      'code': '450331',
      'p_code': '450300',
      'name': '荔浦县'
    },
    {
      'area_id': '30679',
      'code': '450332',
      'p_code': '450300',
      'name': '恭城瑶族自治县'
    }
    ]
  },
  {
    'area_id': '30689',
    'code': '450400',
    'p_code': '450000',
    'name': '梧州市',
    'children': [{
      'area_id': '30690',
      'code': '450403',
      'p_code': '450400',
      'name': '万秀区'
    },
    {
      'area_id': '30701',
      'code': '450405',
      'p_code': '450400',
      'name': '长洲区'
    },
    {
      'area_id': '30706',
      'code': '450406',
      'p_code': '450400',
      'name': '龙圩区'
    },
    {
      'area_id': '30711',
      'code': '450421',
      'p_code': '450400',
      'name': '苍梧县'
    },
    {
      'area_id': '30721',
      'code': '450422',
      'p_code': '450400',
      'name': '藤县'
    },
    {
      'area_id': '30739',
      'code': '450423',
      'p_code': '450400',
      'name': '蒙山县'
    },
    {
      'area_id': '30749',
      'code': '450481',
      'p_code': '450400',
      'name': '岑溪市'
    }
    ]
  },
  {
    'area_id': '30764',
    'code': '450500',
    'p_code': '450000',
    'name': '北海市',
    'children': [{
      'area_id': '30765',
      'code': '450502',
      'p_code': '450500',
      'name': '海城区'
    },
    {
      'area_id': '30774',
      'code': '450503',
      'p_code': '450500',
      'name': '银海区'
    },
    {
      'area_id': '30779',
      'code': '450512',
      'p_code': '450500',
      'name': '铁山港区'
    },
    {
      'area_id': '30783',
      'code': '450521',
      'p_code': '450500',
      'name': '合浦县'
    }
    ]
  },
  {
    'area_id': '30799',
    'code': '450600',
    'p_code': '450000',
    'name': '防城港市',
    'children': [{
      'area_id': '30800',
      'code': '450602',
      'p_code': '450600',
      'name': '港口区'
    },
    {
      'area_id': '30806',
      'code': '450603',
      'p_code': '450600',
      'name': '防城区'
    },
    {
      'area_id': '30822',
      'code': '450621',
      'p_code': '450600',
      'name': '上思县'
    },
    {
      'area_id': '30832',
      'code': '450681',
      'p_code': '450600',
      'name': '东兴市'
    }
    ]
  },
  {
    'area_id': '30836',
    'code': '450700',
    'p_code': '450000',
    'name': '钦州市',
    'children': [{
      'area_id': '30837',
      'code': '450702',
      'p_code': '450700',
      'name': '钦南区'
    },
    {
      'area_id': '30859',
      'code': '450703',
      'p_code': '450700',
      'name': '钦北区'
    },
    {
      'area_id': '30874',
      'code': '450721',
      'p_code': '450700',
      'name': '灵山县'
    },
    {
      'area_id': '30895',
      'code': '450722',
      'p_code': '450700',
      'name': '浦北县'
    }
    ]
  },
  {
    'area_id': '30912',
    'code': '450800',
    'p_code': '450000',
    'name': '贵港市',
    'children': [{
      'area_id': '30913',
      'code': '450802',
      'p_code': '450800',
      'name': '港北区'
    },
    {
      'area_id': '30922',
      'code': '450803',
      'p_code': '450800',
      'name': '港南区'
    },
    {
      'area_id': '30932',
      'code': '450804',
      'p_code': '450800',
      'name': '覃塘区'
    },
    {
      'area_id': '30943',
      'code': '450821',
      'p_code': '450800',
      'name': '平南县'
    },
    {
      'area_id': '30965',
      'code': '450881',
      'p_code': '450800',
      'name': '桂平市'
    }
    ]
  },
  {
    'area_id': '30992',
    'code': '450900',
    'p_code': '450000',
    'name': '玉林市',
    'children': [{
      'area_id': '30993',
      'code': '450902',
      'p_code': '450900',
      'name': '玉州区'
    },
    {
      'area_id': '31003',
      'code': '450903',
      'p_code': '450900',
      'name': '福绵区'
    },
    {
      'area_id': '31010',
      'code': '450921',
      'p_code': '450900',
      'name': '容县'
    },
    {
      'area_id': '31026',
      'code': '450922',
      'p_code': '450900',
      'name': '陆川县'
    },
    {
      'area_id': '31041',
      'code': '450923',
      'p_code': '450900',
      'name': '博白县'
    },
    {
      'area_id': '31070',
      'code': '450924',
      'p_code': '450900',
      'name': '兴业县'
    },
    {
      'area_id': '31084',
      'code': '450981',
      'p_code': '450900',
      'name': '北流市'
    }
    ]
  },
  {
    'area_id': '31110',
    'code': '451000',
    'p_code': '450000',
    'name': '百色市',
    'children': [{
      'area_id': '31111',
      'code': '451002',
      'p_code': '451000',
      'name': '右江区'
    },
    {
      'area_id': '31121',
      'code': '451021',
      'p_code': '451000',
      'name': '田阳县'
    },
    {
      'area_id': '31132',
      'code': '451022',
      'p_code': '451000',
      'name': '田东县'
    },
    {
      'area_id': '31143',
      'code': '451023',
      'p_code': '451000',
      'name': '平果县'
    },
    {
      'area_id': '31157',
      'code': '451024',
      'p_code': '451000',
      'name': '德保县'
    },
    {
      'area_id': '31171',
      'code': '451025',
      'p_code': '451000',
      'name': '靖西市'
    },
    {
      'area_id': '31191',
      'code': '451026',
      'p_code': '451000',
      'name': '那坡县'
    },
    {
      'area_id': '31201',
      'code': '451027',
      'p_code': '451000',
      'name': '凌云县'
    },
    {
      'area_id': '31210',
      'code': '451028',
      'p_code': '451000',
      'name': '乐业县'
    },
    {
      'area_id': '31219',
      'code': '451029',
      'p_code': '451000',
      'name': '田林县'
    },
    {
      'area_id': '31234',
      'code': '451030',
      'p_code': '451000',
      'name': '西林县'
    },
    {
      'area_id': '31243',
      'code': '451031',
      'p_code': '451000',
      'name': '隆林各族自治县'
    }
    ]
  },
  {
    'area_id': '31260',
    'code': '451100',
    'p_code': '450000',
    'name': '贺州市',
    'children': [{
      'area_id': '31261',
      'code': '451102',
      'p_code': '451100',
      'name': '八步区'
    },
    {
      'area_id': '31278',
      'code': '451103',
      'p_code': '451100',
      'name': '平桂区'
    },
    {
      'area_id': '31288',
      'code': '451121',
      'p_code': '451100',
      'name': '昭平县'
    },
    {
      'area_id': '31301',
      'code': '451122',
      'p_code': '451100',
      'name': '钟山县'
    },
    {
      'area_id': '31314',
      'code': '451123',
      'p_code': '451100',
      'name': '富川瑶族自治县'
    }
    ]
  },
  {
    'area_id': '31327',
    'code': '451200',
    'p_code': '450000',
    'name': '河池市',
    'children': [{
      'area_id': '31328',
      'code': '451202',
      'p_code': '451200',
      'name': '金城江区'
    },
    {
      'area_id': '31341',
      'code': '451221',
      'p_code': '451200',
      'name': '南丹县'
    },
    {
      'area_id': '31353',
      'code': '451222',
      'p_code': '451200',
      'name': '天峨县'
    },
    {
      'area_id': '31363',
      'code': '451223',
      'p_code': '451200',
      'name': '凤山县'
    },
    {
      'area_id': '31373',
      'code': '451224',
      'p_code': '451200',
      'name': '东兰县'
    },
    {
      'area_id': '31388',
      'code': '451225',
      'p_code': '451200',
      'name': '罗城仫佬族自治县'
    },
    {
      'area_id': '31400',
      'code': '451226',
      'p_code': '451200',
      'name': '环江毛南族自治县'
    },
    {
      'area_id': '31413',
      'code': '451227',
      'p_code': '451200',
      'name': '巴马瑶族自治县'
    },
    {
      'area_id': '31424',
      'code': '451228',
      'p_code': '451200',
      'name': '都安瑶族自治县'
    },
    {
      'area_id': '31444',
      'code': '451229',
      'p_code': '451200',
      'name': '大化瑶族自治县'
    },
    {
      'area_id': '31461',
      'code': '451281',
      'p_code': '451200',
      'name': '宜州市'
    }
    ]
  },
  {
    'area_id': '31478',
    'code': '451300',
    'p_code': '450000',
    'name': '来宾市',
    'children': [{
      'area_id': '31479',
      'code': '451302',
      'p_code': '451300',
      'name': '兴宾区'
    },
    {
      'area_id': '31506',
      'code': '451321',
      'p_code': '451300',
      'name': '忻城县'
    },
    {
      'area_id': '31519',
      'code': '451322',
      'p_code': '451300',
      'name': '象州县'
    },
    {
      'area_id': '31531',
      'code': '451323',
      'p_code': '451300',
      'name': '武宣县'
    },
    {
      'area_id': '31543',
      'code': '451324',
      'p_code': '451300',
      'name': '金秀瑶族自治县'
    },
    {
      'area_id': '31554',
      'code': '451381',
      'p_code': '451300',
      'name': '合山市'
    }
    ]
  },
  {
    'area_id': '31558',
    'code': '451400',
    'p_code': '450000',
    'name': '崇左市',
    'children': [{
      'area_id': '31559',
      'code': '451402',
      'p_code': '451400',
      'name': '江州区'
    },
    {
      'area_id': '31573',
      'code': '451421',
      'p_code': '451400',
      'name': '扶绥县'
    },
    {
      'area_id': '31586',
      'code': '451422',
      'p_code': '451400',
      'name': '宁明县'
    },
    {
      'area_id': '31602',
      'code': '451423',
      'p_code': '451400',
      'name': '龙州县'
    },
    {
      'area_id': '31615',
      'code': '451424',
      'p_code': '451400',
      'name': '大新县'
    },
    {
      'area_id': '31631',
      'code': '451425',
      'p_code': '451400',
      'name': '天等县'
    },
    {
      'area_id': '31645',
      'code': '451481',
      'p_code': '451400',
      'name': '凭祥市'
    }
    ]
  }
  ]
},
{
  'area_id': '31651',
  'code': '460000',
  'p_code': '0',
  'name': '海南省',
  'children': [{
    'area_id': '31652',
    'code': '460100',
    'p_code': '460000',
    'name': '海口市',
    'children': [{
      'area_id': '31653',
      'code': '460105',
      'p_code': '460100',
      'name': '秀英区'
    },
    {
      'area_id': '31662',
      'code': '460106',
      'p_code': '460100',
      'name': '龙华区'
    },
    {
      'area_id': '31674',
      'code': '460107',
      'p_code': '460100',
      'name': '琼山区'
    },
    {
      'area_id': '31690',
      'code': '460108',
      'p_code': '460100',
      'name': '美兰区'
    }
    ]
  },
  {
    'area_id': '31707',
    'code': '460200',
    'p_code': '460000',
    'name': '三亚市',
    'children': [{
      'area_id': '31708',
      'code': '460202',
      'p_code': '460200',
      'name': '海棠区'
    },
    {
      'area_id': '31711',
      'code': '460203',
      'p_code': '460200',
      'name': '吉阳区'
    },
    {
      'area_id': '31715',
      'code': '460204',
      'p_code': '460200',
      'name': '天涯区'
    },
    {
      'area_id': '31721',
      'code': '460205',
      'p_code': '460200',
      'name': '崖州区'
    }
    ]
  },
  {
    'area_id': '31724',
    'code': '460300',
    'p_code': '460000',
    'name': '三沙市',
    'children': [{
      'area_id': '31725',
      'code': '460321',
      'p_code': '460300',
      'name': '西沙群岛'
    },
    {
      'area_id': '31727',
      'code': '460322',
      'p_code': '460300',
      'name': '南沙群岛'
    },
    {
      'area_id': '31729',
      'code': '460323',
      'p_code': '460300',
      'name': '中沙群岛的岛礁及其海域'
    }
    ]
  },
  {
    'area_id': '31731',
    'code': '469001',
    'p_code': '460000',
    'name': '五指山市'
  },
  {
    'area_id': '31740',
    'code': '469002',
    'p_code': '460000',
    'name': '琼海市'
  },
  {
    'area_id': '31757',
    'code': '469003',
    'p_code': '460000',
    'name': '儋州市'
  },
  {
    'area_id': '31781',
    'code': '469005',
    'p_code': '460000',
    'name': '文昌市'
  },
  {
    'area_id': '31802',
    'code': '469006',
    'p_code': '460000',
    'name': '万宁市'
  },
  {
    'area_id': '31820',
    'code': '469007',
    'p_code': '460000',
    'name': '东方市'
  },
  {
    'area_id': '31833',
    'code': '469025',
    'p_code': '460000',
    'name': '定安县'
  },
  {
    'area_id': '31847',
    'code': '469026',
    'p_code': '460000',
    'name': '屯昌县'
  },
  {
    'area_id': '31858',
    'code': '469027',
    'p_code': '460000',
    'name': '澄迈县'
  },
  {
    'area_id': '31876',
    'code': '469028',
    'p_code': '460000',
    'name': '临高县'
  },
  {
    'area_id': '31889',
    'code': '469030',
    'p_code': '460000',
    'name': '白沙黎族自治县'
  },
  {
    'area_id': '31904',
    'code': '469031',
    'p_code': '460000',
    'name': '昌江黎族自治县'
  },
  {
    'area_id': '31916',
    'code': '469033',
    'p_code': '460000',
    'name': '乐东黎族自治县'
  },
  {
    'area_id': '31933',
    'code': '469034',
    'p_code': '460000',
    'name': '陵水黎族自治县'
  },
  {
    'area_id': '31948',
    'code': '469035',
    'p_code': '460000',
    'name': '保亭黎族苗族自治县'
  },
  {
    'area_id': '31962',
    'code': '469036',
    'p_code': '460000',
    'name': '琼中黎族苗族自治县'
  }
  ]
},
{
  'area_id': '31978',
  'code': '500000',
  'p_code': '0',
  'name': '重庆',
  'children': [{
    'area_id': '31979',
    'code': '500100',
    'p_code': '500000',
    'name': '重庆市',
    'children': [{
      'area_id': '31980',
      'code': '500101',
      'p_code': '500100',
      'name': '万州区'
    },
    {
      'area_id': '32033',
      'code': '500102',
      'p_code': '500100',
      'name': '涪陵区'
    },
    {
      'area_id': '32060',
      'code': '500103',
      'p_code': '500100',
      'name': '渝中区'
    },
    {
      'area_id': '32073',
      'code': '500104',
      'p_code': '500100',
      'name': '大渡口区'
    },
    {
      'area_id': '32082',
      'code': '500105',
      'p_code': '500100',
      'name': '江北区'
    },
    {
      'area_id': '32095',
      'code': '500106',
      'p_code': '500100',
      'name': '沙坪坝区'
    },
    {
      'area_id': '32122',
      'code': '500107',
      'p_code': '500100',
      'name': '九龙坡区'
    },
    {
      'area_id': '32141',
      'code': '500108',
      'p_code': '500100',
      'name': '南岸区'
    },
    {
      'area_id': '32157',
      'code': '500109',
      'p_code': '500100',
      'name': '北碚区'
    },
    {
      'area_id': '32175',
      'code': '500112',
      'p_code': '500100',
      'name': '渝北区'
    },
    {
      'area_id': '32206',
      'code': '500113',
      'p_code': '500100',
      'name': '巴南区'
    },
    {
      'area_id': '32229',
      'code': '500114',
      'p_code': '500100',
      'name': '黔江区'
    },
    {
      'area_id': '32260',
      'code': '500115',
      'p_code': '500100',
      'name': '长寿区'
    },
    {
      'area_id': '32279',
      'code': '500222',
      'p_code': '500100',
      'name': '綦江区'
    },
    {
      'area_id': '32310',
      'code': '500223',
      'p_code': '500100',
      'name': '潼南区'
    },
    {
      'area_id': '32333',
      'code': '500224',
      'p_code': '500100',
      'name': '铜梁区'
    },
    {
      'area_id': '32362',
      'code': '500225',
      'p_code': '500100',
      'name': '大足区'
    },
    {
      'area_id': '32390',
      'code': '500226',
      'p_code': '500100',
      'name': '荣昌区'
    },
    {
      'area_id': '32412',
      'code': '500227',
      'p_code': '500100',
      'name': '璧山区'
    },
    {
      'area_id': '32428',
      'code': '500228',
      'p_code': '500100',
      'name': '梁平县'
    },
    {
      'area_id': '32464',
      'code': '500229',
      'p_code': '500100',
      'name': '城口县'
    },
    {
      'area_id': '32490',
      'code': '500230',
      'p_code': '500100',
      'name': '丰都县'
    },
    {
      'area_id': '32521',
      'code': '500231',
      'p_code': '500100',
      'name': '垫江县'
    },
    {
      'area_id': '32549',
      'code': '500232',
      'p_code': '500100',
      'name': '武隆县'
    },
    {
      'area_id': '32576',
      'code': '500233',
      'p_code': '500100',
      'name': '忠县'
    },
    {
      'area_id': '32607',
      'code': '500234',
      'p_code': '500100',
      'name': '开州区'
    },
    {
      'area_id': '32648',
      'code': '500235',
      'p_code': '500100',
      'name': '云阳县'
    },
    {
      'area_id': '32691',
      'code': '500236',
      'p_code': '500100',
      'name': '奉节县'
    },
    {
      'area_id': '32723',
      'code': '500237',
      'p_code': '500100',
      'name': '巫山县'
    },
    {
      'area_id': '32750',
      'code': '500238',
      'p_code': '500100',
      'name': '巫溪县'
    },
    {
      'area_id': '32784',
      'code': '500240',
      'p_code': '500100',
      'name': '石柱土家族自治县'
    },
    {
      'area_id': '32818',
      'code': '500241',
      'p_code': '500100',
      'name': '秀山土家族苗族自治县'
    },
    {
      'area_id': '32846',
      'code': '500242',
      'p_code': '500100',
      'name': '酉阳土家族苗族自治县'
    },
    {
      'area_id': '32887',
      'code': '500243',
      'p_code': '500100',
      'name': '彭水苗族土家族自治县'
    },
    {
      'area_id': '32927',
      'code': '500381',
      'p_code': '500100',
      'name': '江津区'
    },
    {
      'area_id': '32956',
      'code': '500382',
      'p_code': '500100',
      'name': '合川区'
    },
    {
      'area_id': '32987',
      'code': '500383',
      'p_code': '500100',
      'name': '永川区'
    },
    {
      'area_id': '33011',
      'code': '500384',
      'p_code': '500100',
      'name': '南川区'
    }
    ]
  }]
},
{
  'area_id': '33046',
  'code': '510000',
  'p_code': '0',
  'name': '四川省',
  'children': [{
    'area_id': '33047',
    'code': '510100',
    'p_code': '510000',
    'name': '成都市',
    'children': [{
      'area_id': '33048',
      'code': '510104',
      'p_code': '510100',
      'name': '锦江区'
    },
    {
      'area_id': '33065',
      'code': '510105',
      'p_code': '510100',
      'name': '青羊区'
    },
    {
      'area_id': '33080',
      'code': '510106',
      'p_code': '510100',
      'name': '金牛区'
    },
    {
      'area_id': '33096',
      'code': '510107',
      'p_code': '510100',
      'name': '武侯区'
    },
    {
      'area_id': '33114',
      'code': '510108',
      'p_code': '510100',
      'name': '成华区'
    },
    {
      'area_id': '33130',
      'code': '510112',
      'p_code': '510100',
      'name': '龙泉驿区'
    },
    {
      'area_id': '33143',
      'code': '510113',
      'p_code': '510100',
      'name': '青白江区'
    },
    {
      'area_id': '33155',
      'code': '510114',
      'p_code': '510100',
      'name': '新都区'
    },
    {
      'area_id': '33169',
      'code': '510115',
      'p_code': '510100',
      'name': '温江区'
    },
    {
      'area_id': '33180',
      'code': '510121',
      'p_code': '510100',
      'name': '金堂县'
    },
    {
      'area_id': '33202',
      'code': '510122',
      'p_code': '510100',
      'name': '双流区'
    },
    {
      'area_id': '33229',
      'code': '510124',
      'p_code': '510100',
      'name': '郫县'
    },
    {
      'area_id': '33245',
      'code': '510129',
      'p_code': '510100',
      'name': '大邑县'
    },
    {
      'area_id': '33266',
      'code': '510131',
      'p_code': '510100',
      'name': '蒲江县'
    },
    {
      'area_id': '33279',
      'code': '510132',
      'p_code': '510100',
      'name': '新津县'
    },
    {
      'area_id': '33292',
      'code': '510181',
      'p_code': '510100',
      'name': '都江堰市'
    },
    {
      'area_id': '33313',
      'code': '510182',
      'p_code': '510100',
      'name': '彭州市'
    },
    {
      'area_id': '33334',
      'code': '510183',
      'p_code': '510100',
      'name': '邛崃市'
    },
    {
      'area_id': '33359',
      'code': '510184',
      'p_code': '510100',
      'name': '崇州市'
    },
    {
      'area_id': '33385',
      'code': '512081',
      'p_code': '510100',
      'name': '简阳市'
    }
    ]
  },
  {
    'area_id': '33441',
    'code': '510300',
    'p_code': '510000',
    'name': '自贡市',
    'children': [{
      'area_id': '33442',
      'code': '510302',
      'p_code': '510300',
      'name': '自流井区'
    },
    {
      'area_id': '33456',
      'code': '510303',
      'p_code': '510300',
      'name': '贡井区'
    },
    {
      'area_id': '33470',
      'code': '510304',
      'p_code': '510300',
      'name': '大安区'
    },
    {
      'area_id': '33487',
      'code': '510311',
      'p_code': '510300',
      'name': '沿滩区'
    },
    {
      'area_id': '33501',
      'code': '510321',
      'p_code': '510300',
      'name': '荣县'
    },
    {
      'area_id': '33529',
      'code': '510322',
      'p_code': '510300',
      'name': '富顺县'
    }
    ]
  },
  {
    'area_id': '33556',
    'code': '510400',
    'p_code': '510000',
    'name': '攀枝花市',
    'children': [{
      'area_id': '33557',
      'code': '510402',
      'p_code': '510400',
      'name': '东区'
    },
    {
      'area_id': '33568',
      'code': '510403',
      'p_code': '510400',
      'name': '西区'
    },
    {
      'area_id': '33576',
      'code': '510411',
      'p_code': '510400',
      'name': '仁和区'
    },
    {
      'area_id': '33592',
      'code': '510421',
      'p_code': '510400',
      'name': '米易县'
    },
    {
      'area_id': '33605',
      'code': '510422',
      'p_code': '510400',
      'name': '盐边县'
    }
    ]
  },
  {
    'area_id': '33622',
    'code': '510500',
    'p_code': '510000',
    'name': '泸州市',
    'children': [{
      'area_id': '33623',
      'code': '510502',
      'p_code': '510500',
      'name': '江阳区'
    },
    {
      'area_id': '33645',
      'code': '510503',
      'p_code': '510500',
      'name': '纳溪区'
    },
    {
      'area_id': '33661',
      'code': '510504',
      'p_code': '510500',
      'name': '龙马潭区'
    },
    {
      'area_id': '33675',
      'code': '510521',
      'p_code': '510500',
      'name': '泸县'
    },
    {
      'area_id': '33698',
      'code': '510522',
      'p_code': '510500',
      'name': '合江县'
    },
    {
      'area_id': '33727',
      'code': '510524',
      'p_code': '510500',
      'name': '叙永县'
    },
    {
      'area_id': '33753',
      'code': '510525',
      'p_code': '510500',
      'name': '古蔺县'
    }
    ]
  },
  {
    'area_id': '33780',
    'code': '510600',
    'p_code': '510000',
    'name': '德阳市',
    'children': [{
      'area_id': '33781',
      'code': '510603',
      'p_code': '510600',
      'name': '旌阳区'
    },
    {
      'area_id': '33799',
      'code': '510623',
      'p_code': '510600',
      'name': '中江县'
    },
    {
      'area_id': '33845',
      'code': '510626',
      'p_code': '510600',
      'name': '罗江县'
    },
    {
      'area_id': '33856',
      'code': '510681',
      'p_code': '510600',
      'name': '广汉市'
    },
    {
      'area_id': '33875',
      'code': '510682',
      'p_code': '510600',
      'name': '什邡市'
    },
    {
      'area_id': '33892',
      'code': '510683',
      'p_code': '510600',
      'name': '绵竹市'
    }
    ]
  },
  {
    'area_id': '33915',
    'code': '510700',
    'p_code': '510000',
    'name': '绵阳市',
    'children': [{
      'area_id': '33916',
      'code': '510703',
      'p_code': '510700',
      'name': '涪城区'
    },
    {
      'area_id': '33942',
      'code': '510704',
      'p_code': '510700',
      'name': '游仙区'
    },
    {
      'area_id': '33973',
      'code': '510722',
      'p_code': '510700',
      'name': '三台县'
    },
    {
      'area_id': '34037',
      'code': '510723',
      'p_code': '510700',
      'name': '盐亭县'
    },
    {
      'area_id': '34074',
      'code': '510724',
      'p_code': '510700',
      'name': '安州区'
    },
    {
      'area_id': '34093',
      'code': '510725',
      'p_code': '510700',
      'name': '梓潼县'
    },
    {
      'area_id': '34126',
      'code': '510726',
      'p_code': '510700',
      'name': '北川羌族自治县'
    },
    {
      'area_id': '34150',
      'code': '510727',
      'p_code': '510700',
      'name': '平武县'
    },
    {
      'area_id': '34176',
      'code': '510781',
      'p_code': '510700',
      'name': '江油市'
    }
    ]
  },
  {
    'area_id': '34221',
    'code': '510800',
    'p_code': '510000',
    'name': '广元市',
    'children': [{
      'area_id': '34222',
      'code': '510802',
      'p_code': '510800',
      'name': '利州区'
    },
    {
      'area_id': '34243',
      'code': '510811',
      'p_code': '510800',
      'name': '昭化区'
    },
    {
      'area_id': '34273',
      'code': '510812',
      'p_code': '510800',
      'name': '朝天区'
    },
    {
      'area_id': '34299',
      'code': '510821',
      'p_code': '510800',
      'name': '旺苍县'
    },
    {
      'area_id': '34338',
      'code': '510822',
      'p_code': '510800',
      'name': '青川县'
    },
    {
      'area_id': '34376',
      'code': '510823',
      'p_code': '510800',
      'name': '剑阁县'
    },
    {
      'area_id': '34434',
      'code': '510824',
      'p_code': '510800',
      'name': '苍溪县'
    }
    ]
  },
  {
    'area_id': '34477',
    'code': '510900',
    'p_code': '510000',
    'name': '遂宁市',
    'children': [{
      'area_id': '34478',
      'code': '510903',
      'p_code': '510900',
      'name': '船山区'
    },
    {
      'area_id': '34509',
      'code': '510904',
      'p_code': '510900',
      'name': '安居区'
    },
    {
      'area_id': '34533',
      'code': '510921',
      'p_code': '510900',
      'name': '蓬溪县'
    },
    {
      'area_id': '34567',
      'code': '510922',
      'p_code': '510900',
      'name': '射洪县'
    },
    {
      'area_id': '34600',
      'code': '510923',
      'p_code': '510900',
      'name': '大英县'
    }
    ]
  },
  {
    'area_id': '34612',
    'code': '511000',
    'p_code': '510000',
    'name': '内江市',
    'children': [{
      'area_id': '34613',
      'code': '511002',
      'p_code': '511000',
      'name': '市中区'
    },
    {
      'area_id': '34635',
      'code': '511011',
      'p_code': '511000',
      'name': '东兴区'
    },
    {
      'area_id': '34665',
      'code': '511024',
      'p_code': '511000',
      'name': '威远县'
    },
    {
      'area_id': '34686',
      'code': '511025',
      'p_code': '511000',
      'name': '资中县'
    },
    {
      'area_id': '34720',
      'code': '511028',
      'p_code': '511000',
      'name': '隆昌县'
    }
    ]
  },
  {
    'area_id': '34740',
    'code': '511100',
    'p_code': '510000',
    'name': '乐山市',
    'children': [{
      'area_id': '34741',
      'code': '511102',
      'p_code': '511100',
      'name': '市中区'
    },
    {
      'area_id': '34774',
      'code': '511111',
      'p_code': '511100',
      'name': '沙湾区'
    },
    {
      'area_id': '34789',
      'code': '511112',
      'p_code': '511100',
      'name': '五通桥区'
    },
    {
      'area_id': '34802',
      'code': '511113',
      'p_code': '511100',
      'name': '金口河区'
    },
    {
      'area_id': '34809',
      'code': '511123',
      'p_code': '511100',
      'name': '犍为县'
    },
    {
      'area_id': '34840',
      'code': '511124',
      'p_code': '511100',
      'name': '井研县'
    },
    {
      'area_id': '34868',
      'code': '511126',
      'p_code': '511100',
      'name': '夹江县'
    },
    {
      'area_id': '34891',
      'code': '511129',
      'p_code': '511100',
      'name': '沐川县'
    },
    {
      'area_id': '34912',
      'code': '511132',
      'p_code': '511100',
      'name': '峨边彝族自治县'
    },
    {
      'area_id': '34932',
      'code': '511133',
      'p_code': '511100',
      'name': '马边彝族自治县'
    },
    {
      'area_id': '34953',
      'code': '511181',
      'p_code': '511100',
      'name': '峨眉山市'
    }
    ]
  },
  {
    'area_id': '34977',
    'code': '511300',
    'p_code': '510000',
    'name': '南充市',
    'children': [{
      'area_id': '34978',
      'code': '511302',
      'p_code': '511300',
      'name': '顺庆区'
    },
    {
      'area_id': '35008',
      'code': '511303',
      'p_code': '511300',
      'name': '高坪区'
    },
    {
      'area_id': '35041',
      'code': '511304',
      'p_code': '511300',
      'name': '嘉陵区'
    },
    {
      'area_id': '35087',
      'code': '511321',
      'p_code': '511300',
      'name': '南部县'
    },
    {
      'area_id': '35162',
      'code': '511322',
      'p_code': '511300',
      'name': '营山县'
    },
    {
      'area_id': '35216',
      'code': '511323',
      'p_code': '511300',
      'name': '蓬安县'
    },
    {
      'area_id': '35256',
      'code': '511324',
      'p_code': '511300',
      'name': '仪陇县'
    },
    {
      'area_id': '35314',
      'code': '511325',
      'p_code': '511300',
      'name': '西充县'
    },
    {
      'area_id': '35359',
      'code': '511381',
      'p_code': '511300',
      'name': '阆中市'
    }
    ]
  },
  {
    'area_id': '35410',
    'code': '511400',
    'p_code': '510000',
    'name': '眉山市',
    'children': [{
      'area_id': '35411',
      'code': '511402',
      'p_code': '511400',
      'name': '东坡区'
    },
    {
      'area_id': '35438',
      'code': '511421',
      'p_code': '511400',
      'name': '仁寿县'
    },
    {
      'area_id': '35499',
      'code': '511422',
      'p_code': '511400',
      'name': '彭山区'
    },
    {
      'area_id': '35513',
      'code': '511423',
      'p_code': '511400',
      'name': '洪雅县'
    },
    {
      'area_id': '35529',
      'code': '511424',
      'p_code': '511400',
      'name': '丹棱县'
    },
    {
      'area_id': '35537',
      'code': '511425',
      'p_code': '511400',
      'name': '青神县'
    }
    ]
  },
  {
    'area_id': '35548',
    'code': '511500',
    'p_code': '510000',
    'name': '宜宾市',
    'children': [{
      'area_id': '35549',
      'code': '511502',
      'p_code': '511500',
      'name': '翠屏区'
    },
    {
      'area_id': '35574',
      'code': '511521',
      'p_code': '511500',
      'name': '宜宾县'
    },
    {
      'area_id': '35601',
      'code': '511522',
      'p_code': '511500',
      'name': '南溪区'
    },
    {
      'area_id': '35617',
      'code': '511523',
      'p_code': '511500',
      'name': '江安县'
    },
    {
      'area_id': '35636',
      'code': '511524',
      'p_code': '511500',
      'name': '长宁县'
    },
    {
      'area_id': '35655',
      'code': '511525',
      'p_code': '511500',
      'name': '高县'
    },
    {
      'area_id': '35675',
      'code': '511526',
      'p_code': '511500',
      'name': '珙县'
    },
    {
      'area_id': '35693',
      'code': '511527',
      'p_code': '511500',
      'name': '筠连县'
    },
    {
      'area_id': '35712',
      'code': '511528',
      'p_code': '511500',
      'name': '兴文县'
    },
    {
      'area_id': '35728',
      'code': '511529',
      'p_code': '511500',
      'name': '屏山县'
    }
    ]
  },
  {
    'area_id': '35744',
    'code': '511600',
    'p_code': '510000',
    'name': '广安市',
    'children': [{
      'area_id': '35745',
      'code': '511602',
      'p_code': '511600',
      'name': '广安区'
    },
    {
      'area_id': '35782',
      'code': '511603',
      'p_code': '511600',
      'name': '前锋区'
    },
    {
      'area_id': '35796',
      'code': '511621',
      'p_code': '511600',
      'name': '岳池县'
    },
    {
      'area_id': '35840',
      'code': '511622',
      'p_code': '511600',
      'name': '武胜县'
    },
    {
      'area_id': '35872',
      'code': '511623',
      'p_code': '511600',
      'name': '邻水县'
    },
    {
      'area_id': '35918',
      'code': '511681',
      'p_code': '511600',
      'name': '华蓥市'
    }
    ]
  },
  {
    'area_id': '35932',
    'code': '511700',
    'p_code': '510000',
    'name': '达州市',
    'children': [{
      'area_id': '35933',
      'code': '511702',
      'p_code': '511700',
      'name': '通川区'
    },
    {
      'area_id': '35956',
      'code': '511721',
      'p_code': '511700',
      'name': '达川区'
    },
    {
      'area_id': '36013',
      'code': '511722',
      'p_code': '511700',
      'name': '宣汉县'
    },
    {
      'area_id': '36068',
      'code': '511723',
      'p_code': '511700',
      'name': '开江县'
    },
    {
      'area_id': '36089',
      'code': '511724',
      'p_code': '511700',
      'name': '大竹县'
    },
    {
      'area_id': '36140',
      'code': '511725',
      'p_code': '511700',
      'name': '渠县'
    },
    {
      'area_id': '36201',
      'code': '511781',
      'p_code': '511700',
      'name': '万源市'
    }
    ]
  },
  {
    'area_id': '36254',
    'code': '511800',
    'p_code': '510000',
    'name': '雅安市',
    'children': [{
      'area_id': '36255',
      'code': '511802',
      'p_code': '511800',
      'name': '雨城区'
    },
    {
      'area_id': '36278',
      'code': '511821',
      'p_code': '511800',
      'name': '名山区'
    },
    {
      'area_id': '36299',
      'code': '511822',
      'p_code': '511800',
      'name': '荥经县'
    },
    {
      'area_id': '36321',
      'code': '511823',
      'p_code': '511800',
      'name': '汉源县'
    },
    {
      'area_id': '36352',
      'code': '511824',
      'p_code': '511800',
      'name': '石棉县'
    },
    {
      'area_id': '36370',
      'code': '511825',
      'p_code': '511800',
      'name': '天全县'
    },
    {
      'area_id': '36386',
      'code': '511826',
      'p_code': '511800',
      'name': '芦山县'
    },
    {
      'area_id': '36396',
      'code': '511827',
      'p_code': '511800',
      'name': '宝兴县'
    }
    ]
  },
  {
    'area_id': '36406',
    'code': '511900',
    'p_code': '510000',
    'name': '巴中市',
    'children': [{
      'area_id': '36407',
      'code': '511902',
      'p_code': '511900',
      'name': '巴州区'
    },
    {
      'area_id': '36438',
      'code': '511903',
      'p_code': '511900',
      'name': '恩阳区'
    },
    {
      'area_id': '36463',
      'code': '511921',
      'p_code': '511900',
      'name': '通江县'
    },
    {
      'area_id': '36513',
      'code': '511922',
      'p_code': '511900',
      'name': '南江县'
    },
    {
      'area_id': '36562',
      'code': '511923',
      'p_code': '511900',
      'name': '平昌县'
    }
    ]
  },
  {
    'area_id': '36607',
    'code': '512000',
    'p_code': '510000',
    'name': '资阳市',
    'children': [{
      'area_id': '36608',
      'code': '512002',
      'p_code': '512000',
      'name': '雁江区'
    },
    {
      'area_id': '36636',
      'code': '512021',
      'p_code': '512000',
      'name': '安岳县'
    },
    {
      'area_id': '36706',
      'code': '512022',
      'p_code': '512000',
      'name': '乐至县'
    }
    ]
  },
  {
    'area_id': '36732',
    'code': '513200',
    'p_code': '510000',
    'name': '阿坝藏族羌族自治州',
    'children': [{
      'area_id': '36733',
      'code': '513221',
      'p_code': '513200',
      'name': '汶川县'
    },
    {
      'area_id': '36747',
      'code': '513222',
      'p_code': '513200',
      'name': '理县'
    },
    {
      'area_id': '36761',
      'code': '513223',
      'p_code': '513200',
      'name': '茂县'
    },
    {
      'area_id': '36783',
      'code': '513224',
      'p_code': '513200',
      'name': '松潘县'
    },
    {
      'area_id': '36810',
      'code': '513225',
      'p_code': '513200',
      'name': '九寨沟县'
    },
    {
      'area_id': '36830',
      'code': '513226',
      'p_code': '513200',
      'name': '金川县'
    },
    {
      'area_id': '36854',
      'code': '513227',
      'p_code': '513200',
      'name': '小金县'
    },
    {
      'area_id': '36876',
      'code': '513228',
      'p_code': '513200',
      'name': '黑水县'
    },
    {
      'area_id': '36894',
      'code': '513229',
      'p_code': '513200',
      'name': '马尔康市'
    },
    {
      'area_id': '36909',
      'code': '513230',
      'p_code': '513200',
      'name': '壤塘县'
    },
    {
      'area_id': '36922',
      'code': '513231',
      'p_code': '513200',
      'name': '阿坝县'
    },
    {
      'area_id': '36944',
      'code': '513232',
      'p_code': '513200',
      'name': '若尔盖县'
    },
    {
      'area_id': '36964',
      'code': '513233',
      'p_code': '513200',
      'name': '红原县'
    }
    ]
  },
  {
    'area_id': '36976',
    'code': '513300',
    'p_code': '510000',
    'name': '甘孜藏族自治州',
    'children': [{
      'area_id': '36977',
      'code': '513321',
      'p_code': '513300',
      'name': '康定市'
    },
    {
      'area_id': '36999',
      'code': '513322',
      'p_code': '513300',
      'name': '泸定县'
    },
    {
      'area_id': '37012',
      'code': '513323',
      'p_code': '513300',
      'name': '丹巴县'
    },
    {
      'area_id': '37028',
      'code': '513324',
      'p_code': '513300',
      'name': '九龙县'
    },
    {
      'area_id': '37047',
      'code': '513325',
      'p_code': '513300',
      'name': '雅江县'
    },
    {
      'area_id': '37065',
      'code': '513326',
      'p_code': '513300',
      'name': '道孚县'
    },
    {
      'area_id': '37088',
      'code': '513327',
      'p_code': '513300',
      'name': '炉霍县'
    },
    {
      'area_id': '37105',
      'code': '513328',
      'p_code': '513300',
      'name': '甘孜县'
    },
    {
      'area_id': '37128',
      'code': '513329',
      'p_code': '513300',
      'name': '新龙县'
    },
    {
      'area_id': '37148',
      'code': '513330',
      'p_code': '513300',
      'name': '德格县'
    },
    {
      'area_id': '37175',
      'code': '513331',
      'p_code': '513300',
      'name': '白玉县'
    },
    {
      'area_id': '37193',
      'code': '513332',
      'p_code': '513300',
      'name': '石渠县'
    },
    {
      'area_id': '37216',
      'code': '513333',
      'p_code': '513300',
      'name': '色达县'
    },
    {
      'area_id': '37234',
      'code': '513334',
      'p_code': '513300',
      'name': '理塘县'
    },
    {
      'area_id': '37259',
      'code': '513335',
      'p_code': '513300',
      'name': '巴塘县'
    },
    {
      'area_id': '37279',
      'code': '513336',
      'p_code': '513300',
      'name': '乡城县'
    },
    {
      'area_id': '37292',
      'code': '513337',
      'p_code': '513300',
      'name': '稻城县'
    },
    {
      'area_id': '37307',
      'code': '513338',
      'p_code': '513300',
      'name': '得荣县'
    }
    ]
  },
  {
    'area_id': '37320',
    'code': '513400',
    'p_code': '510000',
    'name': '凉山彝族自治州',
    'children': [{
      'area_id': '37321',
      'code': '513401',
      'p_code': '513400',
      'name': '西昌市'
    },
    {
      'area_id': '37365',
      'code': '513422',
      'p_code': '513400',
      'name': '木里藏族自治县'
    },
    {
      'area_id': '37395',
      'code': '513423',
      'p_code': '513400',
      'name': '盐源县'
    },
    {
      'area_id': '37430',
      'code': '513424',
      'p_code': '513400',
      'name': '德昌县'
    },
    {
      'area_id': '37453',
      'code': '513425',
      'p_code': '513400',
      'name': '会理县'
    },
    {
      'area_id': '37504',
      'code': '513426',
      'p_code': '513400',
      'name': '会东县'
    },
    {
      'area_id': '37552',
      'code': '513427',
      'p_code': '513400',
      'name': '宁南县'
    },
    {
      'area_id': '37578',
      'code': '513428',
      'p_code': '513400',
      'name': '普格县'
    },
    {
      'area_id': '37613',
      'code': '513429',
      'p_code': '513400',
      'name': '布拖县'
    },
    {
      'area_id': '37644',
      'code': '513430',
      'p_code': '513400',
      'name': '金阳县'
    },
    {
      'area_id': '37679',
      'code': '513431',
      'p_code': '513400',
      'name': '昭觉县'
    },
    {
      'area_id': '37727',
      'code': '513432',
      'p_code': '513400',
      'name': '喜德县'
    },
    {
      'area_id': '37752',
      'code': '513433',
      'p_code': '513400',
      'name': '冕宁县'
    },
    {
      'area_id': '37791',
      'code': '513434',
      'p_code': '513400',
      'name': '越西县'
    },
    {
      'area_id': '37833',
      'code': '513435',
      'p_code': '513400',
      'name': '甘洛县'
    },
    {
      'area_id': '37862',
      'code': '513436',
      'p_code': '513400',
      'name': '美姑县'
    },
    {
      'area_id': '37899',
      'code': '513437',
      'p_code': '513400',
      'name': '雷波县'
    }
    ]
  }
  ]
},
{
  'area_id': '37949',
  'code': '520000',
  'p_code': '0',
  'name': '贵州省',
  'children': [{
    'area_id': '37950',
    'code': '520100',
    'p_code': '520000',
    'name': '贵阳市',
    'children': [{
      'area_id': '37951',
      'code': '520102',
      'p_code': '520100',
      'name': '南明区'
    },
    {
      'area_id': '37974',
      'code': '520103',
      'p_code': '520100',
      'name': '云岩区'
    },
    {
      'area_id': '38002',
      'code': '520111',
      'p_code': '520100',
      'name': '花溪区'
    },
    {
      'area_id': '38033',
      'code': '520112',
      'p_code': '520100',
      'name': '乌当区'
    },
    {
      'area_id': '38048',
      'code': '520113',
      'p_code': '520100',
      'name': '白云区'
    },
    {
      'area_id': '38060',
      'code': '520121',
      'p_code': '520100',
      'name': '开阳县'
    },
    {
      'area_id': '38079',
      'code': '520122',
      'p_code': '520100',
      'name': '息烽县'
    },
    {
      'area_id': '38091',
      'code': '520123',
      'p_code': '520100',
      'name': '修文县'
    },
    {
      'area_id': '38103',
      'code': '520151',
      'p_code': '520100',
      'name': '观山湖区'
    },
    {
      'area_id': '38115',
      'code': '520181',
      'p_code': '520100',
      'name': '清镇市'
    }
    ]
  },
  {
    'area_id': '38130',
    'code': '520200',
    'p_code': '520000',
    'name': '六盘水市',
    'children': [{
      'area_id': '38131',
      'code': '520201',
      'p_code': '520200',
      'name': '钟山区'
    },
    {
      'area_id': '38144',
      'code': '520203',
      'p_code': '520200',
      'name': '六枝特区'
    },
    {
      'area_id': '38168',
      'code': '520221',
      'p_code': '520200',
      'name': '水城县'
    },
    {
      'area_id': '38204',
      'code': '520222',
      'p_code': '520200',
      'name': '盘县'
    }
    ]
  },
  {
    'area_id': '38249',
    'code': '520300',
    'p_code': '520000',
    'name': '遵义市',
    'children': [{
      'area_id': '38250',
      'code': '520302',
      'p_code': '520300',
      'name': '红花岗区'
    },
    {
      'area_id': '38272',
      'code': '520303',
      'p_code': '520300',
      'name': '汇川区'
    },
    {
      'area_id': '38287',
      'code': '520321',
      'p_code': '520300',
      'name': '播州区'
    },
    {
      'area_id': '38309',
      'code': '520322',
      'p_code': '520300',
      'name': '桐梓县'
    },
    {
      'area_id': '38334',
      'code': '520323',
      'p_code': '520300',
      'name': '绥阳县'
    },
    {
      'area_id': '38350',
      'code': '520324',
      'p_code': '520300',
      'name': '正安县'
    },
    {
      'area_id': '38370',
      'code': '520325',
      'p_code': '520300',
      'name': '道真仡佬族苗族自治县'
    },
    {
      'area_id': '38385',
      'code': '520326',
      'p_code': '520300',
      'name': '务川仡佬族苗族自治县'
    },
    {
      'area_id': '38401',
      'code': '520327',
      'p_code': '520300',
      'name': '凤冈县'
    },
    {
      'area_id': '38416',
      'code': '520328',
      'p_code': '520300',
      'name': '湄潭县'
    },
    {
      'area_id': '38434',
      'code': '520329',
      'p_code': '520300',
      'name': '余庆县'
    },
    {
      'area_id': '38445',
      'code': '520330',
      'p_code': '520300',
      'name': '习水县'
    },
    {
      'area_id': '38469',
      'code': '520381',
      'p_code': '520300',
      'name': '赤水市'
    },
    {
      'area_id': '38487',
      'code': '520382',
      'p_code': '520300',
      'name': '仁怀市'
    }
    ]
  },
  {
    'area_id': '38509',
    'code': '520400',
    'p_code': '520000',
    'name': '安顺市',
    'children': [{
      'area_id': '38510',
      'code': '520402',
      'p_code': '520400',
      'name': '西秀区'
    },
    {
      'area_id': '38535',
      'code': '520421',
      'p_code': '520400',
      'name': '平坝区'
    },
    {
      'area_id': '38547',
      'code': '520422',
      'p_code': '520400',
      'name': '普定县'
    },
    {
      'area_id': '38559',
      'code': '520423',
      'p_code': '520400',
      'name': '镇宁布依族苗族自治县'
    },
    {
      'area_id': '38576',
      'code': '520424',
      'p_code': '520400',
      'name': '关岭布依族苗族自治县'
    },
    {
      'area_id': '38591',
      'code': '520425',
      'p_code': '520400',
      'name': '紫云苗族布依族自治县'
    }
    ]
  },
  {
    'area_id': '38604',
    'code': '522200',
    'p_code': '520000',
    'name': '铜仁市',
    'children': [{
      'area_id': '38605',
      'code': '522201',
      'p_code': '522200',
      'name': '碧江区'
    },
    {
      'area_id': '38619',
      'code': '522222',
      'p_code': '522200',
      'name': '江口县'
    },
    {
      'area_id': '38629',
      'code': '522223',
      'p_code': '522200',
      'name': '玉屏侗族自治县'
    },
    {
      'area_id': '38638',
      'code': '522224',
      'p_code': '522200',
      'name': '石阡县'
    },
    {
      'area_id': '38657',
      'code': '522225',
      'p_code': '522200',
      'name': '思南县'
    },
    {
      'area_id': '38685',
      'code': '522226',
      'p_code': '522200',
      'name': '印江土家族苗族自治县'
    },
    {
      'area_id': '38705',
      'code': '522227',
      'p_code': '522200',
      'name': '德江县'
    },
    {
      'area_id': '38727',
      'code': '522228',
      'p_code': '522200',
      'name': '沿河土家族自治县'
    },
    {
      'area_id': '38750',
      'code': '522229',
      'p_code': '522200',
      'name': '松桃苗族自治县'
    },
    {
      'area_id': '38779',
      'code': '522230',
      'p_code': '522200',
      'name': '万山区'
    }
    ]
  },
  {
    'area_id': '38789',
    'code': '522300',
    'p_code': '520000',
    'name': '黔西南布依族苗族自治州',
    'children': [{
      'area_id': '38790',
      'code': '522301',
      'p_code': '522300',
      'name': '兴义市'
    },
    {
      'area_id': '38821',
      'code': '522322',
      'p_code': '522300',
      'name': '兴仁县'
    },
    {
      'area_id': '38840',
      'code': '522323',
      'p_code': '522300',
      'name': '普安县'
    },
    {
      'area_id': '38855',
      'code': '522324',
      'p_code': '522300',
      'name': '晴隆县'
    },
    {
      'area_id': '38870',
      'code': '522325',
      'p_code': '522300',
      'name': '贞丰县'
    },
    {
      'area_id': '38884',
      'code': '522326',
      'p_code': '522300',
      'name': '望谟县'
    },
    {
      'area_id': '38903',
      'code': '522327',
      'p_code': '522300',
      'name': '册亨县'
    },
    {
      'area_id': '38918',
      'code': '522328',
      'p_code': '522300',
      'name': '安龙县'
    }
    ]
  },
  {
    'area_id': '38936',
    'code': '522400',
    'p_code': '520000',
    'name': '毕节市',
    'children': [{
      'area_id': '38937',
      'code': '522401',
      'p_code': '522400',
      'name': '七星关区'
    },
    {
      'area_id': '38983',
      'code': '522422',
      'p_code': '522400',
      'name': '大方县'
    },
    {
      'area_id': '39021',
      'code': '522423',
      'p_code': '522400',
      'name': '黔西县'
    },
    {
      'area_id': '39053',
      'code': '522424',
      'p_code': '522400',
      'name': '金沙县'
    },
    {
      'area_id': '39079',
      'code': '522425',
      'p_code': '522400',
      'name': '织金县'
    },
    {
      'area_id': '39112',
      'code': '522426',
      'p_code': '522400',
      'name': '纳雍县'
    },
    {
      'area_id': '39139',
      'code': '522427',
      'p_code': '522400',
      'name': '威宁彝族回族苗族自治县'
    },
    {
      'area_id': '39175',
      'code': '522428',
      'p_code': '522400',
      'name': '赫章县'
    }
    ]
  },
  {
    'area_id': '39203',
    'code': '522600',
    'p_code': '520000',
    'name': '黔东南苗族侗族自治州',
    'children': [{
      'area_id': '39204',
      'code': '522601',
      'p_code': '522600',
      'name': '凯里市'
    },
    {
      'area_id': '39223',
      'code': '522622',
      'p_code': '522600',
      'name': '黄平县'
    },
    {
      'area_id': '39235',
      'code': '522623',
      'p_code': '522600',
      'name': '施秉县'
    },
    {
      'area_id': '39244',
      'code': '522624',
      'p_code': '522600',
      'name': '三穗县'
    },
    {
      'area_id': '39254',
      'code': '522625',
      'p_code': '522600',
      'name': '镇远县'
    },
    {
      'area_id': '39267',
      'code': '522626',
      'p_code': '522600',
      'name': '岑巩县'
    },
    {
      'area_id': '39279',
      'code': '522627',
      'p_code': '522600',
      'name': '天柱县'
    },
    {
      'area_id': '39296',
      'code': '522628',
      'p_code': '522600',
      'name': '锦屏县'
    },
    {
      'area_id': '39312',
      'code': '522629',
      'p_code': '522600',
      'name': '剑河县'
    },
    {
      'area_id': '39325',
      'code': '522630',
      'p_code': '522600',
      'name': '台江县'
    },
    {
      'area_id': '39334',
      'code': '522631',
      'p_code': '522600',
      'name': '黎平县'
    },
    {
      'area_id': '39360',
      'code': '522632',
      'p_code': '522600',
      'name': '榕江县'
    },
    {
      'area_id': '39380',
      'code': '522633',
      'p_code': '522600',
      'name': '从江县'
    },
    {
      'area_id': '39402',
      'code': '522634',
      'p_code': '522600',
      'name': '雷山县'
    },
    {
      'area_id': '39411',
      'code': '522635',
      'p_code': '522600',
      'name': '麻江县'
    },
    {
      'area_id': '39418',
      'code': '522636',
      'p_code': '522600',
      'name': '丹寨县'
    }
    ]
  },
  {
    'area_id': '39425',
    'code': '522700',
    'p_code': '520000',
    'name': '黔南布依族苗族自治州',
    'children': [{
      'area_id': '39426',
      'code': '522701',
      'p_code': '522700',
      'name': '都匀市'
    },
    {
      'area_id': '39449',
      'code': '522702',
      'p_code': '522700',
      'name': '福泉市'
    },
    {
      'area_id': '39467',
      'code': '522722',
      'p_code': '522700',
      'name': '荔波县'
    },
    {
      'area_id': '39485',
      'code': '522723',
      'p_code': '522700',
      'name': '贵定县'
    },
    {
      'area_id': '39506',
      'code': '522725',
      'p_code': '522700',
      'name': '瓮安县'
    },
    {
      'area_id': '39520',
      'code': '522726',
      'p_code': '522700',
      'name': '独山县'
    },
    {
      'area_id': '39529',
      'code': '522727',
      'p_code': '522700',
      'name': '平塘县'
    },
    {
      'area_id': '39549',
      'code': '522728',
      'p_code': '522700',
      'name': '罗甸县'
    },
    {
      'area_id': '39576',
      'code': '522729',
      'p_code': '522700',
      'name': '长顺县'
    },
    {
      'area_id': '39594',
      'code': '522730',
      'p_code': '522700',
      'name': '龙里县'
    },
    {
      'area_id': '39609',
      'code': '522731',
      'p_code': '522700',
      'name': '惠水县'
    },
    {
      'area_id': '39635',
      'code': '522732',
      'p_code': '522700',
      'name': '三都水族自治县'
    }
    ]
  }
  ]
},
{
  'area_id': '39657',
  'code': '530000',
  'p_code': '0',
  'name': '云南省',
  'children': [{
    'area_id': '39658',
    'code': '530100',
    'p_code': '530000',
    'name': '昆明市',
    'children': [{
      'area_id': '39659',
      'code': '530102',
      'p_code': '530100',
      'name': '五华区'
    },
    {
      'area_id': '39671',
      'code': '530103',
      'p_code': '530100',
      'name': '盘龙区'
    },
    {
      'area_id': '39684',
      'code': '530111',
      'p_code': '530100',
      'name': '官渡区'
    },
    {
      'area_id': '39696',
      'code': '530112',
      'p_code': '530100',
      'name': '西山区'
    },
    {
      'area_id': '39708',
      'code': '530113',
      'p_code': '530100',
      'name': '东川区'
    },
    {
      'area_id': '39717',
      'code': '530121',
      'p_code': '530100',
      'name': '呈贡区'
    },
    {
      'area_id': '39728',
      'code': '530122',
      'p_code': '530100',
      'name': '晋宁县'
    },
    {
      'area_id': '39736',
      'code': '530124',
      'p_code': '530100',
      'name': '富民县'
    },
    {
      'area_id': '39743',
      'code': '530125',
      'p_code': '530100',
      'name': '宜良县'
    },
    {
      'area_id': '39753',
      'code': '530126',
      'p_code': '530100',
      'name': '石林彝族自治县'
    },
    {
      'area_id': '39759',
      'code': '530127',
      'p_code': '530100',
      'name': '嵩明县'
    },
    {
      'area_id': '39764',
      'code': '530128',
      'p_code': '530100',
      'name': '禄劝彝族苗族自治县'
    },
    {
      'area_id': '39782',
      'code': '530129',
      'p_code': '530100',
      'name': '寻甸回族彝族自治县'
    },
    {
      'area_id': '39798',
      'code': '530181',
      'p_code': '530100',
      'name': '安宁市'
    }
    ]
  },
  {
    'area_id': '39808',
    'code': '530300',
    'p_code': '530000',
    'name': '曲靖市',
    'children': [{
      'area_id': '39809',
      'code': '530302',
      'p_code': '530300',
      'name': '麒麟区'
    },
    {
      'area_id': '39821',
      'code': '530321',
      'p_code': '530300',
      'name': '马龙县'
    },
    {
      'area_id': '39830',
      'code': '530322',
      'p_code': '530300',
      'name': '陆良县'
    },
    {
      'area_id': '39842',
      'code': '530323',
      'p_code': '530300',
      'name': '师宗县'
    },
    {
      'area_id': '39851',
      'code': '530324',
      'p_code': '530300',
      'name': '罗平县'
    },
    {
      'area_id': '39864',
      'code': '530325',
      'p_code': '530300',
      'name': '富源县'
    },
    {
      'area_id': '39876',
      'code': '530326',
      'p_code': '530300',
      'name': '会泽县'
    },
    {
      'area_id': '39898',
      'code': '530328',
      'p_code': '530300',
      'name': '沾益区'
    },
    {
      'area_id': '39908',
      'code': '530381',
      'p_code': '530300',
      'name': '宣威市'
    }
    ]
  },
  {
    'area_id': '39935',
    'code': '530400',
    'p_code': '530000',
    'name': '玉溪市',
    'children': [{
      'area_id': '39936',
      'code': '530402',
      'p_code': '530400',
      'name': '红塔区'
    },
    {
      'area_id': '39948',
      'code': '530421',
      'p_code': '530400',
      'name': '江川区'
    },
    {
      'area_id': '39956',
      'code': '530422',
      'p_code': '530400',
      'name': '澄江县'
    },
    {
      'area_id': '39963',
      'code': '530423',
      'p_code': '530400',
      'name': '通海县'
    },
    {
      'area_id': '39973',
      'code': '530424',
      'p_code': '530400',
      'name': '华宁县'
    },
    {
      'area_id': '39979',
      'code': '530425',
      'p_code': '530400',
      'name': '易门县'
    },
    {
      'area_id': '39987',
      'code': '530426',
      'p_code': '530400',
      'name': '峨山彝族自治县'
    },
    {
      'area_id': '39996',
      'code': '530427',
      'p_code': '530400',
      'name': '新平彝族傣族自治县'
    },
    {
      'area_id': '40009',
      'code': '530428',
      'p_code': '530400',
      'name': '元江哈尼族彝族傣族自治县'
    }
    ]
  },
  {
    'area_id': '40020',
    'code': '530500',
    'p_code': '530000',
    'name': '保山市',
    'children': [{
      'area_id': '40021',
      'code': '530502',
      'p_code': '530500',
      'name': '隆阳区'
    },
    {
      'area_id': '40042',
      'code': '530521',
      'p_code': '530500',
      'name': '施甸县'
    },
    {
      'area_id': '40057',
      'code': '530522',
      'p_code': '530500',
      'name': '腾冲市'
    },
    {
      'area_id': '40076',
      'code': '530523',
      'p_code': '530500',
      'name': '龙陵县'
    },
    {
      'area_id': '40087',
      'code': '530524',
      'p_code': '530500',
      'name': '昌宁县'
    }
    ]
  },
  {
    'area_id': '40101',
    'code': '530600',
    'p_code': '530000',
    'name': '昭通市',
    'children': [{
      'area_id': '40102',
      'code': '530602',
      'p_code': '530600',
      'name': '昭阳区'
    },
    {
      'area_id': '40123',
      'code': '530621',
      'p_code': '530600',
      'name': '鲁甸县'
    },
    {
      'area_id': '40136',
      'code': '530622',
      'p_code': '530600',
      'name': '巧家县'
    },
    {
      'area_id': '40153',
      'code': '530623',
      'p_code': '530600',
      'name': '盐津县'
    },
    {
      'area_id': '40164',
      'code': '530624',
      'p_code': '530600',
      'name': '大关县'
    },
    {
      'area_id': '40174',
      'code': '530625',
      'p_code': '530600',
      'name': '永善县'
    },
    {
      'area_id': '40190',
      'code': '530626',
      'p_code': '530600',
      'name': '绥江县'
    },
    {
      'area_id': '40196',
      'code': '530627',
      'p_code': '530600',
      'name': '镇雄县'
    },
    {
      'area_id': '40225',
      'code': '530628',
      'p_code': '530600',
      'name': '彝良县'
    },
    {
      'area_id': '40241',
      'code': '530629',
      'p_code': '530600',
      'name': '威信县'
    },
    {
      'area_id': '40252',
      'code': '530630',
      'p_code': '530600',
      'name': '水富县'
    }
    ]
  },
  {
    'area_id': '40257',
    'code': '530700',
    'p_code': '530000',
    'name': '丽江市',
    'children': [{
      'area_id': '40258',
      'code': '530702',
      'p_code': '530700',
      'name': '古城区'
    },
    {
      'area_id': '40268',
      'code': '530721',
      'p_code': '530700',
      'name': '玉龙纳西族自治县'
    },
    {
      'area_id': '40285',
      'code': '530722',
      'p_code': '530700',
      'name': '永胜县'
    },
    {
      'area_id': '40301',
      'code': '530723',
      'p_code': '530700',
      'name': '华坪县'
    },
    {
      'area_id': '40310',
      'code': '530724',
      'p_code': '530700',
      'name': '宁蒗彝族自治县'
    }
    ]
  },
  {
    'area_id': '40326',
    'code': '530800',
    'p_code': '530000',
    'name': '普洱市',
    'children': [{
      'area_id': '40327',
      'code': '530802',
      'p_code': '530800',
      'name': '思茅区'
    },
    {
      'area_id': '40335',
      'code': '530821',
      'p_code': '530800',
      'name': '宁洱哈尼族彝族自治县'
    },
    {
      'area_id': '40345',
      'code': '530822',
      'p_code': '530800',
      'name': '墨江哈尼族自治县'
    },
    {
      'area_id': '40361',
      'code': '530823',
      'p_code': '530800',
      'name': '景东彝族自治县'
    },
    {
      'area_id': '40375',
      'code': '530824',
      'p_code': '530800',
      'name': '景谷傣族彝族自治县'
    },
    {
      'area_id': '40386',
      'code': '530825',
      'p_code': '530800',
      'name': '镇沅彝族哈尼族拉祜族自治县'
    },
    {
      'area_id': '40396',
      'code': '530826',
      'p_code': '530800',
      'name': '江城哈尼族彝族自治县'
    },
    {
      'area_id': '40404',
      'code': '530827',
      'p_code': '530800',
      'name': '孟连傣族拉祜族佤族自治县'
    },
    {
      'area_id': '40411',
      'code': '530828',
      'p_code': '530800',
      'name': '澜沧拉祜族自治县'
    },
    {
      'area_id': '40432',
      'code': '530829',
      'p_code': '530800',
      'name': '西盟佤族自治县'
    }
    ]
  },
  {
    'area_id': '40440',
    'code': '530900',
    'p_code': '530000',
    'name': '临沧市',
    'children': [{
      'area_id': '40441',
      'code': '530902',
      'p_code': '530900',
      'name': '临翔区'
    },
    {
      'area_id': '40452',
      'code': '530921',
      'p_code': '530900',
      'name': '凤庆县'
    },
    {
      'area_id': '40466',
      'code': '530922',
      'p_code': '530900',
      'name': '云县'
    },
    {
      'area_id': '40481',
      'code': '530923',
      'p_code': '530900',
      'name': '永德县'
    },
    {
      'area_id': '40493',
      'code': '530924',
      'p_code': '530900',
      'name': '镇康县'
    },
    {
      'area_id': '40501',
      'code': '530925',
      'p_code': '530900',
      'name': '双江拉祜族佤族布朗族傣族自治县'
    },
    {
      'area_id': '40508',
      'code': '530926',
      'p_code': '530900',
      'name': '耿马傣族佤族自治县'
    },
    {
      'area_id': '40521',
      'code': '530927',
      'p_code': '530900',
      'name': '沧源佤族自治县'
    }
    ]
  },
  {
    'area_id': '40533',
    'code': '532300',
    'p_code': '530000',
    'name': '楚雄彝族自治州',
    'children': [{
      'area_id': '40534',
      'code': '532301',
      'p_code': '532300',
      'name': '楚雄市'
    },
    {
      'area_id': '40550',
      'code': '532322',
      'p_code': '532300',
      'name': '双柏县'
    },
    {
      'area_id': '40559',
      'code': '532323',
      'p_code': '532300',
      'name': '牟定县'
    },
    {
      'area_id': '40567',
      'code': '532324',
      'p_code': '532300',
      'name': '南华县'
    },
    {
      'area_id': '40578',
      'code': '532325',
      'p_code': '532300',
      'name': '姚安县'
    },
    {
      'area_id': '40588',
      'code': '532326',
      'p_code': '532300',
      'name': '大姚县'
    },
    {
      'area_id': '40601',
      'code': '532327',
      'p_code': '532300',
      'name': '永仁县'
    },
    {
      'area_id': '40609',
      'code': '532328',
      'p_code': '532300',
      'name': '元谋县'
    },
    {
      'area_id': '40620',
      'code': '532329',
      'p_code': '532300',
      'name': '武定县'
    },
    {
      'area_id': '40632',
      'code': '532331',
      'p_code': '532300',
      'name': '禄丰县'
    }
    ]
  },
  {
    'area_id': '40647',
    'code': '532500',
    'p_code': '530000',
    'name': '红河哈尼族彝族自治州',
    'children': [{
      'area_id': '40648',
      'code': '532501',
      'p_code': '532500',
      'name': '个旧市'
    },
    {
      'area_id': '40659',
      'code': '532502',
      'p_code': '532500',
      'name': '开远市'
    },
    {
      'area_id': '40667',
      'code': '532522',
      'p_code': '532500',
      'name': '蒙自市'
    },
    {
      'area_id': '40679',
      'code': '532523',
      'p_code': '532500',
      'name': '屏边苗族自治县'
    },
    {
      'area_id': '40687',
      'code': '532524',
      'p_code': '532500',
      'name': '建水县'
    },
    {
      'area_id': '40702',
      'code': '532525',
      'p_code': '532500',
      'name': '石屏县'
    },
    {
      'area_id': '40712',
      'code': '532526',
      'p_code': '532500',
      'name': '弥勒市'
    },
    {
      'area_id': '40725',
      'code': '532527',
      'p_code': '532500',
      'name': '泸西县'
    },
    {
      'area_id': '40734',
      'code': '532528',
      'p_code': '532500',
      'name': '元阳县'
    },
    {
      'area_id': '40749',
      'code': '532529',
      'p_code': '532500',
      'name': '红河县'
    },
    {
      'area_id': '40763',
      'code': '532530',
      'p_code': '532500',
      'name': '金平苗族瑶族傣族自治县'
    },
    {
      'area_id': '40777',
      'code': '532531',
      'p_code': '532500',
      'name': '绿春县'
    },
    {
      'area_id': '40787',
      'code': '532532',
      'p_code': '532500',
      'name': '河口瑶族自治县'
    }
    ]
  },
  {
    'area_id': '40794',
    'code': '532600',
    'p_code': '530000',
    'name': '文山壮族苗族自治州',
    'children': [{
      'area_id': '40795',
      'code': '532621',
      'p_code': '532600',
      'name': '文山市'
    },
    {
      'area_id': '40815',
      'code': '532622',
      'p_code': '532600',
      'name': '砚山县'
    },
    {
      'area_id': '40830',
      'code': '532623',
      'p_code': '532600',
      'name': '西畴县'
    },
    {
      'area_id': '40840',
      'code': '532624',
      'p_code': '532600',
      'name': '麻栗坡县'
    },
    {
      'area_id': '40852',
      'code': '532625',
      'p_code': '532600',
      'name': '马关县'
    },
    {
      'area_id': '40866',
      'code': '532626',
      'p_code': '532600',
      'name': '丘北县'
    },
    {
      'area_id': '40879',
      'code': '532627',
      'p_code': '532600',
      'name': '广南县'
    },
    {
      'area_id': '40898',
      'code': '532628',
      'p_code': '532600',
      'name': '富宁县'
    }
    ]
  },
  {
    'area_id': '40912',
    'code': '532800',
    'p_code': '530000',
    'name': '西双版纳傣族自治州',
    'children': [{
      'area_id': '40913',
      'code': '532801',
      'p_code': '532800',
      'name': '景洪市'
    },
    {
      'area_id': '40933',
      'code': '532822',
      'p_code': '532800',
      'name': '勐海县'
    },
    {
      'area_id': '40946',
      'code': '532823',
      'p_code': '532800',
      'name': '勐腊县'
    }
    ]
  },
  {
    'area_id': '40961',
    'code': '532900',
    'p_code': '530000',
    'name': '大理白族自治州',
    'children': [{
      'area_id': '40962',
      'code': '532901',
      'p_code': '532900',
      'name': '大理市'
    },
    {
      'area_id': '40976',
      'code': '532922',
      'p_code': '532900',
      'name': '漾濞彝族自治县'
    },
    {
      'area_id': '40986',
      'code': '532923',
      'p_code': '532900',
      'name': '祥云县'
    },
    {
      'area_id': '40997',
      'code': '532924',
      'p_code': '532900',
      'name': '宾川县'
    },
    {
      'area_id': '41008',
      'code': '532925',
      'p_code': '532900',
      'name': '弥渡县'
    },
    {
      'area_id': '41017',
      'code': '532926',
      'p_code': '532900',
      'name': '南涧彝族自治县'
    },
    {
      'area_id': '41026',
      'code': '532927',
      'p_code': '532900',
      'name': '巍山彝族回族自治县'
    },
    {
      'area_id': '41037',
      'code': '532928',
      'p_code': '532900',
      'name': '永平县'
    },
    {
      'area_id': '41045',
      'code': '532929',
      'p_code': '532900',
      'name': '云龙县'
    },
    {
      'area_id': '41057',
      'code': '532930',
      'p_code': '532900',
      'name': '洱源县'
    },
    {
      'area_id': '41067',
      'code': '532931',
      'p_code': '532900',
      'name': '剑川县'
    },
    {
      'area_id': '41076',
      'code': '532932',
      'p_code': '532900',
      'name': '鹤庆县'
    }
    ]
  },
  {
    'area_id': '41086',
    'code': '533100',
    'p_code': '530000',
    'name': '德宏傣族景颇族自治州',
    'children': [{
      'area_id': '41087',
      'code': '533102',
      'p_code': '533100',
      'name': '瑞丽市'
    },
    {
      'area_id': '41094',
      'code': '533103',
      'p_code': '533100',
      'name': '芒市'
    },
    {
      'area_id': '41107',
      'code': '533122',
      'p_code': '533100',
      'name': '梁河县'
    },
    {
      'area_id': '41117',
      'code': '533123',
      'p_code': '533100',
      'name': '盈江县'
    },
    {
      'area_id': '41133',
      'code': '533124',
      'p_code': '533100',
      'name': '陇川县'
    }
    ]
  },
  {
    'area_id': '41143',
    'code': '533300',
    'p_code': '530000',
    'name': '怒江傈僳族自治州',
    'children': [{
      'area_id': '41144',
      'code': '533321',
      'p_code': '533300',
      'name': '泸水市'
    },
    {
      'area_id': '41154',
      'code': '533323',
      'p_code': '533300',
      'name': '福贡县'
    },
    {
      'area_id': '41162',
      'code': '533324',
      'p_code': '533300',
      'name': '贡山独龙族怒族自治县'
    },
    {
      'area_id': '41168',
      'code': '533325',
      'p_code': '533300',
      'name': '兰坪白族普米族自治县'
    }
    ]
  },
  {
    'area_id': '41177',
    'code': '533400',
    'p_code': '530000',
    'name': '迪庆藏族自治州',
    'children': [{
      'area_id': '41178',
      'code': '533421',
      'p_code': '533400',
      'name': '香格里拉市'
    },
    {
      'area_id': '41190',
      'code': '533422',
      'p_code': '533400',
      'name': '德钦县'
    },
    {
      'area_id': '41199',
      'code': '533423',
      'p_code': '533400',
      'name': '维西傈僳族自治县'
    }
    ]
  }
  ]
},
{
  'area_id': '41210',
  'code': '540000',
  'p_code': '0',
  'name': '西藏自治区',
  'children': [{
    'area_id': '41211',
    'code': '540100',
    'p_code': '540000',
    'name': '拉萨市',
    'children': [{
      'area_id': '41212',
      'code': '540102',
      'p_code': '540100',
      'name': '城关区'
    },
    {
      'area_id': '41225',
      'code': '540121',
      'p_code': '540100',
      'name': '林周县'
    },
    {
      'area_id': '41236',
      'code': '540122',
      'p_code': '540100',
      'name': '当雄县'
    },
    {
      'area_id': '41245',
      'code': '540123',
      'p_code': '540100',
      'name': '尼木县'
    },
    {
      'area_id': '41254',
      'code': '540124',
      'p_code': '540100',
      'name': '曲水县'
    },
    {
      'area_id': '41261',
      'code': '540125',
      'p_code': '540100',
      'name': '堆龙德庆区'
    },
    {
      'area_id': '41269',
      'code': '540126',
      'p_code': '540100',
      'name': '达孜县'
    },
    {
      'area_id': '41276',
      'code': '540127',
      'p_code': '540100',
      'name': '墨竹工卡县'
    }
    ]
  },
  {
    'area_id': '41285',
    'code': '542100',
    'p_code': '540000',
    'name': '昌都市',
    'children': [{
      'area_id': '41286',
      'code': '542121',
      'p_code': '542100',
      'name': '卡若区'
    },
    {
      'area_id': '41302',
      'code': '542122',
      'p_code': '542100',
      'name': '江达县'
    },
    {
      'area_id': '41316',
      'code': '542123',
      'p_code': '542100',
      'name': '贡觉县'
    },
    {
      'area_id': '41329',
      'code': '542124',
      'p_code': '542100',
      'name': '类乌齐县'
    },
    {
      'area_id': '41340',
      'code': '542125',
      'p_code': '542100',
      'name': '丁青县'
    },
    {
      'area_id': '41354',
      'code': '542126',
      'p_code': '542100',
      'name': '察雅县'
    },
    {
      'area_id': '41368',
      'code': '542127',
      'p_code': '542100',
      'name': '八宿县'
    },
    {
      'area_id': '41383',
      'code': '542128',
      'p_code': '542100',
      'name': '左贡县'
    },
    {
      'area_id': '41394',
      'code': '542129',
      'p_code': '542100',
      'name': '芒康县'
    },
    {
      'area_id': '41411',
      'code': '542132',
      'p_code': '542100',
      'name': '洛隆县'
    },
    {
      'area_id': '41423',
      'code': '542133',
      'p_code': '542100',
      'name': '边坝县'
    }
    ]
  },
  {
    'area_id': '41435',
    'code': '542200',
    'p_code': '540000',
    'name': '山南市',
    'children': [{
      'area_id': '41436',
      'code': '542221',
      'p_code': '542200',
      'name': '乃东区'
    },
    {
      'area_id': '41444',
      'code': '542222',
      'p_code': '542200',
      'name': '扎囊县'
    },
    {
      'area_id': '41450',
      'code': '542223',
      'p_code': '542200',
      'name': '贡嘎县'
    },
    {
      'area_id': '41459',
      'code': '542224',
      'p_code': '542200',
      'name': '桑日县'
    },
    {
      'area_id': '41464',
      'code': '542225',
      'p_code': '542200',
      'name': '琼结县'
    },
    {
      'area_id': '41469',
      'code': '542226',
      'p_code': '542200',
      'name': '曲松县'
    },
    {
      'area_id': '41475',
      'code': '542227',
      'p_code': '542200',
      'name': '措美县'
    },
    {
      'area_id': '41480',
      'code': '542228',
      'p_code': '542200',
      'name': '洛扎县'
    },
    {
      'area_id': '41488',
      'code': '542229',
      'p_code': '542200',
      'name': '加查县'
    },
    {
      'area_id': '41496',
      'code': '542231',
      'p_code': '542200',
      'name': '隆子县'
    },
    {
      'area_id': '41508',
      'code': '542232',
      'p_code': '542200',
      'name': '错那县'
    },
    {
      'area_id': '41519',
      'code': '542233',
      'p_code': '542200',
      'name': '浪卡子县'
    }
    ]
  },
  {
    'area_id': '41530',
    'code': '542300',
    'p_code': '540000',
    'name': '日喀则市',
    'children': [{
      'area_id': '41531',
      'code': '542301',
      'p_code': '542300',
      'name': '桑珠孜区'
    },
    {
      'area_id': '41544',
      'code': '542322',
      'p_code': '542300',
      'name': '南木林县'
    },
    {
      'area_id': '41562',
      'code': '542323',
      'p_code': '542300',
      'name': '江孜县'
    },
    {
      'area_id': '41582',
      'code': '542324',
      'p_code': '542300',
      'name': '定日县'
    },
    {
      'area_id': '41596',
      'code': '542325',
      'p_code': '542300',
      'name': '萨迦县'
    },
    {
      'area_id': '41608',
      'code': '542326',
      'p_code': '542300',
      'name': '拉孜县'
    },
    {
      'area_id': '41620',
      'code': '542327',
      'p_code': '542300',
      'name': '昂仁县'
    },
    {
      'area_id': '41638',
      'code': '542328',
      'p_code': '542300',
      'name': '谢通门县'
    },
    {
      'area_id': '41658',
      'code': '542329',
      'p_code': '542300',
      'name': '白朗县'
    },
    {
      'area_id': '41670',
      'code': '542330',
      'p_code': '542300',
      'name': '仁布县'
    },
    {
      'area_id': '41680',
      'code': '542331',
      'p_code': '542300',
      'name': '康马县'
    },
    {
      'area_id': '41690',
      'code': '542332',
      'p_code': '542300',
      'name': '定结县'
    },
    {
      'area_id': '41701',
      'code': '542333',
      'p_code': '542300',
      'name': '仲巴县'
    },
    {
      'area_id': '41715',
      'code': '542334',
      'p_code': '542300',
      'name': '亚东县'
    },
    {
      'area_id': '41723',
      'code': '542335',
      'p_code': '542300',
      'name': '吉隆县'
    },
    {
      'area_id': '41729',
      'code': '542336',
      'p_code': '542300',
      'name': '聂拉木县'
    },
    {
      'area_id': '41737',
      'code': '542337',
      'p_code': '542300',
      'name': '萨嘎县'
    },
    {
      'area_id': '41746',
      'code': '542338',
      'p_code': '542300',
      'name': '岗巴县'
    }
    ]
  },
  {
    'area_id': '41752',
    'code': '542400',
    'p_code': '540000',
    'name': '那曲地区',
    'children': [{
      'area_id': '41753',
      'code': '542421',
      'p_code': '542400',
      'name': '那曲县'
    },
    {
      'area_id': '41766',
      'code': '542422',
      'p_code': '542400',
      'name': '嘉黎县'
    },
    {
      'area_id': '41777',
      'code': '542423',
      'p_code': '542400',
      'name': '比如县'
    },
    {
      'area_id': '41788',
      'code': '542424',
      'p_code': '542400',
      'name': '聂荣县'
    },
    {
      'area_id': '41799',
      'code': '542425',
      'p_code': '542400',
      'name': '安多县'
    },
    {
      'area_id': '41813',
      'code': '542426',
      'p_code': '542400',
      'name': '申扎县'
    },
    {
      'area_id': '41822',
      'code': '542427',
      'p_code': '542400',
      'name': '索县'
    },
    {
      'area_id': '41833',
      'code': '542428',
      'p_code': '542400',
      'name': '班戈县'
    },
    {
      'area_id': '41844',
      'code': '542429',
      'p_code': '542400',
      'name': '巴青县'
    },
    {
      'area_id': '41855',
      'code': '542430',
      'p_code': '542400',
      'name': '尼玛县'
    },
    {
      'area_id': '41870',
      'code': '542432',
      'p_code': '542400',
      'name': '双湖县'
    }
    ]
  },
  {
    'area_id': '41878',
    'code': '542500',
    'p_code': '540000',
    'name': '阿里地区',
    'children': [{
      'area_id': '41879',
      'code': '542521',
      'p_code': '542500',
      'name': '普兰县'
    },
    {
      'area_id': '41883',
      'code': '542522',
      'p_code': '542500',
      'name': '札达县'
    },
    {
      'area_id': '41891',
      'code': '542523',
      'p_code': '542500',
      'name': '噶尔县'
    },
    {
      'area_id': '41897',
      'code': '542524',
      'p_code': '542500',
      'name': '日土县'
    },
    {
      'area_id': '41903',
      'code': '542525',
      'p_code': '542500',
      'name': '革吉县'
    },
    {
      'area_id': '41909',
      'code': '542526',
      'p_code': '542500',
      'name': '改则县'
    },
    {
      'area_id': '41917',
      'code': '542527',
      'p_code': '542500',
      'name': '措勤县'
    }
    ]
  },
  {
    'area_id': '41923',
    'code': '542600',
    'p_code': '540000',
    'name': '林芝市',
    'children': [{
      'area_id': '41924',
      'code': '542621',
      'p_code': '542600',
      'name': '巴宜区'
    },
    {
      'area_id': '41932',
      'code': '542622',
      'p_code': '542600',
      'name': '工布江达县'
    },
    {
      'area_id': '41942',
      'code': '542623',
      'p_code': '542600',
      'name': '米林县'
    },
    {
      'area_id': '41951',
      'code': '542624',
      'p_code': '542600',
      'name': '墨脱县'
    },
    {
      'area_id': '41960',
      'code': '542625',
      'p_code': '542600',
      'name': '波密县'
    },
    {
      'area_id': '41971',
      'code': '542626',
      'p_code': '542600',
      'name': '察隅县'
    },
    {
      'area_id': '41978',
      'code': '542627',
      'p_code': '542600',
      'name': '朗县'
    }
    ]
  }
  ]
},
{
  'area_id': '41985',
  'code': '610000',
  'p_code': '0',
  'name': '陕西省',
  'children': [{
    'area_id': '41986',
    'code': '610100',
    'p_code': '610000',
    'name': '西安市',
    'children': [{
      'area_id': '41987',
      'code': '610102',
      'p_code': '610100',
      'name': '新城区'
    },
    {
      'area_id': '41997',
      'code': '610103',
      'p_code': '610100',
      'name': '碑林区'
    },
    {
      'area_id': '42006',
      'code': '610104',
      'p_code': '610100',
      'name': '莲湖区'
    },
    {
      'area_id': '42016',
      'code': '610111',
      'p_code': '610100',
      'name': '灞桥区'
    },
    {
      'area_id': '42026',
      'code': '610112',
      'p_code': '610100',
      'name': '未央区'
    },
    {
      'area_id': '42039',
      'code': '610113',
      'p_code': '610100',
      'name': '雁塔区'
    },
    {
      'area_id': '42048',
      'code': '610114',
      'p_code': '610100',
      'name': '阎良区'
    },
    {
      'area_id': '42056',
      'code': '610115',
      'p_code': '610100',
      'name': '临潼区'
    },
    {
      'area_id': '42080',
      'code': '610116',
      'p_code': '610100',
      'name': '长安区'
    },
    {
      'area_id': '42106',
      'code': '610122',
      'p_code': '610100',
      'name': '蓝田县'
    },
    {
      'area_id': '42129',
      'code': '610124',
      'p_code': '610100',
      'name': '周至县'
    },
    {
      'area_id': '42152',
      'code': '610125',
      'p_code': '610100',
      'name': '户县'
    },
    {
      'area_id': '42169',
      'code': '610126',
      'p_code': '610100',
      'name': '高陵区'
    }
    ]
  },
  {
    'area_id': '42178',
    'code': '610200',
    'p_code': '610000',
    'name': '铜川市',
    'children': [{
      'area_id': '42179',
      'code': '610202',
      'p_code': '610200',
      'name': '王益区'
    },
    {
      'area_id': '42187',
      'code': '610203',
      'p_code': '610200',
      'name': '印台区'
    },
    {
      'area_id': '42198',
      'code': '610204',
      'p_code': '610200',
      'name': '耀州区'
    },
    {
      'area_id': '42214',
      'code': '610222',
      'p_code': '610200',
      'name': '宜君县'
    }
    ]
  },
  {
    'area_id': '42224',
    'code': '610300',
    'p_code': '610000',
    'name': '宝鸡市',
    'children': [{
      'area_id': '42225',
      'code': '610302',
      'p_code': '610300',
      'name': '渭滨区'
    },
    {
      'area_id': '42236',
      'code': '610303',
      'p_code': '610300',
      'name': '金台区'
    },
    {
      'area_id': '42248',
      'code': '610304',
      'p_code': '610300',
      'name': '陈仓区'
    },
    {
      'area_id': '42267',
      'code': '610322',
      'p_code': '610300',
      'name': '凤翔县'
    },
    {
      'area_id': '42280',
      'code': '610323',
      'p_code': '610300',
      'name': '岐山县'
    },
    {
      'area_id': '42291',
      'code': '610324',
      'p_code': '610300',
      'name': '扶风县'
    },
    {
      'area_id': '42300',
      'code': '610326',
      'p_code': '610300',
      'name': '眉县'
    },
    {
      'area_id': '42311',
      'code': '610327',
      'p_code': '610300',
      'name': '陇县'
    },
    {
      'area_id': '42324',
      'code': '610328',
      'p_code': '610300',
      'name': '千阳县'
    },
    {
      'area_id': '42333',
      'code': '610329',
      'p_code': '610300',
      'name': '麟游县'
    },
    {
      'area_id': '42341',
      'code': '610330',
      'p_code': '610300',
      'name': '凤县'
    },
    {
      'area_id': '42353',
      'code': '610331',
      'p_code': '610300',
      'name': '太白县'
    }
    ]
  },
  {
    'area_id': '42361',
    'code': '610400',
    'p_code': '610000',
    'name': '咸阳市',
    'children': [{
      'area_id': '42362',
      'code': '610402',
      'p_code': '610400',
      'name': '秦都区'
    },
    {
      'area_id': '42375',
      'code': '610403',
      'p_code': '610400',
      'name': '杨陵区'
    },
    {
      'area_id': '42381',
      'code': '610404',
      'p_code': '610400',
      'name': '渭城区'
    },
    {
      'area_id': '42392',
      'code': '610422',
      'p_code': '610400',
      'name': '三原县'
    },
    {
      'area_id': '42404',
      'code': '610423',
      'p_code': '610400',
      'name': '泾阳县'
    },
    {
      'area_id': '42418',
      'code': '610424',
      'p_code': '610400',
      'name': '乾县'
    },
    {
      'area_id': '42435',
      'code': '610425',
      'p_code': '610400',
      'name': '礼泉县'
    },
    {
      'area_id': '42448',
      'code': '610426',
      'p_code': '610400',
      'name': '永寿县'
    },
    {
      'area_id': '42460',
      'code': '610427',
      'p_code': '610400',
      'name': '彬县'
    },
    {
      'area_id': '42474',
      'code': '610428',
      'p_code': '610400',
      'name': '长武县'
    },
    {
      'area_id': '42484',
      'code': '610429',
      'p_code': '610400',
      'name': '旬邑县'
    },
    {
      'area_id': '42496',
      'code': '610430',
      'p_code': '610400',
      'name': '淳化县'
    },
    {
      'area_id': '42509',
      'code': '610431',
      'p_code': '610400',
      'name': '武功县'
    },
    {
      'area_id': '42518',
      'code': '610481',
      'p_code': '610400',
      'name': '兴平市'
    }
    ]
  },
  {
    'area_id': '42532',
    'code': '610500',
    'p_code': '610000',
    'name': '渭南市',
    'children': [{
      'area_id': '42533',
      'code': '610502',
      'p_code': '610500',
      'name': '临渭区'
    },
    {
      'area_id': '42558',
      'code': '610521',
      'p_code': '610500',
      'name': '华州区'
    },
    {
      'area_id': '42569',
      'code': '610522',
      'p_code': '610500',
      'name': '潼关县'
    },
    {
      'area_id': '42576',
      'code': '610523',
      'p_code': '610500',
      'name': '大荔县'
    },
    {
      'area_id': '42598',
      'code': '610524',
      'p_code': '610500',
      'name': '合阳县'
    },
    {
      'area_id': '42611',
      'code': '610525',
      'p_code': '610500',
      'name': '澄城县'
    },
    {
      'area_id': '42622',
      'code': '610526',
      'p_code': '610500',
      'name': '蒲城县'
    },
    {
      'area_id': '42640',
      'code': '610527',
      'p_code': '610500',
      'name': '白水县'
    },
    {
      'area_id': '42651',
      'code': '610528',
      'p_code': '610500',
      'name': '富平县'
    },
    {
      'area_id': '42669',
      'code': '610581',
      'p_code': '610500',
      'name': '韩城市'
    },
    {
      'area_id': '42682',
      'code': '610582',
      'p_code': '610500',
      'name': '华阴市'
    }
    ]
  },
  {
    'area_id': '42690',
    'code': '610600',
    'p_code': '610000',
    'name': '延安市',
    'children': [{
      'area_id': '42691',
      'code': '610602',
      'p_code': '610600',
      'name': '宝塔区'
    },
    {
      'area_id': '42711',
      'code': '610621',
      'p_code': '610600',
      'name': '延长县'
    },
    {
      'area_id': '42721',
      'code': '610622',
      'p_code': '610600',
      'name': '延川县'
    },
    {
      'area_id': '42732',
      'code': '610623',
      'p_code': '610600',
      'name': '子长县'
    },
    {
      'area_id': '42743',
      'code': '610624',
      'p_code': '610600',
      'name': '安塞区'
    },
    {
      'area_id': '42753',
      'code': '610625',
      'p_code': '610600',
      'name': '志丹县'
    },
    {
      'area_id': '42762',
      'code': '610626',
      'p_code': '610600',
      'name': '吴起县'
    },
    {
      'area_id': '42772',
      'code': '610627',
      'p_code': '610600',
      'name': '甘泉县'
    },
    {
      'area_id': '42779',
      'code': '610628',
      'p_code': '610600',
      'name': '富县'
    },
    {
      'area_id': '42790',
      'code': '610629',
      'p_code': '610600',
      'name': '洛川县'
    },
    {
      'area_id': '42803',
      'code': '610630',
      'p_code': '610600',
      'name': '宜川县'
    },
    {
      'area_id': '42813',
      'code': '610631',
      'p_code': '610600',
      'name': '黄龙县'
    },
    {
      'area_id': '42821',
      'code': '610632',
      'p_code': '610600',
      'name': '黄陵县'
    }
    ]
  },
  {
    'area_id': '42829',
    'code': '610700',
    'p_code': '610000',
    'name': '汉中市',
    'children': [{
      'area_id': '42830',
      'code': '610702',
      'p_code': '610700',
      'name': '汉台区'
    },
    {
      'area_id': '42846',
      'code': '610721',
      'p_code': '610700',
      'name': '南郑县'
    },
    {
      'area_id': '42869',
      'code': '610722',
      'p_code': '610700',
      'name': '城固县'
    },
    {
      'area_id': '42889',
      'code': '610723',
      'p_code': '610700',
      'name': '洋县'
    },
    {
      'area_id': '42910',
      'code': '610724',
      'p_code': '610700',
      'name': '西乡县'
    },
    {
      'area_id': '42929',
      'code': '610725',
      'p_code': '610700',
      'name': '勉县'
    },
    {
      'area_id': '42949',
      'code': '610726',
      'p_code': '610700',
      'name': '宁强县'
    },
    {
      'area_id': '42971',
      'code': '610727',
      'p_code': '610700',
      'name': '略阳县'
    },
    {
      'area_id': '42990',
      'code': '610728',
      'p_code': '610700',
      'name': '镇巴县'
    },
    {
      'area_id': '43012',
      'code': '610729',
      'p_code': '610700',
      'name': '留坝县'
    },
    {
      'area_id': '43021',
      'code': '610730',
      'p_code': '610700',
      'name': '佛坪县'
    }
    ]
  },
  {
    'area_id': '43030',
    'code': '610800',
    'p_code': '610000',
    'name': '榆林市',
    'children': [{
      'area_id': '43031',
      'code': '610802',
      'p_code': '610800',
      'name': '榆阳区'
    },
    {
      'area_id': '43060',
      'code': '610821',
      'p_code': '610800',
      'name': '神木县'
    },
    {
      'area_id': '43076',
      'code': '610822',
      'p_code': '610800',
      'name': '府谷县'
    },
    {
      'area_id': '43092',
      'code': '610823',
      'p_code': '610800',
      'name': '横山区'
    },
    {
      'area_id': '43107',
      'code': '610824',
      'p_code': '610800',
      'name': '靖边县'
    },
    {
      'area_id': '43125',
      'code': '610825',
      'p_code': '610800',
      'name': '定边县'
    },
    {
      'area_id': '43146',
      'code': '610826',
      'p_code': '610800',
      'name': '绥德县'
    },
    {
      'area_id': '43163',
      'code': '610827',
      'p_code': '610800',
      'name': '米脂县'
    },
    {
      'area_id': '43174',
      'code': '610828',
      'p_code': '610800',
      'name': '佳县'
    },
    {
      'area_id': '43191',
      'code': '610829',
      'p_code': '610800',
      'name': '吴堡县'
    },
    {
      'area_id': '43198',
      'code': '610830',
      'p_code': '610800',
      'name': '清涧县'
    },
    {
      'area_id': '43211',
      'code': '610831',
      'p_code': '610800',
      'name': '子洲县'
    }
    ]
  },
  {
    'area_id': '43226',
    'code': '610900',
    'p_code': '610000',
    'name': '安康市',
    'children': [{
      'area_id': '43227',
      'code': '610902',
      'p_code': '610900',
      'name': '汉滨区'
    },
    {
      'area_id': '43262',
      'code': '610921',
      'p_code': '610900',
      'name': '汉阴县'
    },
    {
      'area_id': '43277',
      'code': '610922',
      'p_code': '610900',
      'name': '石泉县'
    },
    {
      'area_id': '43289',
      'code': '610923',
      'p_code': '610900',
      'name': '宁陕县'
    },
    {
      'area_id': '43302',
      'code': '610924',
      'p_code': '610900',
      'name': '紫阳县'
    },
    {
      'area_id': '43324',
      'code': '610925',
      'p_code': '610900',
      'name': '岚皋县'
    },
    {
      'area_id': '43340',
      'code': '610926',
      'p_code': '610900',
      'name': '平利县'
    },
    {
      'area_id': '43352',
      'code': '610927',
      'p_code': '610900',
      'name': '镇坪县'
    },
    {
      'area_id': '43362',
      'code': '610928',
      'p_code': '610900',
      'name': '旬阳县'
    },
    {
      'area_id': '43385',
      'code': '610929',
      'p_code': '610900',
      'name': '白河县'
    }
    ]
  },
  {
    'area_id': '43398',
    'code': '611000',
    'p_code': '610000',
    'name': '商洛市',
    'children': [{
      'area_id': '43399',
      'code': '611002',
      'p_code': '611000',
      'name': '商州区'
    },
    {
      'area_id': '43432',
      'code': '611021',
      'p_code': '611000',
      'name': '洛南县'
    },
    {
      'area_id': '43452',
      'code': '611022',
      'p_code': '611000',
      'name': '丹凤县'
    },
    {
      'area_id': '43469',
      'code': '611023',
      'p_code': '611000',
      'name': '商南县'
    },
    {
      'area_id': '43483',
      'code': '611024',
      'p_code': '611000',
      'name': '山阳县'
    },
    {
      'area_id': '43507',
      'code': '611025',
      'p_code': '611000',
      'name': '镇安县'
    },
    {
      'area_id': '43530',
      'code': '611026',
      'p_code': '611000',
      'name': '柞水县'
    }
    ]
  }
  ]
},
{
  'area_id': '43544',
  'code': '620000',
  'p_code': '0',
  'name': '甘肃省',
  'children': [{
    'area_id': '43545',
    'code': '620100',
    'p_code': '620000',
    'name': '兰州市',
    'children': [{
      'area_id': '43546',
      'code': '620102',
      'p_code': '620100',
      'name': '城关区'
    },
    {
      'area_id': '43572',
      'code': '620103',
      'p_code': '620100',
      'name': '七里河区'
    },
    {
      'area_id': '43588',
      'code': '620104',
      'p_code': '620100',
      'name': '西固区'
    },
    {
      'area_id': '43604',
      'code': '620105',
      'p_code': '620100',
      'name': '安宁区'
    },
    {
      'area_id': '43613',
      'code': '620111',
      'p_code': '620100',
      'name': '红古区'
    },
    {
      'area_id': '43621',
      'code': '620121',
      'p_code': '620100',
      'name': '永登县'
    },
    {
      'area_id': '43640',
      'code': '620122',
      'p_code': '620100',
      'name': '皋兰县'
    },
    {
      'area_id': '43648',
      'code': '620123',
      'p_code': '620100',
      'name': '榆中县'
    }
    ]
  },
  {
    'area_id': '43672',
    'code': '620200',
    'p_code': '620000',
    'name': '嘉峪关市'
  },
  {
    'area_id': '43679',
    'code': '620300',
    'p_code': '620000',
    'name': '金昌市',
    'children': [{
      'area_id': '43680',
      'code': '620302',
      'p_code': '620300',
      'name': '金川区'
    },
    {
      'area_id': '43689',
      'code': '620321',
      'p_code': '620300',
      'name': '永昌县'
    }
    ]
  },
  {
    'area_id': '43700',
    'code': '620400',
    'p_code': '620000',
    'name': '白银市',
    'children': [{
      'area_id': '43701',
      'code': '620402',
      'p_code': '620400',
      'name': '白银区'
    },
    {
      'area_id': '43712',
      'code': '620403',
      'p_code': '620400',
      'name': '平川区'
    },
    {
      'area_id': '43724',
      'code': '620421',
      'p_code': '620400',
      'name': '靖远县'
    },
    {
      'area_id': '43743',
      'code': '620422',
      'p_code': '620400',
      'name': '会宁县'
    },
    {
      'area_id': '43772',
      'code': '620423',
      'p_code': '620400',
      'name': '景泰县'
    }
    ]
  },
  {
    'area_id': '43785',
    'code': '620500',
    'p_code': '620000',
    'name': '天水市',
    'children': [{
      'area_id': '43786',
      'code': '620502',
      'p_code': '620500',
      'name': '秦州区'
    },
    {
      'area_id': '43810',
      'code': '620503',
      'p_code': '620500',
      'name': '麦积区'
    },
    {
      'area_id': '43837',
      'code': '620521',
      'p_code': '620500',
      'name': '清水县'
    },
    {
      'area_id': '43857',
      'code': '620522',
      'p_code': '620500',
      'name': '秦安县'
    },
    {
      'area_id': '43875',
      'code': '620523',
      'p_code': '620500',
      'name': '甘谷县'
    },
    {
      'area_id': '43891',
      'code': '620524',
      'p_code': '620500',
      'name': '武山县'
    },
    {
      'area_id': '43907',
      'code': '620525',
      'p_code': '620500',
      'name': '张家川回族自治县'
    }
    ]
  },
  {
    'area_id': '43923',
    'code': '620600',
    'p_code': '620000',
    'name': '武威市',
    'children': [{
      'area_id': '43924',
      'code': '620602',
      'p_code': '620600',
      'name': '凉州区'
    },
    {
      'area_id': '43971',
      'code': '620621',
      'p_code': '620600',
      'name': '民勤县'
    },
    {
      'area_id': '43990',
      'code': '620622',
      'p_code': '620600',
      'name': '古浪县'
    },
    {
      'area_id': '44010',
      'code': '620623',
      'p_code': '620600',
      'name': '天祝藏族自治县'
    }
    ]
  },
  {
    'area_id': '44032',
    'code': '620700',
    'p_code': '620000',
    'name': '张掖市',
    'children': [{
      'area_id': '44033',
      'code': '620702',
      'p_code': '620700',
      'name': '甘州区'
    },
    {
      'area_id': '44061',
      'code': '620721',
      'p_code': '620700',
      'name': '肃南裕固族自治县'
    },
    {
      'area_id': '44072',
      'code': '620722',
      'p_code': '620700',
      'name': '民乐县'
    },
    {
      'area_id': '44084',
      'code': '620723',
      'p_code': '620700',
      'name': '临泽县'
    },
    {
      'area_id': '44098',
      'code': '620724',
      'p_code': '620700',
      'name': '高台县'
    },
    {
      'area_id': '44109',
      'code': '620725',
      'p_code': '620700',
      'name': '山丹县'
    }
    ]
  },
  {
    'area_id': '44120',
    'code': '620800',
    'p_code': '620000',
    'name': '平凉市',
    'children': [{
      'area_id': '44121',
      'code': '620802',
      'p_code': '620800',
      'name': '崆峒区'
    },
    {
      'area_id': '44144',
      'code': '620821',
      'p_code': '620800',
      'name': '泾川县'
    },
    {
      'area_id': '44162',
      'code': '620822',
      'p_code': '620800',
      'name': '灵台县'
    },
    {
      'area_id': '44178',
      'code': '620823',
      'p_code': '620800',
      'name': '崇信县'
    },
    {
      'area_id': '44189',
      'code': '620824',
      'p_code': '620800',
      'name': '华亭县'
    },
    {
      'area_id': '44202',
      'code': '620825',
      'p_code': '620800',
      'name': '庄浪县'
    },
    {
      'area_id': '44222',
      'code': '620826',
      'p_code': '620800',
      'name': '静宁县'
    }
    ]
  },
  {
    'area_id': '44248',
    'code': '620900',
    'p_code': '620000',
    'name': '酒泉市',
    'children': [{
      'area_id': '44249',
      'code': '620902',
      'p_code': '620900',
      'name': '肃州区'
    },
    {
      'area_id': '44275',
      'code': '620921',
      'p_code': '620900',
      'name': '金塔县'
    },
    {
      'area_id': '44290',
      'code': '620922',
      'p_code': '620900',
      'name': '瓜州县'
    },
    {
      'area_id': '44307',
      'code': '620923',
      'p_code': '620900',
      'name': '肃北蒙古族自治县'
    },
    {
      'area_id': '44312',
      'code': '620924',
      'p_code': '620900',
      'name': '阿克塞哈萨克族自治县'
    },
    {
      'area_id': '44316',
      'code': '620981',
      'p_code': '620900',
      'name': '玉门市'
    },
    {
      'area_id': '44337',
      'code': '620982',
      'p_code': '620900',
      'name': '敦煌市'
    }
    ]
  },
  {
    'area_id': '44349',
    'code': '621000',
    'p_code': '620000',
    'name': '庆阳市',
    'children': [{
      'area_id': '44350',
      'code': '621002',
      'p_code': '621000',
      'name': '西峰区'
    },
    {
      'area_id': '44361',
      'code': '621021',
      'p_code': '621000',
      'name': '庆城县'
    },
    {
      'area_id': '44377',
      'code': '621022',
      'p_code': '621000',
      'name': '环县'
    },
    {
      'area_id': '44399',
      'code': '621023',
      'p_code': '621000',
      'name': '华池县'
    },
    {
      'area_id': '44415',
      'code': '621024',
      'p_code': '621000',
      'name': '合水县'
    },
    {
      'area_id': '44428',
      'code': '621025',
      'p_code': '621000',
      'name': '正宁县'
    },
    {
      'area_id': '44439',
      'code': '621026',
      'p_code': '621000',
      'name': '宁县'
    },
    {
      'area_id': '44458',
      'code': '621027',
      'p_code': '621000',
      'name': '镇原县'
    }
    ]
  },
  {
    'area_id': '44478',
    'code': '621100',
    'p_code': '620000',
    'name': '定西市',
    'children': [{
      'area_id': '44479',
      'code': '621102',
      'p_code': '621100',
      'name': '安定区'
    },
    {
      'area_id': '44501',
      'code': '621121',
      'p_code': '621100',
      'name': '通渭县'
    },
    {
      'area_id': '44520',
      'code': '621122',
      'p_code': '621100',
      'name': '陇西县'
    },
    {
      'area_id': '44538',
      'code': '621123',
      'p_code': '621100',
      'name': '渭源县'
    },
    {
      'area_id': '44555',
      'code': '621124',
      'p_code': '621100',
      'name': '临洮县'
    },
    {
      'area_id': '44574',
      'code': '621125',
      'p_code': '621100',
      'name': '漳县'
    },
    {
      'area_id': '44588',
      'code': '621126',
      'p_code': '621100',
      'name': '岷县'
    }
    ]
  },
  {
    'area_id': '44607',
    'code': '621200',
    'p_code': '620000',
    'name': '陇南市',
    'children': [{
      'area_id': '44608',
      'code': '621202',
      'p_code': '621200',
      'name': '武都区'
    },
    {
      'area_id': '44645',
      'code': '621221',
      'p_code': '621200',
      'name': '成县'
    },
    {
      'area_id': '44663',
      'code': '621222',
      'p_code': '621200',
      'name': '文县'
    },
    {
      'area_id': '44684',
      'code': '621223',
      'p_code': '621200',
      'name': '宕昌县'
    },
    {
      'area_id': '44710',
      'code': '621224',
      'p_code': '621200',
      'name': '康县'
    },
    {
      'area_id': '44732',
      'code': '621225',
      'p_code': '621200',
      'name': '西和县'
    },
    {
      'area_id': '44753',
      'code': '621226',
      'p_code': '621200',
      'name': '礼县'
    },
    {
      'area_id': '44783',
      'code': '621227',
      'p_code': '621200',
      'name': '徽县'
    },
    {
      'area_id': '44799',
      'code': '621228',
      'p_code': '621200',
      'name': '两当县'
    }
    ]
  },
  {
    'area_id': '44812',
    'code': '622900',
    'p_code': '620000',
    'name': '临夏回族自治州',
    'children': [{
      'area_id': '44813',
      'code': '622901',
      'p_code': '622900',
      'name': '临夏市'
    },
    {
      'area_id': '44824',
      'code': '622921',
      'p_code': '622900',
      'name': '临夏县'
    },
    {
      'area_id': '44850',
      'code': '622922',
      'p_code': '622900',
      'name': '康乐县'
    },
    {
      'area_id': '44866',
      'code': '622923',
      'p_code': '622900',
      'name': '永靖县'
    },
    {
      'area_id': '44884',
      'code': '622924',
      'p_code': '622900',
      'name': '广河县'
    },
    {
      'area_id': '44894',
      'code': '622925',
      'p_code': '622900',
      'name': '和政县'
    },
    {
      'area_id': '44908',
      'code': '622926',
      'p_code': '622900',
      'name': '东乡族自治县'
    },
    {
      'area_id': '44933',
      'code': '622927',
      'p_code': '622900',
      'name': '积石山保安族东乡族撒拉族自治县'
    }
    ]
  },
  {
    'area_id': '44951',
    'code': '623000',
    'p_code': '620000',
    'name': '甘南藏族自治州',
    'children': [{
      'area_id': '44952',
      'code': '623001',
      'p_code': '623000',
      'name': '合作市'
    },
    {
      'area_id': '44963',
      'code': '623021',
      'p_code': '623000',
      'name': '临潭县'
    },
    {
      'area_id': '44980',
      'code': '623022',
      'p_code': '623000',
      'name': '卓尼县'
    },
    {
      'area_id': '44996',
      'code': '623023',
      'p_code': '623000',
      'name': '舟曲县'
    },
    {
      'area_id': '45016',
      'code': '623024',
      'p_code': '623000',
      'name': '迭部县'
    },
    {
      'area_id': '45028',
      'code': '623025',
      'p_code': '623000',
      'name': '玛曲县'
    },
    {
      'area_id': '45040',
      'code': '623026',
      'p_code': '623000',
      'name': '碌曲县'
    },
    {
      'area_id': '45050',
      'code': '623027',
      'p_code': '623000',
      'name': '夏河县'
    }
    ]
  }
  ]
},
{
  'area_id': '45064',
  'code': '630000',
  'p_code': '0',
  'name': '青海省',
  'children': [{
    'area_id': '45065',
    'code': '630100',
    'p_code': '630000',
    'name': '西宁市',
    'children': [{
      'area_id': '45066',
      'code': '630102',
      'p_code': '630100',
      'name': '城东区'
    },
    {
      'area_id': '45076',
      'code': '630103',
      'p_code': '630100',
      'name': '城中区'
    },
    {
      'area_id': '45086',
      'code': '630104',
      'p_code': '630100',
      'name': '城西区'
    },
    {
      'area_id': '45093',
      'code': '630105',
      'p_code': '630100',
      'name': '城北区'
    },
    {
      'area_id': '45100',
      'code': '630121',
      'p_code': '630100',
      'name': '大通回族土族自治县'
    },
    {
      'area_id': '45121',
      'code': '630122',
      'p_code': '630100',
      'name': '湟中县'
    },
    {
      'area_id': '45139',
      'code': '630123',
      'p_code': '630100',
      'name': '湟源县'
    }
    ]
  },
  {
    'area_id': '45149',
    'code': '632100',
    'p_code': '630000',
    'name': '海东市',
    'children': [{
      'area_id': '45150',
      'code': '632121',
      'p_code': '632100',
      'name': '平安区'
    },
    {
      'area_id': '45159',
      'code': '632122',
      'p_code': '632100',
      'name': '民和回族土族自治县'
    },
    {
      'area_id': '45182',
      'code': '632123',
      'p_code': '632100',
      'name': '乐都区'
    },
    {
      'area_id': '45202',
      'code': '632126',
      'p_code': '632100',
      'name': '互助土族自治县'
    },
    {
      'area_id': '45222',
      'code': '632127',
      'p_code': '632100',
      'name': '化隆回族自治县'
    },
    {
      'area_id': '45242',
      'code': '632128',
      'p_code': '632100',
      'name': '循化撒拉族自治县'
    }
    ]
  },
  {
    'area_id': '45252',
    'code': '632200',
    'p_code': '630000',
    'name': '海北藏族自治州',
    'children': [{
      'area_id': '45253',
      'code': '632221',
      'p_code': '632200',
      'name': '门源回族自治县'
    },
    {
      'area_id': '45268',
      'code': '632222',
      'p_code': '632200',
      'name': '祁连县'
    },
    {
      'area_id': '45276',
      'code': '632223',
      'p_code': '632200',
      'name': '海晏县'
    },
    {
      'area_id': '45283',
      'code': '632224',
      'p_code': '632200',
      'name': '刚察县'
    }
    ]
  },
  {
    'area_id': '45291',
    'code': '632300',
    'p_code': '630000',
    'name': '黄南藏族自治州',
    'children': [{
      'area_id': '45292',
      'code': '632321',
      'p_code': '632300',
      'name': '同仁县'
    },
    {
      'area_id': '45304',
      'code': '632322',
      'p_code': '632300',
      'name': '尖扎县'
    },
    {
      'area_id': '45314',
      'code': '632323',
      'p_code': '632300',
      'name': '泽库县'
    },
    {
      'area_id': '45322',
      'code': '632324',
      'p_code': '632300',
      'name': '河南蒙古族自治县'
    }
    ]
  },
  {
    'area_id': '45328',
    'code': '632500',
    'p_code': '630000',
    'name': '海南藏族自治州',
    'children': [{
      'area_id': '45329',
      'code': '632521',
      'p_code': '632500',
      'name': '共和县'
    },
    {
      'area_id': '45345',
      'code': '632522',
      'p_code': '632500',
      'name': '同德县'
    },
    {
      'area_id': '45352',
      'code': '632523',
      'p_code': '632500',
      'name': '贵德县'
    },
    {
      'area_id': '45360',
      'code': '632524',
      'p_code': '632500',
      'name': '兴海县'
    },
    {
      'area_id': '45369',
      'code': '632525',
      'p_code': '632500',
      'name': '贵南县'
    }
    ]
  },
  {
    'area_id': '45377',
    'code': '632600',
    'p_code': '630000',
    'name': '果洛藏族自治州',
    'children': [{
      'area_id': '45378',
      'code': '632621',
      'p_code': '632600',
      'name': '玛沁县'
    },
    {
      'area_id': '45387',
      'code': '632622',
      'p_code': '632600',
      'name': '班玛县'
    },
    {
      'area_id': '45397',
      'code': '632623',
      'p_code': '632600',
      'name': '甘德县'
    },
    {
      'area_id': '45405',
      'code': '632624',
      'p_code': '632600',
      'name': '达日县'
    },
    {
      'area_id': '45416',
      'code': '632625',
      'p_code': '632600',
      'name': '久治县'
    },
    {
      'area_id': '45423',
      'code': '632626',
      'p_code': '632600',
      'name': '玛多县'
    }
    ]
  },
  {
    'area_id': '45428',
    'code': '632700',
    'p_code': '630000',
    'name': '玉树藏族自治州',
    'children': [{
      'area_id': '45429',
      'code': '632721',
      'p_code': '632700',
      'name': '玉树市'
    },
    {
      'area_id': '45439',
      'code': '632722',
      'p_code': '632700',
      'name': '杂多县'
    },
    {
      'area_id': '45448',
      'code': '632723',
      'p_code': '632700',
      'name': '称多县'
    },
    {
      'area_id': '45456',
      'code': '632724',
      'p_code': '632700',
      'name': '治多县'
    },
    {
      'area_id': '45463',
      'code': '632725',
      'p_code': '632700',
      'name': '囊谦县'
    },
    {
      'area_id': '45474',
      'code': '632726',
      'p_code': '632700',
      'name': '曲麻莱县'
    }
    ]
  },
  {
    'area_id': '45481',
    'code': '632800',
    'p_code': '630000',
    'name': '海西蒙古族藏族自治州',
    'children': [{
      'area_id': '45482',
      'code': '632801',
      'p_code': '632800',
      'name': '格尔木市'
    },
    {
      'area_id': '45494',
      'code': '632802',
      'p_code': '632800',
      'name': '德令哈市'
    },
    {
      'area_id': '45502',
      'code': '632821',
      'p_code': '632800',
      'name': '乌兰县'
    },
    {
      'area_id': '45508',
      'code': '632822',
      'p_code': '632800',
      'name': '都兰县'
    },
    {
      'area_id': '45517',
      'code': '632823',
      'p_code': '632800',
      'name': '天峻县'
    },
    {
      'area_id': '45528',
      'code': '632825',
      'p_code': '632800',
      'name': '海西蒙古族藏族自治州直辖'
    }
    ]
  }
  ]
},
{
  'area_id': '45534',
  'code': '640000',
  'p_code': '0',
  'name': '宁夏回族自治区',
  'children': [{
    'area_id': '45535',
    'code': '640100',
    'p_code': '640000',
    'name': '银川市',
    'children': [{
      'area_id': '45536',
      'code': '640104',
      'p_code': '640100',
      'name': '兴庆区'
    },
    {
      'area_id': '45553',
      'code': '640105',
      'p_code': '640100',
      'name': '西夏区'
    },
    {
      'area_id': '45562',
      'code': '640106',
      'p_code': '640100',
      'name': '金凤区'
    },
    {
      'area_id': '45570',
      'code': '640121',
      'p_code': '640100',
      'name': '永宁县'
    },
    {
      'area_id': '45579',
      'code': '640122',
      'p_code': '640100',
      'name': '贺兰县'
    },
    {
      'area_id': '45589',
      'code': '640181',
      'p_code': '640100',
      'name': '灵武市'
    }
    ]
  },
  {
    'area_id': '45601',
    'code': '640200',
    'p_code': '640000',
    'name': '石嘴山市',
    'children': [{
      'area_id': '45602',
      'code': '640202',
      'p_code': '640200',
      'name': '大武口区'
    },
    {
      'area_id': '45614',
      'code': '640205',
      'p_code': '640200',
      'name': '惠农区'
    },
    {
      'area_id': '45630',
      'code': '640221',
      'p_code': '640200',
      'name': '平罗县'
    }
    ]
  },
  {
    'area_id': '45645',
    'code': '640300',
    'p_code': '640000',
    'name': '吴忠市',
    'children': [{
      'area_id': '45646',
      'code': '640302',
      'p_code': '640300',
      'name': '利通区'
    },
    {
      'area_id': '45662',
      'code': '640303',
      'p_code': '640300',
      'name': '红寺堡区'
    },
    {
      'area_id': '45668',
      'code': '640323',
      'p_code': '640300',
      'name': '盐池县'
    },
    {
      'area_id': '45677',
      'code': '640324',
      'p_code': '640300',
      'name': '同心县'
    },
    {
      'area_id': '45689',
      'code': '640381',
      'p_code': '640300',
      'name': '青铜峡市'
    }
    ]
  },
  {
    'area_id': '45701',
    'code': '640400',
    'p_code': '640000',
    'name': '固原市',
    'children': [{
      'area_id': '45702',
      'code': '640402',
      'p_code': '640400',
      'name': '原州区'
    },
    {
      'area_id': '45717',
      'code': '640422',
      'p_code': '640400',
      'name': '西吉县'
    },
    {
      'area_id': '45737',
      'code': '640423',
      'p_code': '640400',
      'name': '隆德县'
    },
    {
      'area_id': '45752',
      'code': '640424',
      'p_code': '640400',
      'name': '泾源县'
    },
    {
      'area_id': '45760',
      'code': '640425',
      'p_code': '640400',
      'name': '彭阳县'
    }
    ]
  },
  {
    'area_id': '45773',
    'code': '640500',
    'p_code': '640000',
    'name': '中卫市',
    'children': [{
      'area_id': '45774',
      'code': '640502',
      'p_code': '640500',
      'name': '沙坡头区'
    },
    {
      'area_id': '45789',
      'code': '640521',
      'p_code': '640500',
      'name': '中宁县'
    },
    {
      'area_id': '45803',
      'code': '640522',
      'p_code': '640500',
      'name': '海原县'
    }
    ]
  }
  ]
},
{
  'area_id': '45825',
  'code': '650000',
  'p_code': '0',
  'name': '新疆维吾尔自治区',
  'children': [{
    'area_id': '45826',
    'code': '650100',
    'p_code': '650000',
    'name': '乌鲁木齐市',
    'children': [{
      'area_id': '45827',
      'code': '650102',
      'p_code': '650100',
      'name': '天山区'
    },
    {
      'area_id': '45846',
      'code': '650103',
      'p_code': '650100',
      'name': '沙依巴克区'
    },
    {
      'area_id': '45864',
      'code': '650104',
      'p_code': '650100',
      'name': '新市区'
    },
    {
      'area_id': '45884',
      'code': '650105',
      'p_code': '650100',
      'name': '水磨沟区'
    },
    {
      'area_id': '45894',
      'code': '650106',
      'p_code': '650100',
      'name': '头屯河区'
    },
    {
      'area_id': '45904',
      'code': '650107',
      'p_code': '650100',
      'name': '达坂城区'
    },
    {
      'area_id': '45913',
      'code': '650109',
      'p_code': '650100',
      'name': '米东区'
    },
    {
      'area_id': '45927',
      'code': '650121',
      'p_code': '650100',
      'name': '乌鲁木齐县'
    }
    ]
  },
  {
    'area_id': '45934',
    'code': '650200',
    'p_code': '650000',
    'name': '克拉玛依市',
    'children': [{
      'area_id': '45935',
      'code': '650202',
      'p_code': '650200',
      'name': '独山子区'
    },
    {
      'area_id': '45939',
      'code': '650203',
      'p_code': '650200',
      'name': '克拉玛依区'
    },
    {
      'area_id': '45950',
      'code': '650204',
      'p_code': '650200',
      'name': '白碱滩区'
    },
    {
      'area_id': '45953',
      'code': '650205',
      'p_code': '650200',
      'name': '乌尔禾区'
    }
    ]
  },
  {
    'area_id': '45957',
    'code': '652100',
    'p_code': '650000',
    'name': '吐鲁番市',
    'children': [{
      'area_id': '45958',
      'code': '652101',
      'p_code': '652100',
      'name': '高昌区'
    },
    {
      'area_id': '45974',
      'code': '652122',
      'p_code': '652100',
      'name': '鄯善县'
    },
    {
      'area_id': '45987',
      'code': '652123',
      'p_code': '652100',
      'name': '托克逊县'
    }
    ]
  },
  {
    'area_id': '45996',
    'code': '652200',
    'p_code': '650000',
    'name': '哈密市',
    'children': [{
      'area_id': '45997',
      'code': '652201',
      'p_code': '652200',
      'name': '伊州区'
    },
    {
      'area_id': '46033',
      'code': '652222',
      'p_code': '652200',
      'name': '巴里坤哈萨克自治县'
    },
    {
      'area_id': '46049',
      'code': '652223',
      'p_code': '652200',
      'name': '伊吾县'
    }
    ]
  },
  {
    'area_id': '46058',
    'code': '652300',
    'p_code': '650000',
    'name': '昌吉回族自治州',
    'children': [{
      'area_id': '46059',
      'code': '652301',
      'p_code': '652300',
      'name': '昌吉市'
    },
    {
      'area_id': '46080',
      'code': '652302',
      'p_code': '652300',
      'name': '阜康市'
    },
    {
      'area_id': '46094',
      'code': '652323',
      'p_code': '652300',
      'name': '呼图壁县'
    },
    {
      'area_id': '46108',
      'code': '652324',
      'p_code': '652300',
      'name': '玛纳斯县'
    },
    {
      'area_id': '46129',
      'code': '652325',
      'p_code': '652300',
      'name': '奇台县'
    },
    {
      'area_id': '46147',
      'code': '652327',
      'p_code': '652300',
      'name': '吉木萨尔县'
    },
    {
      'area_id': '46159',
      'code': '652328',
      'p_code': '652300',
      'name': '木垒哈萨克自治县'
    }
    ]
  },
  {
    'area_id': '46173',
    'code': '652700',
    'p_code': '650000',
    'name': '博尔塔拉蒙古自治州',
    'children': [{
      'area_id': '46174',
      'code': '652701',
      'p_code': '652700',
      'name': '博乐市'
    },
    {
      'area_id': '46191',
      'code': '652702',
      'p_code': '652700',
      'name': '阿拉山口市'
    },
    {
      'area_id': '46194',
      'code': '652722',
      'p_code': '652700',
      'name': '精河县'
    },
    {
      'area_id': '46204',
      'code': '652723',
      'p_code': '652700',
      'name': '温泉县'
    }
    ]
  },
  {
    'area_id': '46216',
    'code': '652800',
    'p_code': '650000',
    'name': '巴音郭楞蒙古自治州',
    'children': [{
      'area_id': '46217',
      'code': '652801',
      'p_code': '652800',
      'name': '库尔勒市'
    },
    {
      'area_id': '46245',
      'code': '652822',
      'p_code': '652800',
      'name': '轮台县'
    },
    {
      'area_id': '46257',
      'code': '652823',
      'p_code': '652800',
      'name': '尉犁县'
    },
    {
      'area_id': '46269',
      'code': '652824',
      'p_code': '652800',
      'name': '若羌县'
    },
    {
      'area_id': '46279',
      'code': '652825',
      'p_code': '652800',
      'name': '且末县'
    },
    {
      'area_id': '46294',
      'code': '652826',
      'p_code': '652800',
      'name': '焉耆回族自治县'
    },
    {
      'area_id': '46306',
      'code': '652827',
      'p_code': '652800',
      'name': '和静县'
    },
    {
      'area_id': '46324',
      'code': '652828',
      'p_code': '652800',
      'name': '和硕县'
    },
    {
      'area_id': '46335',
      'code': '652829',
      'p_code': '652800',
      'name': '博湖县'
    }
    ]
  },
  {
    'area_id': '46344',
    'code': '652900',
    'p_code': '650000',
    'name': '阿克苏地区',
    'children': [{
      'area_id': '46345',
      'code': '652901',
      'p_code': '652900',
      'name': '阿克苏市'
    },
    {
      'area_id': '46368',
      'code': '652922',
      'p_code': '652900',
      'name': '温宿县'
    },
    {
      'area_id': '46393',
      'code': '652923',
      'p_code': '652900',
      'name': '库车县'
    },
    {
      'area_id': '46420',
      'code': '652924',
      'p_code': '652900',
      'name': '沙雅县'
    },
    {
      'area_id': '46437',
      'code': '652925',
      'p_code': '652900',
      'name': '新和县'
    },
    {
      'area_id': '46448',
      'code': '652926',
      'p_code': '652900',
      'name': '拜城县'
    },
    {
      'area_id': '46465',
      'code': '652927',
      'p_code': '652900',
      'name': '乌什县'
    },
    {
      'area_id': '46476',
      'code': '652928',
      'p_code': '652900',
      'name': '阿瓦提县'
    },
    {
      'area_id': '46491',
      'code': '652929',
      'p_code': '652900',
      'name': '柯坪县'
    }
    ]
  },
  {
    'area_id': '46497',
    'code': '653000',
    'p_code': '650000',
    'name': '克孜勒苏柯尔克孜自治州',
    'children': [{
      'area_id': '46498',
      'code': '653001',
      'p_code': '653000',
      'name': '阿图什市'
    },
    {
      'area_id': '46509',
      'code': '653022',
      'p_code': '653000',
      'name': '阿克陶县'
    },
    {
      'area_id': '46528',
      'code': '653023',
      'p_code': '653000',
      'name': '阿合奇县'
    },
    {
      'area_id': '46535',
      'code': '653024',
      'p_code': '653000',
      'name': '乌恰县'
    }
    ]
  },
  {
    'area_id': '46548',
    'code': '653100',
    'p_code': '650000',
    'name': '喀什地区',
    'children': [{
      'area_id': '46549',
      'code': '653101',
      'p_code': '653100',
      'name': '喀什市'
    },
    {
      'area_id': '46567',
      'code': '653121',
      'p_code': '653100',
      'name': '疏附县'
    },
    {
      'area_id': '46584',
      'code': '653122',
      'p_code': '653100',
      'name': '疏勒县'
    },
    {
      'area_id': '46602',
      'code': '653123',
      'p_code': '653100',
      'name': '英吉沙县'
    },
    {
      'area_id': '46619',
      'code': '653124',
      'p_code': '653100',
      'name': '泽普县'
    },
    {
      'area_id': '46636',
      'code': '653125',
      'p_code': '653100',
      'name': '莎车县'
    },
    {
      'area_id': '46676',
      'code': '653126',
      'p_code': '653100',
      'name': '叶城县'
    },
    {
      'area_id': '46706',
      'code': '653127',
      'p_code': '653100',
      'name': '麦盖提县'
    },
    {
      'area_id': '46723',
      'code': '653128',
      'p_code': '653100',
      'name': '岳普湖县'
    },
    {
      'area_id': '46739',
      'code': '653129',
      'p_code': '653100',
      'name': '伽师县'
    },
    {
      'area_id': '46754',
      'code': '653130',
      'p_code': '653100',
      'name': '巴楚县'
    },
    {
      'area_id': '46768',
      'code': '653131',
      'p_code': '653100',
      'name': '塔什库尔干塔吉克自治县'
    }
    ]
  },
  {
    'area_id': '46783',
    'code': '653200',
    'p_code': '650000',
    'name': '和田地区',
    'children': [{
      'area_id': '46784',
      'code': '653201',
      'p_code': '653200',
      'name': '和田市'
    },
    {
      'area_id': '46798',
      'code': '653221',
      'p_code': '653200',
      'name': '和田县'
    },
    {
      'area_id': '46812',
      'code': '653222',
      'p_code': '653200',
      'name': '墨玉县'
    },
    {
      'area_id': '46830',
      'code': '653223',
      'p_code': '653200',
      'name': '皮山县'
    },
    {
      'area_id': '46852',
      'code': '653224',
      'p_code': '653200',
      'name': '洛浦县'
    },
    {
      'area_id': '46864',
      'code': '653225',
      'p_code': '653200',
      'name': '策勒县'
    },
    {
      'area_id': '46874',
      'code': '653226',
      'p_code': '653200',
      'name': '于田县'
    },
    {
      'area_id': '46893',
      'code': '653227',
      'p_code': '653200',
      'name': '民丰县'
    }
    ]
  },
  {
    'area_id': '46901',
    'code': '654000',
    'p_code': '650000',
    'name': '伊犁哈萨克自治州',
    'children': [{
      'area_id': '46902',
      'code': '654002',
      'p_code': '654000',
      'name': '伊宁市'
    },
    {
      'area_id': '46924',
      'code': '654003',
      'p_code': '654000',
      'name': '奎屯市'
    },
    {
      'area_id': '46933',
      'code': '654004',
      'p_code': '654000',
      'name': '霍尔果斯市'
    },
    {
      'area_id': '46941',
      'code': '654021',
      'p_code': '654000',
      'name': '伊宁县'
    },
    {
      'area_id': '46963',
      'code': '654022',
      'p_code': '654000',
      'name': '察布查尔锡伯自治县'
    },
    {
      'area_id': '46984',
      'code': '654023',
      'p_code': '654000',
      'name': '霍城县'
    },
    {
      'area_id': '47006',
      'code': '654024',
      'p_code': '654000',
      'name': '巩留县'
    },
    {
      'area_id': '47022',
      'code': '654025',
      'p_code': '654000',
      'name': '新源县'
    },
    {
      'area_id': '47038',
      'code': '654026',
      'p_code': '654000',
      'name': '昭苏县'
    },
    {
      'area_id': '47056',
      'code': '654027',
      'p_code': '654000',
      'name': '特克斯县'
    },
    {
      'area_id': '47068',
      'code': '654028',
      'p_code': '654000',
      'name': '尼勒克县'
    }
    ]
  },
  {
    'area_id': '47083',
    'code': '654200',
    'p_code': '650000',
    'name': '塔城地区',
    'children': [{
      'area_id': '47084',
      'code': '654201',
      'p_code': '654200',
      'name': '塔城市'
    },
    {
      'area_id': '47100',
      'code': '654202',
      'p_code': '654200',
      'name': '乌苏市'
    },
    {
      'area_id': '47132',
      'code': '654221',
      'p_code': '654200',
      'name': '额敏县'
    },
    {
      'area_id': '47156',
      'code': '654223',
      'p_code': '654200',
      'name': '沙湾县'
    },
    {
      'area_id': '47179',
      'code': '654224',
      'p_code': '654200',
      'name': '托里县'
    },
    {
      'area_id': '47191',
      'code': '654225',
      'p_code': '654200',
      'name': '裕民县'
    },
    {
      'area_id': '47200',
      'code': '654226',
      'p_code': '654200',
      'name': '和布克赛尔蒙古自治县'
    }
    ]
  },
  {
    'area_id': '47216',
    'code': '654300',
    'p_code': '650000',
    'name': '阿勒泰地区',
    'children': [{
      'area_id': '47217',
      'code': '654301',
      'p_code': '654300',
      'name': '阿勒泰市'
    },
    {
      'area_id': '47234',
      'code': '654321',
      'p_code': '654300',
      'name': '布尔津县'
    },
    {
      'area_id': '47242',
      'code': '654322',
      'p_code': '654300',
      'name': '富蕴县'
    },
    {
      'area_id': '47253',
      'code': '654323',
      'p_code': '654300',
      'name': '福海县'
    },
    {
      'area_id': '47264',
      'code': '654324',
      'p_code': '654300',
      'name': '哈巴河县'
    },
    {
      'area_id': '47273',
      'code': '654325',
      'p_code': '654300',
      'name': '青河县'
    },
    {
      'area_id': '47281',
      'code': '654326',
      'p_code': '654300',
      'name': '吉木乃县'
    }
    ]
  },
  {
    'area_id': '47290',
    'code': '659000',
    'p_code': '650000',
    'name': '可克达拉市',
    'children': [{
      'area_id': '47291',
      'code': '659007',
      'p_code': '659000',
      'name': '双河市'
    },
    {
      'area_id': '47297',
      'code': '659008',
      'p_code': '659000',
      'name': '可克达拉市'
    }
    ]
  },
  {
    'area_id': '47304',
    'code': '659001',
    'p_code': '650000',
    'name': '石河子市'
  },
  {
    'area_id': '47313',
    'code': '659002',
    'p_code': '650000',
    'name': '阿拉尔市'
  },
  {
    'area_id': '47333',
    'code': '659003',
    'p_code': '650000',
    'name': '图木舒克市'
  },
  {
    'area_id': '47344',
    'code': '659004',
    'p_code': '650000',
    'name': '五家渠市'
  },
  {
    'area_id': '47351',
    'code': '659005',
    'p_code': '650000',
    'name': '北屯市'
  },
  {
    'area_id': '47356',
    'code': '659006',
    'p_code': '650000',
    'name': '铁门关市'
  },
  {
    'area_id': '47359',
    'code': '659009',
    'p_code': '650000',
    'name': '昆玉市'
  }
  ]
}
]
export {
  locateData
}
